Nsing-Community/Nsing-Pack/Nations_Device_PACK_Add_To_IAR_Tool/Nations Device PACK/debugger/Nsing/N32G41x/N32G41x.svd
<?xml version="1.0" encoding="utf-8" standalone="no"?>
<device
    schemaVersion="1.3"
    xmlns:xs="http://www.w3.org/2001/XMLSchema-instance"
    xs:noNamespaceSchemaLocation="CMSIS-SVD.xsd">
    <vendor>Nsingtech Ltd.</vendor>
    <vendorID>NS</vendorID>
    <name>N32G41x</name>
    <version>1.0</version>
    <description>N32G41x</description>
    <addressUnitBits>8</addressUnitBits>
    <width>32</width>
    <size>32</size>
    <access>read-write</access>
    <resetValue>0</resetValue>
    <resetMask>0xffffffff</resetMask>
    <cpu>
        <name>CM4</name>
        <revision>r0p1</revision>
        <endian>little</endian>
        <mpuPresent>false</mpuPresent>
        <fpuPresent>false</fpuPresent>
        <nvicPrioBits>4</nvicPrioBits>
        <vendorSystickConfig>false</vendorSystickConfig>
    </cpu>
    <peripherals>
    <peripheral>
        <name>ADC1</name>
        <description>Analog-to-digital converter</description>
        <groupName>ADC</groupName>
        <baseAddress>0x40020800</baseAddress>
        <addressBlock>
            <offset>0x0</offset>
            <size>0x100</size>
            <usage>registers</usage>
        </addressBlock>
        <interrupt>
            <name>ADC1</name>
            <description>ADC1 global interrupt</description>
            <value>19</value>
        </interrupt>
        <registers>
            <register>
                <name>ADC_STS</name>
                <displayName>ADC_STS</displayName>
                <description>ADC Status Register</description>
                <addressOffset>0x00</addressOffset>
                <size>0x20</size>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>VREFRDY</name>
                        <description>Internal input buffer ready status flag</description>
                        <bitOffset>12</bitOffset>
                        <bitWidth>1</bitWidth>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>JSTR</name>
                        <description>Inject channel start flag</description>
                        <bitOffset>11</bitOffset>
                        <bitWidth>1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>STR</name>
                        <description>Regular channel start flag</description>
                        <bitOffset>10</bitOffset>
                        <bitWidth>1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>TCFLAG</name>
                        <description>Turncate flag after oversampling</description>
                        <bitOffset>9</bitOffset>
                        <bitWidth>1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>EOSAMP</name>
                        <description>Regular channel sample end flag</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>PDRDY</name>
                        <description>Power down ready</description>
                        <bitOffset>7</bitOffset>
                        <bitWidth>1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>RDY</name>
                        <description>ADC ready</description>
                        <bitOffset>6</bitOffset>
                        <bitWidth>1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>OVR</name>
                        <description>ADC overrun flag</description>
                        <bitOffset>5</bitOffset>
                        <bitWidth>1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>AWDG</name>
                        <description>Analog watchdog flag</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>JENDCA</name>
                        <description>Any injected channel end of conversion</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>JENDC</name>
                        <description>Injected channel end of conversion</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>ENDCA</name>
                        <description>Any regular channel end of conversion</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>ENDC</name>
                        <description>End of conversion</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>ADC_CTRL1</name>
                <displayName>ADC_CTRL1</displayName>
                <description>ADC Control Register 1</description>
                <addressOffset>0x04</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>DELAY</name>
                        <description>Delay between two sampling phases</description>
                        <bitOffset>20</bitOffset>
                        <bitWidth>4</bitWidth>
                    </field>
                    <field>
                        <name>AWDSGLEN</name>
                        <description>Enable watchdog on a single channel in scan mode</description>
                        <bitOffset>19</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>AWDEJCH</name>
                        <description>Analog watchdog enable on injected channels</description>
                        <bitOffset>18</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>AWDERCH</name>
                        <description>Analog watchdog enable on regular channels</description>
                        <bitOffset>17</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>AWDCH</name>
                        <description>Analog watchdog channel select bits</description>
                        <bitOffset>12</bitOffset>
                        <bitWidth>5</bitWidth>
                    </field>
                    <field>
                        <name>MULTMODE</name>
                        <description>Multi ADC mode selection</description>
                        <bitOffset>7</bitOffset>
                        <bitWidth>3</bitWidth>
                    </field>
                    <field>
                        <name>DJCH</name>
                        <description>Discontinuous mode on injected channels</description>
                        <bitOffset>6</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>DREGCH</name>
                        <description>Discontinuous mode on regular channels</description>
                        <bitOffset>5</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>DCTU</name>
                        <description>Discontinuous mode channel count</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>3</bitWidth>
                    </field>
                    <field>
                        <name>AUTOJC</name>
                        <description>Automatic injected group conversion</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>SCANMD</name>
                        <description>Scan mode</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>ADC_CTRL2</name>
                <displayName>ADC_CTRL2</displayName>
                <description>ADC Control Register 2</description>
                <addressOffset>0x08</addressOffset>
                <size>0x20</size>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>SWRSTOP</name>
                        <description>Stop conversion of regular channels</description>
                        <bitOffset>30</bitOffset>
                        <bitWidth>1</bitWidth>
                        <access>write-only</access>
                    </field>
                    <field>
                        <name>SWJSTOP</name>
                        <description>Stop conversion of injected channels</description>
                        <bitOffset>29</bitOffset>
                        <bitWidth>1</bitWidth>
                        <access>write-only</access>
                    </field>
                    <field>
                        <name>SWSTRRCH</name>
                        <description>Start conversion of regular channels</description>
                        <bitOffset>28</bitOffset>
                        <bitWidth>1</bitWidth>
                        <access>write-only</access>
                    </field>
                    <field>
                        <name>SWSTRJCH</name>
                        <description>Start conversion of injected channels</description>
                        <bitOffset>27</bitOffset>
                        <bitWidth>1</bitWidth>
                        <access>write-only</access>
                    </field>
                    <field>
                        <name>TEMPEN</name>
                        <description>Temperature sensor enable</description>
                        <bitOffset>25</bitOffset>
                        <bitWidth>1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>ALIG</name>
                        <description>Data alignment</description>
                        <bitOffset>24</bitOffset>
                        <bitWidth>1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>DMAMD</name>
                        <description>DMA mode</description>
                        <bitOffset>22</bitOffset>
                        <bitWidth>1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>EXTRSEL</name>
                        <description>External event select for regular group</description>
                        <bitOffset>17</bitOffset>
                        <bitWidth>5</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>EXTJSEL</name>
                        <description>External event select for injected group</description>
                        <bitOffset>12</bitOffset>
                        <bitWidth>5</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>EXTPJSEL</name>
                        <description>External trigger polarity selection for injected channels</description>
                        <bitOffset>6</bitOffset>
                        <bitWidth>2</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>EXTPRSEL</name>
                        <description>External trigger polarity selection for regular channels</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>2</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>CTU</name>
                        <description>Continuous conversion</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>ON</name>
                        <description>A/D converter ON/OFF</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>ADC_CTRL3</name>
                <displayName>ADC_CTRL3</displayName>
                <description>ADC Control Register 3</description>
                <addressOffset>0x0C</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00000040</resetValue>
                <fields>
                    <field>
                        <name>BUFSEL</name>
                        <description>VREFP mode selection</description>
                        <bitOffset>13</bitOffset>
                        <bitWidth>2</bitWidth>
                    </field>
                    <field>
                        <name>VREFEN</name>
                        <description>VREFINT enable</description>
                        <bitOffset>12</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>OSRMD</name>
                        <description>Regular channels oversample mode</description>
                        <bitOffset>11</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>OSRTRIG</name>
                        <description>Regular channels oversample trigger</description>
                        <bitOffset>10</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>OSJE</name>
                        <description>Injected channels oversample enable</description>
                        <bitOffset>9</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>OSRE</name>
                        <description>Regular channels oversample enable</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>OSS</name>
                        <description>Oversample data right shift bit width</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>4</bitWidth>
                    </field>
                    <field>
                        <name>OSR</name>
                        <description>Oversample rate configuration</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>4</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>ADC_SAMP1</name>
                <displayName>ADC_SAMP1</displayName>
                <description>ADC Sample Time Register 1</description>
                <addressOffset>0x10</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>SAMP7</name>
                        <description>Channel 7 sampling time selection</description>
                        <bitOffset>28</bitOffset>
                        <bitWidth>4</bitWidth>
                    </field>
                    <field>
                        <name>SAMP6</name>
                        <description>Channel 6 sampling time selection</description>
                        <bitOffset>24</bitOffset>
                        <bitWidth>4</bitWidth>
                    </field>
                    <field>
                        <name>SAMP5</name>
                        <description>Channel 5 sampling time selection</description>
                        <bitOffset>20</bitOffset>
                        <bitWidth>4</bitWidth>
                    </field>
                    <field>
                        <name>SAMP4</name>
                        <description>Channel 4 sampling time selection</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>4</bitWidth>
                    </field>
                    <field>
                        <name>SAMP3</name>
                        <description>Channel 3 sampling time selection</description>
                        <bitOffset>12</bitOffset>
                        <bitWidth>4</bitWidth>
                    </field>
                    <field>
                        <name>SAMP2</name>
                        <description>Channel 2 sampling time selection</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>4</bitWidth>
                    </field>
                    <field>
                        <name>SAMP1</name>
                        <description>Channel 1 sampling time selection</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>4</bitWidth>
                    </field>
                    <field>
                        <name>SAMP0</name>
                        <description>Channel 0 sampling time selection</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>4</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>ADC_SAMP2</name>
                <displayName>ADC_SAMP2</displayName>
                <description>ADC Sample Time Register 2</description>
                <addressOffset>0x14</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>SAMP15</name>
                        <description>Channel 15 sampling time selection</description>
                        <bitOffset>28</bitOffset>
                        <bitWidth>4</bitWidth>
                    </field>
                    <field>
                        <name>SAMP14</name>
                        <description>Channel 14 sampling time selection</description>
                        <bitOffset>24</bitOffset>
                        <bitWidth>4</bitWidth>
                    </field>
                    <field>
                        <name>SAMP13</name>
                        <description>Channel 13 sampling time selection</description>
                        <bitOffset>20</bitOffset>
                        <bitWidth>4</bitWidth>
                    </field>
                    <field>
                        <name>SAMP12</name>
                        <description>Channel 12 sampling time selection</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>4</bitWidth>
                    </field>
                    <field>
                        <name>SAMP11</name>
                        <description>Channel 11 sampling time selection</description>
                        <bitOffset>12</bitOffset>
                        <bitWidth>4</bitWidth>
                    </field>
                    <field>
                        <name>SAMP10</name>
                        <description>Channel 10 sampling time selection</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>4</bitWidth>
                    </field>
                    <field>
                        <name>SAMP9</name>
                        <description>Channel 9 sampling time selection</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>4</bitWidth>
                    </field>
                    <field>
                        <name>SAMP8</name>
                        <description>Channel 8 sampling time selection</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>4</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>ADC_SAMP3</name>
                <displayName>ADC_SAMP3</displayName>
                <description>ADC Sample Time Register 3</description>
                <addressOffset>0x18</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>SAMP18</name>
                        <description>Channel 18 sampling time selection</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>4</bitWidth>
                    </field>
                    <field>
                        <name>SAMP17</name>
                        <description>Channel 17 sampling time selection</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>4</bitWidth>
                    </field>
                    <field>
                        <name>SAMP16</name>
                        <description>Channel 16 sampling time selection</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>4</bitWidth>
                    </field>
                </fields>
            </register>
