Nsing-Community/Nsing-Pack/Nations_Device_PACK_Add_To_IAR_Tool/Nations Device PACK/debugger/Nsing/N32G41x/N32G41x.svd
            <register>
                <name>ADC_INTEN</name>
                <displayName>ADC_INTEN</displayName>
                <description>ADC Interrupt Enable Register</description>
                <addressOffset>0x1C</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>EOSAMPIEN</name>
                        <description>ADC sample done interrupt enable</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>PDRDYIEN</name>
                        <description>Power down ready interrupt enable</description>
                        <bitOffset>7</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>RDYIEN</name>
                        <description>Ready interrupt enable</description>
                        <bitOffset>6</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>OVRIEN</name>
                        <description>ADC overrun interrupt enable</description>
                        <bitOffset>5</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>AWDIEN</name>
                        <description>Analog watchdog interrupt enable</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>JENDCAIEN</name>
                        <description>Interrupt enable for any injected channel</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>JENDCIEN</name>
                        <description>Interrupt enable for injected channels</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>ENDCAIEN</name>
                        <description>Interrupt enable for any regular channel</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>ENDCIEN</name>
                        <description>Interrupt enable for ENDC</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>ADC_OFFSET1</name>
                <displayName>ADC_OFFSET1</displayName>
                <description>ADC Data Offset Register 1</description>
                <addressOffset>0x20</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>OFFSCH1EN</name>
                        <description>Offset channel 1 enable</description>
                        <bitOffset>31</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>OFFSCH1CH</name>
                        <description>Offset channel 1 selection</description>
                        <bitOffset>26</bitOffset>
                        <bitWidth>5</bitWidth>
                    </field>
                    <field>
                        <name>OFFSCH1SATEN</name>
                        <description>Saturation enable</description>
                        <bitOffset>25</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>OFFSCH1DIR</name>
                        <description>Offset direction</description>
                        <bitOffset>24</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>OFFSCH1DAT</name>
                        <description>Data offset for channel 1</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>12</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>ADC_OFFSET2</name>
                <displayName>ADC_OFFSET2</displayName>
                <description>ADC Data Offset Register 2</description>
                <addressOffset>0x24</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>OFFSCH2EN</name>
                        <description>Offset channel 2 enable</description>
                        <bitOffset>31</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>OFFSCH2CH</name>
                        <description>Offset channel 2 selection</description>
                        <bitOffset>26</bitOffset>
                        <bitWidth>5</bitWidth>
                    </field>
                    <field>
                        <name>OFFSCH2SATEN</name>
                        <description>Saturation enable</description>
                        <bitOffset>25</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>OFFSCH2DIR</name>
                        <description>Offset direction</description>
                        <bitOffset>24</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>OFFSCH2DAT</name>
                        <description>Data offset for channel 2</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>12</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>ADC_OFFSET3</name>
                <displayName>ADC_OFFSET3</displayName>
                <description>ADC Data Offset Register 3</description>
                <addressOffset>0x28</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>OFFSCH3EN</name>
                        <description>Offset channel 3 enable</description>
                        <bitOffset>31</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>OFFSCH3CH</name>
                        <description>Offset channel 3 selection</description>
                        <bitOffset>26</bitOffset>
                        <bitWidth>5</bitWidth>
                    </field>
                    <field>
                        <name>OFFSCH3SATEN</name>
                        <description>Saturation enable</description>
                        <bitOffset>25</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>OFFSCH3DIR</name>
                        <description>Offset direction</description>
                        <bitOffset>24</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>OFFSCH3DAT</name>
                        <description>Data offset for channel 3</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>12</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>ADC_OFFSET4</name>
                <displayName>ADC_OFFSET4</displayName>
                <description>ADC Data Offset Register 4</description>
                <addressOffset>0x2C</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>OFFSCH4EN</name>
                        <description>Offset channel 4 enable</description>
                        <bitOffset>31</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>OFFSCH4CH</name>
                        <description>Offset channel 4 selection</description>
                        <bitOffset>26</bitOffset>
                        <bitWidth>5</bitWidth>
                    </field>
                    <field>
                        <name>OFFSCH4SATEN</name>
                        <description>Saturation enable</description>
                        <bitOffset>25</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>OFFSCH4DIR</name>
                        <description>Offset direction</description>
                        <bitOffset>24</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>OFFSCH4DAT</name>
                        <description>Data offset for channel 4</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>12</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>ADC_AWDHIGH</name>
                <displayName>ADC_AWDHIGH</displayName>
                <description>ADC Watchdog High Threshold Register</description>
                <addressOffset>0x30</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00000FFF</resetValue>
                <fields>
                    <field>
                        <name>HTH</name>
                        <description>Analog watchdog high threshold</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>12</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>ADC_AWDLOW</name>
                <displayName>ADC_AWDLOW</displayName>
                <description>ADC Watchdog Low Threshold Register</description>
                <addressOffset>0x34</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>LTH</name>
                        <description>Analog watchdog low threshold</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>12</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>ADC_RSEQ1</name>
                <displayName>ADC_RSEQ1</displayName>
                <description>ADC Regular Sequence Register 1</description>
                <addressOffset>0x60</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>SEQ6</name>
                        <description>6th conversion in regular sequence</description>
                        <bitOffset>25</bitOffset>
                        <bitWidth>5</bitWidth>
                    </field>
                    <field>
                        <name>SEQ5</name>
                        <description>5th conversion in regular sequence</description>
                        <bitOffset>20</bitOffset>
                        <bitWidth>5</bitWidth>
                    </field>
                    <field>
                        <name>SEQ4</name>
                        <description>4th conversion in regular sequence</description>
                        <bitOffset>15</bitOffset>
                        <bitWidth>5</bitWidth>
                    </field>
                    <field>
                        <name>SEQ3</name>
                        <description>3rd conversion in regular sequence</description>
                        <bitOffset>10</bitOffset>
                        <bitWidth>5</bitWidth>
                    </field>
                    <field>
                        <name>SEQ2</name>
                        <description>2nd conversion in regular sequence</description>
                        <bitOffset>5</bitOffset>
                        <bitWidth>5</bitWidth>
                    </field>
                    <field>
                        <name>SEQ1</name>
                        <description>1st conversion in regular sequence</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>5</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>ADC_RSEQ2</name>
                <displayName>ADC_RSEQ2</displayName>
                <description>ADC Regular Sequence Register 2</description>
                <addressOffset>0x64</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>SEQ12</name>
                        <description>12th conversion in regular sequence</description>
                        <bitOffset>25</bitOffset>
                        <bitWidth>5</bitWidth>
                    </field>
                    <field>
                        <name>SEQ11</name>
                        <description>11th conversion in regular sequence</description>
                        <bitOffset>20</bitOffset>
                        <bitWidth>5</bitWidth>
                    </field>
                    <field>
                        <name>SEQ10</name>
                        <description>10th conversion in regular sequence</description>
                        <bitOffset>15</bitOffset>
                        <bitWidth>5</bitWidth>
                    </field>
                    <field>
                        <name>SEQ9</name>
                        <description>9th conversion in regular sequence</description>
                        <bitOffset>10</bitOffset>
                        <bitWidth>5</bitWidth>
                    </field>
                    <field>
                        <name>SEQ8</name>
                        <description>8th conversion in regular sequence</description>
                        <bitOffset>5</bitOffset>
                        <bitWidth>5</bitWidth>
                    </field>
                    <field>
                        <name>SEQ7</name>
                        <description>7th conversion in regular sequence</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>5</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>ADC_RSEQ3</name>
                <displayName>ADC_RSEQ3</displayName>
                <description>ADC Regular Sequence Register 3</description>
                <addressOffset>0x68</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>LEN</name>
                        <description>Regular channel sequence length</description>
                        <bitOffset>25</bitOffset>
                        <bitWidth>4</bitWidth>
                    </field>
                    <field>
                        <name>SEQ16</name>
                        <description>16th conversion in regular sequence</description>
                        <bitOffset>15</bitOffset>
                        <bitWidth>5</bitWidth>
                    </field>
                    <field>
                        <name>SEQ15</name>
                        <description>15th conversion in regular sequence</description>
                        <bitOffset>10</bitOffset>
                        <bitWidth>5</bitWidth>
                    </field>
                    <field>
                        <name>SEQ14</name>
                        <description>14th conversion in regular sequence</description>
                        <bitOffset>5</bitOffset>
                        <bitWidth>5</bitWidth>
                    </field>
                    <field>
                        <name>SEQ13</name>
                        <description>13th conversion in regular sequence</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>5</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>ADC_JSEQ</name>
                <displayName>ADC_JSEQ</displayName>
                <description>ADC Injected Sequence Register</description>
                <addressOffset>0x6C</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>JLEN</name>
                        <description>Injected sequence length</description>
                        <bitOffset>25</bitOffset>
                        <bitWidth>2</bitWidth>
                    </field>
                    <field>
                        <name>JSEQ4</name>
                        <description>4th conversion in injected sequence</description>
                        <bitOffset>15</bitOffset>
                        <bitWidth>5</bitWidth>
                    </field>
                    <field>
                        <name>JSEQ3</name>
                        <description>3rd conversion in injected sequence</description>
                        <bitOffset>10</bitOffset>
                        <bitWidth>5</bitWidth>
                    </field>
                    <field>
                        <name>JSEQ2</name>
                        <description>2nd conversion in injected sequence</description>
                        <bitOffset>5</bitOffset>
                        <bitWidth>5</bitWidth>
                    </field>
                    <field>
                        <name>JSEQ1</name>
                        <description>1st conversion in injected sequence</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>5</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>ADC_JDAT1</name>
                <displayName>ADC_JDAT1</displayName>
                <description>ADC Injected Data Register 1</description>
                <addressOffset>0x70</addressOffset>
                <size>0x20</size>
                <access>read-only</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>JDAT</name>
                        <description>Injected data</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>16</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>ADC_JDAT2</name>
                <displayName>ADC_JDAT2</displayName>
                <description>ADC Injected Data Register 2</description>
                <addressOffset>0x74</addressOffset>
                <size>0x20</size>
                <access>read-only</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>JDAT</name>
                        <description>Injected data</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>16</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>ADC_JDAT3</name>
                <displayName>ADC_JDAT3</displayName>
                <description>ADC Injected Data Register 3</description>
                <addressOffset>0x78</addressOffset>
                <size>0x20</size>
                <access>read-only</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>JDAT</name>
                        <description>Injected data</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>16</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>ADC_JDAT4</name>
                <displayName>ADC_JDAT4</displayName>
                <description>ADC Injected Data Register 4</description>
                <addressOffset>0x7C</addressOffset>
                <size>0x20</size>
                <access>read-only</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>JDAT</name>
                        <description>Injected data</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>16</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>ADC_DAT</name>
                <displayName>ADC_DAT</displayName>
                <description>ADC Regular Data Register</description>
                <addressOffset>0x80</addressOffset>
                <size>0x20</size>
                <access>read-only</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>DAT2</name>
                        <description>2nd data item of a pair of regular conversions</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>16</bitWidth>
                    </field>
                    <field>
                        <name>DAT1</name>
                        <description>1st data item of a pair of regular conversions</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>16</bitWidth>
                    </field>
                </fields>
            </register>
