Nsing-Community/Nsing-Pack/Nations_Device_PACK_Add_To_IAR_Tool/Nations Device PACK/debugger/Nsing/N32G41x/N32G41x.svd
            <register>
                <name>ADC_CTRL4</name>
                <displayName>ADC_CTRL4</displayName>
                <description>ADC Control Register 4</description>
                <addressOffset>0x94</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x002E1000</resetValue>
                <fields>
                    <field>
                        <name>EXTRISEL</name>
                        <description>EXTI line selection for injected channel external trigger</description>
                        <bitOffset>20</bitOffset>
                        <bitWidth>4</bitWidth>
                    </field>
                    <field>
                        <name>EXTRRSEL</name>
                        <description>EXTI line selection for regular channel external trigger</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>4</bitWidth>
                    </field>
                </fields>
            </register>
        </registers>
    </peripheral>
    <peripheral derivedFrom="ADC1">
        <name>ADC2</name>
        <baseAddress>0x40020900</baseAddress>
        <interrupt>
            <name>ADC2</name>
            <description>ADC2 global interrupt</description>
            <value>18</value>
        </interrupt>
    </peripheral>
    <peripheral>
        <name>COMP</name>
        <description>Comparator</description>
        <groupName>COMP</groupName>
        <baseAddress>0x40002400</baseAddress>
        <addressBlock>
            <offset>0x0</offset>
            <size>0x400</size>
            <usage>registers</usage>
        </addressBlock>
        <interrupt>
            <name>COMP1_2_3</name>
            <description>COMP1/2/3 global interrupt</description>
            <value>22</value>
        </interrupt>
        <registers>
            <register>
                <name>COMP_INTEN</name>
                <displayName>COMP_INTEN</displayName>
                <description>COMP Interrupt Enable Register</description>
                <addressOffset>0x00</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>CMP3IEN</name>
                        <description>Comparator 3 interrupt enable</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>CMP2IEN</name>
                        <description>Comparator 2 interrupt enable</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>CMP1IEN</name>
                        <description>Comparator 1 interrupt enable</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>COMP_INTSTS</name>
                <displayName>COMP_INTSTS</displayName>
                <description>COMP Interrupt Status Register</description>
                <addressOffset>0x04</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>CMP3IS</name>
                        <description>Comparator 3 interrupt status flag, write 1 to clear</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>CMP2IS</name>
                        <description>Comparator 2 interrupt status flag, write 1 to clear</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>CMP1IS</name>
                        <description>Comparator 1 interrupt status flag, write 1 to clear</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>COMP_WINMODE</name>
                <displayName>COMP_WINMODE</displayName>
                <description>COMP Window Mode Register</description>
                <addressOffset>0x08</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>CMP23MD</name>
                        <description>Comparator 2 and 3 window mode selection</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>CMP12MD</name>
                        <description>Comparator 1 and 2 window mode selection</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>COMP_LOCK</name>
                <displayName>COMP_LOCK</displayName>
                <description>COMP Lock Register</description>
                <addressOffset>0x0C</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>CMP3LK</name>
                        <description>Comparator 3 lock bit</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>CMP2LK</name>
                        <description>Comparator 2 lock bit</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>CMP1LK</name>
                        <description>Comparator 1 lock bit</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>COMP1_CTRL</name>
                <displayName>COMP1_CTRL</displayName>
                <description>COMP1 Control Register</description>
                <addressOffset>0x10</addressOffset>
                <size>0x20</size>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>OUT</name>
                        <description>Analog comparator output status</description>
                        <bitOffset>24</bitOffset>
                        <bitWidth>1</bitWidth>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>CLKSEL</name>
                        <description>Clock selection</description>
                        <bitOffset>21</bitOffset>
                        <bitWidth>1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>PWRMD</name>
                        <description>Comparator control mode selection</description>
                        <bitOffset>20</bitOffset>
                        <bitWidth>1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>BLKING</name>
                        <description>Blanking source selection</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>3</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>DOUHYSIEN</name>
                        <description>Comparator dual hysteresis selection</description>
                        <bitOffset>14</bitOffset>
                        <bitWidth>1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>HYST</name>
                        <description>Hysteresis level selection</description>
                        <bitOffset>12</bitOffset>
                        <bitWidth>2</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>POL</name>
                        <description>Comparator output polarity inversion</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>INMSEL</name>
                        <description>Comparator inverting input selection</description>
                        <bitOffset>5</bitOffset>
                        <bitWidth>3</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>INPSEL</name>
                        <description>Comparator non-inverting input selection</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>4</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>EN</name>
                        <description>Comparator enable</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>COMP1_FILC</name>
                <displayName>COMP1_FILC</displayName>
                <description>COMP1 Filter Control Register</description>
                <addressOffset>0x14</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>SAMPW</name>
                        <description>Low-pass filter sampling window size</description>
                        <bitOffset>6</bitOffset>
                        <bitWidth>5</bitWidth>
                    </field>
                    <field>
                        <name>THRESH</name>
                        <description>Low-pass filter threshold</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>5</bitWidth>
                    </field>
                    <field>
                        <name>FILEN</name>
                        <description>Filter enable</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>COMP1_FILP</name>
                <displayName>COMP1_FILP</displayName>
                <description>COMP1 Filter Clock Prescaler Register</description>
                <addressOffset>0x18</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>CLKPSC</name>
                        <description>Low-pass filter sampling clock prescaler</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>16</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>COMP2_CTRL</name>
                <displayName>COMP2_CTRL</displayName>
                <description>COMP2 Control Register</description>
                <addressOffset>0x1C</addressOffset>
                <size>0x20</size>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>OUT</name>
                        <description>Analog comparator output status</description>
                        <bitOffset>24</bitOffset>
                        <bitWidth>1</bitWidth>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>CLKSEL</name>
                        <description>Clock selection</description>
                        <bitOffset>21</bitOffset>
                        <bitWidth>1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>PWRMD</name>
                        <description>Comparator control mode selection</description>
                        <bitOffset>20</bitOffset>
                        <bitWidth>1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>BLKING</name>
                        <description>Blanking source selection</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>3</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>DOUHYSTEN</name>
                        <description>Comparator dual hysteresis selection</description>
                        <bitOffset>14</bitOffset>
                        <bitWidth>1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>HYST</name>
                        <description>Hysteresis level selection</description>
                        <bitOffset>12</bitOffset>
                        <bitWidth>2</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>POL</name>
                        <description>Comparator output polarity inversion</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>INMSEL</name>
                        <description>Comparator inverting input selection</description>
                        <bitOffset>5</bitOffset>
                        <bitWidth>3</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>INPSEL</name>
                        <description>Comparator non-inverting input selection</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>4</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>EN</name>
                        <description>Comparator enable</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>COMP2_FILC</name>
                <displayName>COMP2_FILC</displayName>
                <description>COMP2 Filter Control Register</description>
                <addressOffset>0x20</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>SAMPW</name>
                        <description>Low-pass filter sampling window size</description>
                        <bitOffset>6</bitOffset>
                        <bitWidth>5</bitWidth>
                    </field>
                    <field>
                        <name>THRESH</name>
                        <description>Low-pass filter threshold</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>5</bitWidth>
                    </field>
                    <field>
                        <name>FILEN</name>
                        <description>Filter enable</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>COMP2_FILP</name>
                <displayName>COMP2_FILP</displayName>
                <description>COMP2 Filter Clock Prescaler Register</description>
                <addressOffset>0x24</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>CLKPSC</name>
                        <description>Low-pass filter sampling clock prescaler</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>16</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>COMP3_CTRL</name>
                <displayName>COMP3_CTRL</displayName>
                <description>COMP3 Control Register</description>
                <addressOffset>0x28</addressOffset>
                <size>0x20</size>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>OUT</name>
                        <description>Analog comparator output status</description>
                        <bitOffset>24</bitOffset>
                        <bitWidth>1</bitWidth>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>CLKSEL</name>
                        <description>Clock selection</description>
                        <bitOffset>21</bitOffset>
                        <bitWidth>1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>PWRMD</name>
                        <description>Comparator control mode selection</description>
                        <bitOffset>20</bitOffset>
                        <bitWidth>1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>BLKING</name>
                        <description>Blanking source selection</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>3</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>DOUHYSIEN</name>
                        <description>Comparator dual hysteresis selection</description>
                        <bitOffset>14</bitOffset>
                        <bitWidth>1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>HYST</name>
                        <description>Hysteresis level selection</description>
                        <bitOffset>12</bitOffset>
                        <bitWidth>2</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>POL</name>
                        <description>Comparator output polarity inversion</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>INMSEL</name>
                        <description>Comparator inverting input selection</description>
                        <bitOffset>5</bitOffset>
                        <bitWidth>3</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>INPSEL</name>
                        <description>Comparator non-inverting input selection</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>4</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>EN</name>
                        <description>Comparator enable</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>COMP3_FILC</name>
                <displayName>COMP3_FILC</displayName>
                <description>COMP3 Filter Control Register</description>
                <addressOffset>0x2C</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>SAMPW</name>
                        <description>Low-pass filter sampling window size</description>
                        <bitOffset>6</bitOffset>
                        <bitWidth>5</bitWidth>
                    </field>
                    <field>
                        <name>THRESH</name>
                        <description>Low-pass filter threshold</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>5</bitWidth>
                    </field>
                    <field>
                        <name>FILEN</name>
                        <description>Filter enable</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>COMP3_FILP</name>
                <displayName>COMP3_FILP</displayName>
                <description>COMP3 Filter Clock Prescaler Register</description>
                <addressOffset>0x30</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>CLKPSC</name>
                        <description>Low-pass filter sampling clock prescaler</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>16</bitWidth>
                    </field>
                </fields>
            </register>
