Nsing-Community/Nsing-Pack/Nations_Device_PACK_Add_To_IAR_Tool/Nations Device PACK/debugger/Nsing/N32G41x/N32G41x.svd
            <register>
                <name>COMP1_INVREF</name>
                <displayName>COMP1_INVREF</displayName>
                <description>COMP1 Reference Input Comparison Voltage Register</description>
                <addressOffset>0x34</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>VREF1SEL</name>
                        <description>Internal comparator 1 reference voltage selection</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>8</bitWidth>
                    </field>
                    <field>
                        <name>VREF1EN</name>
                        <description>Internal comparator 1 reference voltage enable</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>COMP2_INVREF</name>
                <displayName>COMP2_INVREF</displayName>
                <description>COMP2 Reference Input Comparison Voltage Register</description>
                <addressOffset>0x38</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>VREF2SEL</name>
                        <description>Internal comparator 2 reference voltage selection</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>8</bitWidth>
                    </field>
                    <field>
                        <name>VREF2EN</name>
                        <description>Internal comparator 2 reference voltage enable</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>COMP3_INVREF</name>
                <displayName>COMP3_INVREF</displayName>
                <description>COMP3 Reference Input Comparison Voltage Register</description>
                <addressOffset>0x3C</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>VREF3SEL</name>
                        <description>Internal comparator 3 reference voltage selection</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>8</bitWidth>
                    </field>
                    <field>
                        <name>VREF3EN</name>
                        <description>Internal comparator 3 reference voltage enable</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                </fields>
            </register>
        </registers>
    </peripheral>
    <peripheral>
        <name>OPAMP</name>
        <description>Operational Amplifier</description>
        <groupName>OPAMP</groupName>
        <baseAddress>0x40002000</baseAddress>
        <addressBlock>
            <offset>0x0</offset>
            <size>0x400</size>
            <usage>registers</usage>
        </addressBlock>
        <registers>
            <register>
                <name>OPAMP1_CS</name>
                <displayName>OPAMP1_CS</displayName>
                <description>OPAMP1 Control Register</description>
                <addressOffset>0x00</addressOffset>
                <size>0x20</size>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>VREFSEL</name>
                        <description>OPAMP offset reference voltage selection</description>
                        <bitOffset>18</bitOffset>
                        <bitWidth>1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>CALOUT</name>
                        <description>OPAMP offset calibration output</description>
                        <bitOffset>17</bitOffset>
                        <bitWidth>1</bitWidth>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>CALEN</name>
                        <description>OPAMP offset calibration enable</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>VMSSEL</name>
                        <description>Inverted input secondary selection</description>
                        <bitOffset>14</bitOffset>
                        <bitWidth>2</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>VPSSEL</name>
                        <description>Non-inverted input secondary selection</description>
                        <bitOffset>12</bitOffset>
                        <bitWidth>2</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>VMSEL</name>
                        <description>Inverted input selection</description>
                        <bitOffset>10</bitOffset>
                        <bitWidth>2</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>VPSEL</name>
                        <description>Non-inverted input selection</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>2</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>PGAGAN</name>
                        <description>PGA gain configuration</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>3</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>MOD</name>
                        <description>Work mode selection</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>2</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>EN</name>
                        <description>OPAMP enable</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>OPAMP2_CS</name>
                <displayName>OPAMP2_CS</displayName>
                <description>OPAMP2 Control Register</description>
                <addressOffset>0x04</addressOffset>
                <size>0x20</size>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>VREFSEL</name>
                        <description>OPAMP offset reference voltage selection</description>
                        <bitOffset>18</bitOffset>
                        <bitWidth>1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>CALOUT</name>
                        <description>OPAMP offset calibration output</description>
                        <bitOffset>17</bitOffset>
                        <bitWidth>1</bitWidth>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>CALEN</name>
                        <description>OPAMP offset calibration enable</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>VMSSEL</name>
                        <description>Inverted input secondary selection</description>
                        <bitOffset>14</bitOffset>
                        <bitWidth>2</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>VPSSEL</name>
                        <description>Non-inverted input secondary selection</description>
                        <bitOffset>12</bitOffset>
                        <bitWidth>2</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>VMSEL</name>
                        <description>Inverted input selection</description>
                        <bitOffset>10</bitOffset>
                        <bitWidth>2</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>VPSEL</name>
                        <description>Non-inverted input selection</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>2</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>PGAGAN</name>
                        <description>PGA gain configuration</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>3</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>MOD</name>
                        <description>Work mode selection</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>2</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>EN</name>
                        <description>OPAMP enable</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>OPAMP3_CS</name>
                <displayName>OPAMP3_CS</displayName>
                <description>OPAMP3 Control Register</description>
                <addressOffset>0x08</addressOffset>
                <size>0x20</size>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>VREFSEL</name>
                        <description>OPAMP offset reference voltage selection</description>
                        <bitOffset>18</bitOffset>
                        <bitWidth>1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>CALOUT</name>
                        <description>OPAMP offset calibration output</description>
                        <bitOffset>17</bitOffset>
                        <bitWidth>1</bitWidth>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>CALEN</name>
                        <description>OPAMP offset calibration enable</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>VMSSEL</name>
                        <description>Inverted input secondary selection</description>
                        <bitOffset>14</bitOffset>
                        <bitWidth>2</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>VPSSEL</name>
                        <description>Non-inverted input secondary selection</description>
                        <bitOffset>12</bitOffset>
                        <bitWidth>2</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>VMSEL</name>
                        <description>Inverted input selection</description>
                        <bitOffset>10</bitOffset>
                        <bitWidth>2</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>VPSEL</name>
                        <description>Non-inverted input selection</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>2</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>PGAGAN</name>
                        <description>PGA gain configuration</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>3</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>MOD</name>
                        <description>Work mode selection</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>2</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>EN</name>
                        <description>OPAMP enable</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>OPAMP4_CS</name>
                <displayName>OPAMP4_CS</displayName>
                <description>OPAMP4 Control Register</description>
                <addressOffset>0x0C</addressOffset>
                <size>0x20</size>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>VREFSEL</name>
                        <description>OPAMP offset reference voltage selection</description>
                        <bitOffset>18</bitOffset>
                        <bitWidth>1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>CALOUT</name>
                        <description>OPAMP offset calibration output</description>
                        <bitOffset>17</bitOffset>
                        <bitWidth>1</bitWidth>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>CALEN</name>
                        <description>OPAMP offset calibration enable</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>VMSSEL</name>
                        <description>Inverted input secondary selection</description>
                        <bitOffset>14</bitOffset>
                        <bitWidth>2</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>VPSSEL</name>
                        <description>Non-inverted input secondary selection</description>
                        <bitOffset>12</bitOffset>
                        <bitWidth>2</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>VMSEL</name>
                        <description>Inverted input selection</description>
                        <bitOffset>10</bitOffset>
                        <bitWidth>2</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>VPSEL</name>
                        <description>Non-inverted input selection</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>2</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>PGAGAN</name>
                        <description>PGA gain configuration</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>3</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>MOD</name>
                        <description>Work mode selection</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>2</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>EN</name>
                        <description>OPAMP enable</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>OPAMP_LOCK</name>
                <displayName>OPAMP_LOCK</displayName>
                <description>OPAMP Lock Register</description>
                <addressOffset>0x10</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>OPAMP4LK</name>
                        <description>OPAMP4 register lock bit</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>OPAMP3LK</name>
                        <description>OPAMP3 register lock bit</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>OPAMP2LK</name>
                        <description>OPAMP2 register lock bit</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>OPAMP1LK</name>
                        <description>OPAMP1 register lock bit</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                </fields>
            </register>
