Nsing-Community/Nsing-Pack/Nations_Device_PACK_Add_To_IAR_Tool/Nations Device PACK/debugger/Nsing/N32G41x/N32G41x.svd
        </registers>
    </peripheral>
    <peripheral>
        <name>WWDG</name>
        <description>Window Watchdog</description>
        <groupName>WWDG</groupName>
        <baseAddress>0x40002C00</baseAddress>
        <addressBlock>
            <offset>0x0</offset>
            <size>0x400</size>
            <usage>registers</usage>
        </addressBlock>
        <interrupt>
            <name>WWDG</name>
            <description>WWDG global interrupt</description>
            <value>0</value>
        </interrupt>
        <registers>
            <register>
                <name>WWDG_CFG</name>
                <displayName>WWDG_CFG</displayName>
                <description>WWDG Configuration Register</description>
                <addressOffset>0x00</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00003FFF</resetValue>
                <fields>
                    <field>
                        <name>EWINT</name>
                        <description>Early wakeup interrupt enable</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>TIMERB</name>
                        <description>Timer base prescaler</description>
                        <bitOffset>14</bitOffset>
                        <bitWidth>2</bitWidth>
                    </field>
                    <field>
                        <name>W</name>
                        <description>Window value</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>14</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>WWDG_CTRL</name>
                <displayName>WWDG_CTRL</displayName>
                <description>WWDG Control Register</description>
                <addressOffset>0x04</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00003FFF</resetValue>
                <fields>
                    <field>
                        <name>ACTB</name>
                        <description>Activation bit</description>
                        <bitOffset>14</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>T</name>
                        <description>Counter value</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>14</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>WWDG_STS</name>
                <displayName>WWDG_STS</displayName>
                <description>WWDG Status Register</description>
                <addressOffset>0x08</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>EWINTF</name>
                        <description>Early wakeup interrupt flag</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                </fields>
            </register>
        </registers>
    </peripheral>
    <peripheral>
        <name>IWDG</name>
        <description>Independent Watchdog</description>
        <groupName>IWDG</groupName>
        <baseAddress>0x40003000</baseAddress>
        <addressBlock>
            <offset>0x0</offset>
            <size>0x400</size>
            <usage>registers</usage>
        </addressBlock>
        <registers>
            <register>
                <name>IWDG_KEY</name>
                <displayName>IWDG_KEY</displayName>
                <description>IWDG Key Register</description>
                <addressOffset>0x00</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>KEYV</name>
                        <description>Key value</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>16</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>IWDG_STS</name>
                <displayName>IWDG_STS</displayName>
                <description>IWDG Status Register</description>
                <addressOffset>0x04</addressOffset>
                <size>0x20</size>
                <access>read-only</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>FRZF</name>
                        <description>IWDG freeze flag</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>CRVU</name>
                        <description>Watchdog reload value update</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>PVU</name>
                        <description>Watchdog prescaler value update</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>IWDG_PREDIV</name>
                <displayName>IWDG_PREDIV</displayName>
                <description>IWDG Prescaler Register</description>
                <addressOffset>0x08</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>PD</name>
                        <description>Prescaler divider</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>3</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>IWDG_RELV</name>
                <displayName>IWDG_RELV</displayName>
                <description>IWDG Reload Register</description>
                <addressOffset>0x0C</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00000FFF</resetValue>
                <fields>
                    <field>
                        <name>REL</name>
                        <description>Watchdog counter reload value</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>12</bitWidth>
                    </field>
                </fields>
            </register>
