Nsing-Community/Nsing-Pack/Nations_Device_PACK_Add_To_IAR_Tool/Nations Device PACK/debugger/Nsing/N32G41x/N32G41x.svd
        </registers>
    </peripheral>
    <peripheral>
        <name>SPI2</name>
        <description>Serial Peripheral Interface 2</description>
        <groupName>SPI</groupName>
        <baseAddress>0x40013C00</baseAddress>
        <addressBlock>
            <offset>0x0</offset>
            <size>0x400</size>
            <usage>registers</usage>
        </addressBlock>
        <interrupt>
            <name>SPI2</name>
            <description>SPI2 global interrupt</description>
            <value>36</value>
        </interrupt>
        <registers>
            <register>
                <name>SPI_CTRL1</name>
                <displayName>SPI_CTRL1</displayName>
                <description>SPI Control Register 1</description>
                <addressOffset>0x00</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x0000</resetValue>
                <fields>
                    <field>
                        <name>BIDIRMODE</name>
                        <description>Bidirectional data mode enable</description>
                        <bitOffset>15</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>BIDIROEN</name>
                        <description>Output enable in bidirectional mode</description>
                        <bitOffset>14</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>RONLY</name>
                        <description>Receive only</description>
                        <bitOffset>13</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>SSMEN</name>
                        <description>Software slave management</description>
                        <bitOffset>12</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>SSEL</name>
                        <description>Internal slave select</description>
                        <bitOffset>11</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>SSOEN</name>
                        <description>SS output enable</description>
                        <bitOffset>10</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>CRCNEXT</name>
                        <description>Next CRC transmit</description>
                        <bitOffset>9</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>DATFF</name>
                        <description>Data frame format</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>LSBFF</name>
                        <description>Frame format</description>
                        <bitOffset>7</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>MSEL</name>
                        <description>Master selection</description>
                        <bitOffset>6</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>CLKPHA</name>
                        <description>Clock phase</description>
                        <bitOffset>5</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>CLKPOL</name>
                        <description>Clock polarity</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>BR</name>
                        <description>Baud rate control</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>3</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>SPI_CTRL2</name>
                <displayName>SPI_CTRL2</displayName>
                <description>SPI Control Register 2</description>
                <addressOffset>0x04</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x0000</resetValue>
                <fields>
                    <field>
                        <name>DATFF9</name>
                        <description>9-bit data frame format enable</description>
                        <bitOffset>15</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>CRCSTP</name>
                        <description>CRC stop after NSS inactive</description>
                        <bitOffset>13</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>NSSPOL</name>
                        <description>NSS polarity control</description>
                        <bitOffset>7</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>ERRINTEN</name>
                        <description>Error interrupt enable</description>
                        <bitOffset>6</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>RNEINTEN</name>
                        <description>RX buffer not empty interrupt enable</description>
                        <bitOffset>5</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>TEINTEN</name>
                        <description>TX buffer empty interrupt enable</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>CRCEN</name>
                        <description>Hardware CRC calculation enable</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>TDMAEN</name>
                        <description>TX buffer DMA enable</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>RDMAEN</name>
                        <description>RX buffer DMA enable</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>SPIEN</name>
                        <description>SPI enable</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>SPI_STS</name>
                <displayName>SPI_STS</displayName>
                <description>SPI Status Register</description>
                <addressOffset>0x08</addressOffset>
                <size>0x20</size>
                <access>read-only</access>
                <resetValue>0x0101</resetValue>
                <fields>
                    <field>
                        <name>CHSIDE</name>
                        <description>Channel side</description>
                        <bitOffset>7</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>UNDER</name>
                        <description>Underrun flag</description>
                        <bitOffset>6</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>OVER</name>
                        <description>Overrun flag</description>
                        <bitOffset>5</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>MODERR</name>
                        <description>Mode error</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>CRCERR</name>
                        <description>CRC error flag</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>BUSY</name>
                        <description>Busy flag</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>RNE</name>
                        <description>Receive buffer not empty</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>TE</name>
                        <description>Transmit buffer empty</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>SPI_DAT</name>
                <displayName>SPI_DAT</displayName>
                <description>SPI Data Register</description>
                <addressOffset>0x0C</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x0000</resetValue>
                <fields>
                    <field>
                        <name>DAT</name>
                        <description>Data register</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>16</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>SPI_CRCTDAT</name>
                <displayName>SPI_CRCTDAT</displayName>
                <description>SPI TX CRC Register</description>
                <addressOffset>0x10</addressOffset>
                <size>0x20</size>
                <access>read-only</access>
                <resetValue>0x0000</resetValue>
                <fields>
                    <field>
                        <name>CRCTDAT</name>
                        <description>TX CRC value</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>16</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>SPI_CRCRDAT</name>
                <displayName>SPI_CRCRDAT</displayName>
                <description>SPI RX CRC Register</description>
                <addressOffset>0x14</addressOffset>
                <size>0x20</size>
                <access>read-only</access>
                <resetValue>0x0000</resetValue>
                <fields>
                    <field>
                        <name>CRCRDAT</name>
                        <description>RX CRC value</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>16</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>SPI_CRCPOLY</name>
                <displayName>SPI_CRCPOLY</displayName>
                <description>SPI CRC Polynomial Register</description>
                <addressOffset>0x18</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x0007</resetValue>
                <fields>
                    <field>
                        <name>CRCPOLY</name>
                        <description>CRC polynomial</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>16</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>SPI_CTRL3</name>
                <displayName>SPI_CTRL3</displayName>
                <description>SPI Sampling Delay Register</description>
                <addressOffset>0x38</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x0000</resetValue>
                <fields>
                    <field>
                        <name>DELAYTIME</name>
                        <description>SPI master sampling delay time configuration</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>4</bitWidth>
                    </field>
                </fields>
            </register>
