Nsing-Community/Nsing-Pack/Nations_Device_PACK_Add_To_IAR_Tool/Nations Device PACK/debugger/Nsing/N32G41x/N32G41x.svd
        </registers>
    </peripheral>
    <peripheral>
        <name>CAN</name>
        <description>Controller Area Network</description>
        <groupName>CAN</groupName>
        <baseAddress>0x40006400</baseAddress>
        <addressBlock>
            <offset>0x0</offset>
            <size>0x400</size>
            <usage>registers</usage>
        </addressBlock>
        <interrupt>
            <name>CAN</name>
            <description>CAN global interrupt</description>
            <value>34</value>
        </interrupt>
        <registers>
            <register>
                <name>CAN_MCTRL</name>
                <displayName>CAN_MCTRL</displayName>
                <description>CAN Master Control Register</description>
                <addressOffset>0x00</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00010002</resetValue>
                <fields>
                    <field>
                        <name>DBGF</name>
                        <description>Debug freeze</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>MRST</name>
                        <description>CAN software master reset</description>
                        <bitOffset>15</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>TTCM</name>
                        <description>Time triggered communication mode</description>
                        <bitOffset>7</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>ABOM</name>
                        <description>Automatic bus-off management</description>
                        <bitOffset>6</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>AWKUM</name>
                        <description>Automatic wakeup mode</description>
                        <bitOffset>5</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>NART</name>
                        <description>No automatic retransmission</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>RFLM</name>
                        <description>Receive FIFO locked mode</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>TXFP</name>
                        <description>Transmit FIFO priority</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>SLPRQ</name>
                        <description>Sleep mode request</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>INIRQ</name>
                        <description>Initialization request</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>CAN_MSTS</name>
                <displayName>CAN_MSTS</displayName>
                <description>CAN Master Status Register</description>
                <addressOffset>0x04</addressOffset>
                <size>0x20</size>
                <resetValue>0x00000C02</resetValue>
                <fields>
                    <field>
                        <name>RXS</name>
                        <description>CAN Rx signal</description>
                        <bitOffset>11</bitOffset>
                        <bitWidth>1</bitWidth>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>LSMP</name>
                        <description>Last sample point</description>
                        <bitOffset>10</bitOffset>
                        <bitWidth>1</bitWidth>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>RXMD</name>
                        <description>Receive mode</description>
                        <bitOffset>9</bitOffset>
                        <bitWidth>1</bitWidth>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>TXMD</name>
                        <description>Transmit mode</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>1</bitWidth>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>SLAKINT</name>
                        <description>Sleep acknowledge interrupt</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>WKUINT</name>
                        <description>Wakeup interrupt</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>ERRINT</name>
                        <description>Error interrupt</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>SLPAK</name>
                        <description>Sleep mode acknowledge</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>INIAK</name>
                        <description>Initialization acknowledge</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>CAN_TSTS</name>
                <displayName>CAN_TSTS</displayName>
                <description>CAN Transmit Status Register</description>
                <addressOffset>0x08</addressOffset>
                <size>0x20</size>
                <resetValue>0x1C000000</resetValue>
                <fields>
                    <field>
                        <name>LOWM2</name>
                        <description>Lowest priority flag mailbox2</description>
                        <bitOffset>31</bitOffset>
                        <bitWidth>1</bitWidth>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>LOWM1</name>
                        <description>Lowest priority flag mailbox1</description>
                        <bitOffset>30</bitOffset>
                        <bitWidth>1</bitWidth>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>LOWM0</name>
                        <description>Lowest priority flag mailbox0</description>
                        <bitOffset>29</bitOffset>
                        <bitWidth>1</bitWidth>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>TMEM2</name>
                        <description>Transmit mailbox2 empty</description>
                        <bitOffset>28</bitOffset>
                        <bitWidth>1</bitWidth>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>TMEM1</name>
                        <description>Transmit mailbox1 empty</description>
                        <bitOffset>27</bitOffset>
                        <bitWidth>1</bitWidth>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>TMEM0</name>
                        <description>Transmit mailbox0 empty</description>
                        <bitOffset>26</bitOffset>
                        <bitWidth>1</bitWidth>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>CODE</name>
                        <description>Mailbox code</description>
                        <bitOffset>24</bitOffset>
                        <bitWidth>2</bitWidth>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>ABRQM2</name>
                        <description>Abort request mailbox2</description>
                        <bitOffset>23</bitOffset>
                        <bitWidth>1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>TERRM2</name>
                        <description>Transmission error mailbox2</description>
                        <bitOffset>19</bitOffset>
                        <bitWidth>1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>ALSTM2</name>
                        <description>Arbitration lost mailbox2</description>
                        <bitOffset>18</bitOffset>
                        <bitWidth>1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>TXOKM2</name>
                        <description>Transmission OK mailbox2</description>
                        <bitOffset>17</bitOffset>
                        <bitWidth>1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>RQCPM2</name>
                        <description>Request completed mailbox2</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>ABRQM1</name>
                        <description>Abort request mailbox1</description>
                        <bitOffset>15</bitOffset>
                        <bitWidth>1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>TERRM1</name>
                        <description>Transmission error mailbox1</description>
                        <bitOffset>11</bitOffset>
                        <bitWidth>1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>ALSTM1</name>
                        <description>Arbitration lost mailbox1</description>
                        <bitOffset>10</bitOffset>
                        <bitWidth>1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>TXOKM1</name>
                        <description>Transmission OK mailbox1</description>
                        <bitOffset>9</bitOffset>
                        <bitWidth>1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>RQCPM1</name>
                        <description>Request completed mailbox1</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>ABRQM0</name>
                        <description>Abort request mailbox0</description>
                        <bitOffset>7</bitOffset>
                        <bitWidth>1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>TERRM0</name>
                        <description>Transmission error mailbox0</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>ALSTM0</name>
                        <description>Arbitration lost mailbox0</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>TXOKM0</name>
                        <description>Transmission OK mailbox0</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>RQCPM0</name>
                        <description>Request completed mailbox0</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>CAN_RFF0</name>
                <displayName>CAN_RFF0</displayName>
                <description>CAN Receive FIFO0 Register</description>
                <addressOffset>0x0C</addressOffset>
                <size>0x20</size>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>RFFOM0</name>
                        <description>Release FIFO0 output mailbox</description>
                        <bitOffset>5</bitOffset>
                        <bitWidth>1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>FFOVR0</name>
                        <description>FIFO0 overrun</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>FFULL0</name>
                        <description>FIFO0 full</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>FFMP0</name>
                        <description>FIFO0 message pending</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>2</bitWidth>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>CAN_RFF1</name>
                <displayName>CAN_RFF1</displayName>
                <description>CAN Receive FIFO1 Register</description>
                <addressOffset>0x10</addressOffset>
                <size>0x20</size>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>RFFOM1</name>
                        <description>Release FIFO1 output mailbox</description>
                        <bitOffset>5</bitOffset>
                        <bitWidth>1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>FFOVR1</name>
                        <description>FIFO1 overrun</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>FFULL1</name>
                        <description>FIFO1 full</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>FFMP1</name>
                        <description>FIFO1 message pending</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>2</bitWidth>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>CAN_INTE</name>
                <displayName>CAN_INTE</displayName>
                <description>CAN Interrupt Enable Register</description>
                <addressOffset>0x14</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>SLKITE</name>
                        <description>Sleep interrupt enable</description>
                        <bitOffset>17</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>WKUITE</name>
                        <description>Wakeup interrupt enable</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>ERRITE</name>
                        <description>Error interrupt enable</description>
                        <bitOffset>15</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>LECITE</name>
                        <description>Last error code interrupt enable</description>
                        <bitOffset>11</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>BOFITE</name>
                        <description>Bus-off interrupt enable</description>
                        <bitOffset>10</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>EPVITE</name>
                        <description>Error passive interrupt enable</description>
                        <bitOffset>9</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>EWGITE</name>
                        <description>Error warning interrupt enable</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>FOVITE1</name>
                        <description>FIFO1 overrun interrupt enable</description>
                        <bitOffset>6</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>FFITE1</name>
                        <description>FIFO1 full interrupt enable</description>
                        <bitOffset>5</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>FMPITE1</name>
                        <description>FIFO1 message pending interrupt enable</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>FOVITE0</name>
                        <description>FIFO0 overrun interrupt enable</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>FFITE0</name>
                        <description>FIFO0 full interrupt enable</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>FMPITE0</name>
                        <description>FIFO0 message pending interrupt enable</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>TMEITE</name>
                        <description>Transmit mailbox empty interrupt enable</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                </fields>
            </register>
