Nsing-Community/Nsing-Pack/Nations_Device_PACK_Add_To_IAR_Tool/Nations Device PACK/debugger/Nsing/N32G41x/N32G41x.svd
            <register>
                <name>CAN_ESTS</name>
                <displayName>CAN_ESTS</displayName>
                <description>CAN Error Status Register</description>
                <addressOffset>0x18</addressOffset>
                <size>0x20</size>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>RXEC</name>
                        <description>Receive error counter</description>
                        <bitOffset>24</bitOffset>
                        <bitWidth>8</bitWidth>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>TXEC</name>
                        <description>Transmit error counter lower 8 bits</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>8</bitWidth>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>LEC</name>
                        <description>Last error code</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>3</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>BOFFL</name>
                        <description>Bus-off flag</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>EPVFL</name>
                        <description>Error passive flag</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>EWGFL</name>
                        <description>Error warning flag</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>CAN_BTIM</name>
                <displayName>CAN_BTIM</displayName>
                <description>CAN Bit Timing Register</description>
                <addressOffset>0x1C</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x01230000</resetValue>
                <fields>
                    <field>
                        <name>SLM</name>
                        <description>Silent mode debug</description>
                        <bitOffset>31</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>LBM</name>
                        <description>Loop back mode debug</description>
                        <bitOffset>30</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>RSJW</name>
                        <description>Resynchronization jump width</description>
                        <bitOffset>24</bitOffset>
                        <bitWidth>2</bitWidth>
                    </field>
                    <field>
                        <name>TBS2</name>
                        <description>Time segment 2</description>
                        <bitOffset>20</bitOffset>
                        <bitWidth>3</bitWidth>
                    </field>
                    <field>
                        <name>TBS1</name>
                        <description>Time segment 1</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>4</bitWidth>
                    </field>
                    <field>
                        <name>BRTP</name>
                        <description>Baud rate prescaler</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>10</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>CAN_TMI0</name>
                <displayName>CAN_TMI0</displayName>
                <description>CAN Transmit Mailbox0 Identifier Register</description>
                <addressOffset>0x180</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>STDID_EXTID</name>
                        <description>Standard or extended identifier high part</description>
                        <bitOffset>21</bitOffset>
                        <bitWidth>11</bitWidth>
                    </field>
                    <field>
                        <name>EXTID</name>
                        <description>Extended identifier low part</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>18</bitWidth>
                    </field>
                    <field>
                        <name>IDE</name>
                        <description>Identifier extension</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>RTRQ</name>
                        <description>Remote transmission request</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>TXRQ</name>
                        <description>Transmit mailbox request</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>CAN_TMDT0</name>
                <displayName>CAN_TMDT0</displayName>
                <description>CAN Transmit Mailbox0 Data Length Timestamp Register</description>
                <addressOffset>0x184</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>MTIM</name>
                        <description>Message time stamp</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>16</bitWidth>
                    </field>
                    <field>
                        <name>TGT</name>
                        <description>Transmit global time</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>DLC</name>
                        <description>Data length code</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>4</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>CAN_TMDL0</name>
                <displayName>CAN_TMDL0</displayName>
                <description>CAN Transmit Mailbox0 Low Data Register</description>
                <addressOffset>0x188</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>DATA3</name>
                        <description>Data byte3</description>
                        <bitOffset>24</bitOffset>
                        <bitWidth>8</bitWidth>
                    </field>
                    <field>
                        <name>DATA2</name>
                        <description>Data byte2</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>8</bitWidth>
                    </field>
                    <field>
                        <name>DATA1</name>
                        <description>Data byte1</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>8</bitWidth>
                    </field>
                    <field>
                        <name>DATA0</name>
                        <description>Data byte0</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>8</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>CAN_TMDH0</name>
                <displayName>CAN_TMDH0</displayName>
                <description>CAN Transmit Mailbox0 High Data Register</description>
                <addressOffset>0x18C</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>DATA7</name>
                        <description>Data byte7</description>
                        <bitOffset>24</bitOffset>
                        <bitWidth>8</bitWidth>
                    </field>
                    <field>
                        <name>DATA6</name>
                        <description>Data byte6</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>8</bitWidth>
                    </field>
                    <field>
                        <name>DATA5</name>
                        <description>Data byte5</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>8</bitWidth>
                    </field>
                    <field>
                        <name>DATA4</name>
                        <description>Data byte4</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>8</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>CAN_TMI1</name>
                <displayName>CAN_TMI1</displayName>
                <description>CAN Transmit Mailbox1 Identifier Register</description>
                <addressOffset>0x190</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>STDID_EXTID</name>
                        <description>Standard or extended identifier high part</description>
                        <bitOffset>21</bitOffset>
                        <bitWidth>11</bitWidth>
                    </field>
                    <field>
                        <name>EXTID</name>
                        <description>Extended identifier low part</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>18</bitWidth>
                    </field>
                    <field>
                        <name>IDE</name>
                        <description>Identifier extension</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>RTRQ</name>
                        <description>Remote transmission request</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>TXRQ</name>
                        <description>Transmit mailbox request</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>CAN_TMDT1</name>
                <displayName>CAN_TMDT1</displayName>
                <description>CAN Transmit Mailbox1 Data Length Timestamp Register</description>
                <addressOffset>0x194</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>MTIM</name>
                        <description>Message time stamp</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>16</bitWidth>
                    </field>
                    <field>
                        <name>TGT</name>
                        <description>Transmit global time</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>DLC</name>
                        <description>Data length code</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>4</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>CAN_TMDL1</name>
                <displayName>CAN_TMDL1</displayName>
                <description>CAN Transmit Mailbox1 Low Data Register</description>
                <addressOffset>0x198</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>DATA3</name>
                        <description>Data byte3</description>
                        <bitOffset>24</bitOffset>
                        <bitWidth>8</bitWidth>
                    </field>
                    <field>
                        <name>DATA2</name>
                        <description>Data byte2</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>8</bitWidth>
                    </field>
                    <field>
                        <name>DATA1</name>
                        <description>Data byte1</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>8</bitWidth>
                    </field>
                    <field>
                        <name>DATA0</name>
                        <description>Data byte0</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>8</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>CAN_TMDH1</name>
                <displayName>CAN_TMDH1</displayName>
                <description>CAN Transmit Mailbox1 High Data Register</description>
                <addressOffset>0x19C</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>DATA7</name>
                        <description>Data byte7</description>
                        <bitOffset>24</bitOffset>
                        <bitWidth>8</bitWidth>
                    </field>
                    <field>
                        <name>DATA6</name>
                        <description>Data byte6</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>8</bitWidth>
                    </field>
                    <field>
                        <name>DATA5</name>
                        <description>Data byte5</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>8</bitWidth>
                    </field>
                    <field>
                        <name>DATA4</name>
                        <description>Data byte4</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>8</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>CAN_TMI2</name>
                <displayName>CAN_TMI2</displayName>
                <description>CAN Transmit Mailbox2 Identifier Register</description>
                <addressOffset>0x1A0</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>STDID_EXTID</name>
                        <description>Standard or extended identifier high part</description>
                        <bitOffset>21</bitOffset>
                        <bitWidth>11</bitWidth>
                    </field>
                    <field>
                        <name>EXTID</name>
                        <description>Extended identifier low part</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>18</bitWidth>
                    </field>
                    <field>
                        <name>IDE</name>
                        <description>Identifier extension</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>RTRQ</name>
                        <description>Remote transmission request</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>TXRQ</name>
                        <description>Transmit mailbox request</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>CAN_TMDT2</name>
                <displayName>CAN_TMDT2</displayName>
                <description>CAN Transmit Mailbox2 Data Length Timestamp Register</description>
                <addressOffset>0x1A4</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>MTIM</name>
                        <description>Message time stamp</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>16</bitWidth>
                    </field>
                    <field>
                        <name>TGT</name>
                        <description>Transmit global time</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>DLC</name>
                        <description>Data length code</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>4</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>CAN_TMDL2</name>
                <displayName>CAN_TMDL2</displayName>
                <description>CAN Transmit Mailbox2 Low Data Register</description>
                <addressOffset>0x1A8</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>DATA3</name>
                        <description>Data byte3</description>
                        <bitOffset>24</bitOffset>
                        <bitWidth>8</bitWidth>
                    </field>
                    <field>
                        <name>DATA2</name>
                        <description>Data byte2</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>8</bitWidth>
                    </field>
                    <field>
                        <name>DATA1</name>
                        <description>Data byte1</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>8</bitWidth>
                    </field>
                    <field>
                        <name>DATA0</name>
                        <description>Data byte0</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>8</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>CAN_TMDH2</name>
                <displayName>CAN_TMDH2</displayName>
                <description>CAN Transmit Mailbox2 High Data Register</description>
                <addressOffset>0x1AC</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>DATA7</name>
                        <description>Data byte7</description>
                        <bitOffset>24</bitOffset>
                        <bitWidth>8</bitWidth>
                    </field>
                    <field>
                        <name>DATA6</name>
                        <description>Data byte6</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>8</bitWidth>
                    </field>
                    <field>
                        <name>DATA5</name>
                        <description>Data byte5</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>8</bitWidth>
                    </field>
                    <field>
                        <name>DATA4</name>
                        <description>Data byte4</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>8</bitWidth>
                    </field>
                </fields>
            </register>
