Nsing-Community/Nsing-Pack/Nations_Device_PACK_Add_To_IAR_Tool/Nations Device PACK/debugger/Nsing/N32G41x/N32G41x.svd
            <register>
                <name>CAN_RMI0</name>
                <displayName>CAN_RMI0</displayName>
                <description>CAN Receive FIFO0 Mailbox Identifier Register</description>
                <addressOffset>0x1B0</addressOffset>
                <size>0x20</size>
                <access>read-only</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>STDID_EXTID</name>
                        <description>Standard or extended identifier high part</description>
                        <bitOffset>21</bitOffset>
                        <bitWidth>11</bitWidth>
                    </field>
                    <field>
                        <name>EXTID</name>
                        <description>Extended identifier low part</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>18</bitWidth>
                    </field>
                    <field>
                        <name>IDE</name>
                        <description>Identifier extension</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>RTRQ</name>
                        <description>Remote transmission request</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>CAN_RMDT0</name>
                <displayName>CAN_RMDT0</displayName>
                <description>CAN Receive FIFO0 Mailbox Data Length Timestamp Register</description>
                <addressOffset>0x1B4</addressOffset>
                <size>0x20</size>
                <access>read-only</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>MTIM</name>
                        <description>Message time stamp</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>16</bitWidth>
                    </field>
                    <field>
                        <name>FMI</name>
                        <description>Filter match index</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>8</bitWidth>
                    </field>
                    <field>
                        <name>DLC</name>
                        <description>Data length code</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>4</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>CAN_RMDL0</name>
                <displayName>CAN_RMDL0</displayName>
                <description>CAN Receive FIFO0 Mailbox Low Data Register</description>
                <addressOffset>0x1B8</addressOffset>
                <size>0x20</size>
                <access>read-only</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>DATA3</name>
                        <description>Data byte3</description>
                        <bitOffset>24</bitOffset>
                        <bitWidth>8</bitWidth>
                    </field>
                    <field>
                        <name>DATA2</name>
                        <description>Data byte2</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>8</bitWidth>
                    </field>
                    <field>
                        <name>DATA1</name>
                        <description>Data byte1</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>8</bitWidth>
                    </field>
                    <field>
                        <name>DATA0</name>
                        <description>Data byte0</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>8</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>CAN_RMDH0</name>
                <displayName>CAN_RMDH0</displayName>
                <description>CAN Receive FIFO0 Mailbox High Data Register</description>
                <addressOffset>0x1BC</addressOffset>
                <size>0x20</size>
                <access>read-only</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>DATA7</name>
                        <description>Data byte7</description>
                        <bitOffset>24</bitOffset>
                        <bitWidth>8</bitWidth>
                    </field>
                    <field>
                        <name>DATA6</name>
                        <description>Data byte6</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>8</bitWidth>
                    </field>
                    <field>
                        <name>DATA5</name>
                        <description>Data byte5</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>8</bitWidth>
                    </field>
                    <field>
                        <name>DATA4</name>
                        <description>Data byte4</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>8</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>CAN_RMI1</name>
                <displayName>CAN_RMI1</displayName>
                <description>CAN Receive FIFO1 Mailbox Identifier Register</description>
                <addressOffset>0x1C0</addressOffset>
                <size>0x20</size>
                <access>read-only</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>STDID_EXTID</name>
                        <description>Standard or extended identifier high part</description>
                        <bitOffset>21</bitOffset>
                        <bitWidth>11</bitWidth>
                    </field>
                    <field>
                        <name>EXTID</name>
                        <description>Extended identifier low part</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>18</bitWidth>
                    </field>
                    <field>
                        <name>IDE</name>
                        <description>Identifier extension</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>RTRQ</name>
                        <description>Remote transmission request</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>CAN_RMDT1</name>
                <displayName>CAN_RMDT1</displayName>
                <description>CAN Receive FIFO1 Mailbox Data Length Timestamp Register</description>
                <addressOffset>0x1C4</addressOffset>
                <size>0x20</size>
                <access>read-only</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>MTIM</name>
                        <description>Message time stamp</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>16</bitWidth>
                    </field>
                    <field>
                        <name>FMI</name>
                        <description>Filter match index</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>8</bitWidth>
                    </field>
                    <field>
                        <name>DLC</name>
                        <description>Data length code</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>4</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>CAN_RMDL1</name>
                <displayName>CAN_RMDL1</displayName>
                <description>CAN Receive FIFO1 Mailbox Low Data Register</description>
                <addressOffset>0x1C8</addressOffset>
                <size>0x20</size>
                <access>read-only</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>DATA3</name>
                        <description>Data byte3</description>
                        <bitOffset>24</bitOffset>
                        <bitWidth>8</bitWidth>
                    </field>
                    <field>
                        <name>DATA2</name>
                        <description>Data byte2</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>8</bitWidth>
                    </field>
                    <field>
                        <name>DATA1</name>
                        <description>Data byte1</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>8</bitWidth>
                    </field>
                    <field>
                        <name>DATA0</name>
                        <description>Data byte0</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>8</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>CAN_RMDH1</name>
                <displayName>CAN_RMDH1</displayName>
                <description>CAN Receive FIFO1 Mailbox High Data Register</description>
                <addressOffset>0x1CC</addressOffset>
                <size>0x20</size>
                <access>read-only</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>DATA7</name>
                        <description>Data byte7</description>
                        <bitOffset>24</bitOffset>
                        <bitWidth>8</bitWidth>
                    </field>
                    <field>
                        <name>DATA6</name>
                        <description>Data byte6</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>8</bitWidth>
                    </field>
                    <field>
                        <name>DATA5</name>
                        <description>Data byte5</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>8</bitWidth>
                    </field>
                    <field>
                        <name>DATA4</name>
                        <description>Data byte4</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>8</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>CAN_FMC</name>
                <displayName>CAN_FMC</displayName>
                <description>CAN Filter Master Control Register</description>
                <addressOffset>0x200</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x2A1C0E01</resetValue>
                <fields>
                    <field>
                        <name>FINITM</name>
                        <description>Filter init mode</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>CAN_FM1</name>
                <displayName>CAN_FM1</displayName>
                <description>CAN Filter Mode Register</description>
                <addressOffset>0x204</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>FB0</name>
                        <description>Filter mode for group0</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>FB1</name>
                        <description>Filter mode for group1</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>FB2</name>
                        <description>Filter mode for group2</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>FB3</name>
                        <description>Filter mode for group3</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>FB4</name>
                        <description>Filter mode for group4</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>FB5</name>
                        <description>Filter mode for group5</description>
                        <bitOffset>5</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>FB6</name>
                        <description>Filter mode for group6</description>
                        <bitOffset>6</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>FB7</name>
                        <description>Filter mode for group7</description>
                        <bitOffset>7</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>FB8</name>
                        <description>Filter mode for group8</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>FB9</name>
                        <description>Filter mode for group9</description>
                        <bitOffset>9</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>FB10</name>
                        <description>Filter mode for group10</description>
                        <bitOffset>10</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>FB11</name>
                        <description>Filter mode for group11</description>
                        <bitOffset>11</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>FB12</name>
                        <description>Filter mode for group12</description>
                        <bitOffset>12</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>FB13</name>
                        <description>Filter mode for group13</description>
                        <bitOffset>13</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>CAN_FS1</name>
                <displayName>CAN_FS1</displayName>
                <description>CAN Filter Scale Register</description>
                <addressOffset>0x20C</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>FSC0</name>
                        <description>Filter scale for group0</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>FSC1</name>
                        <description>Filter scale for group1</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>FSC2</name>
                        <description>Filter scale for group2</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>FSC3</name>
                        <description>Filter scale for group3</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>FSC4</name>
                        <description>Filter scale for group4</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>FSC5</name>
                        <description>Filter scale for group5</description>
                        <bitOffset>5</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>FSC6</name>
                        <description>Filter scale for group6</description>
                        <bitOffset>6</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>FSC7</name>
                        <description>Filter scale for group7</description>
                        <bitOffset>7</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>FSC8</name>
                        <description>Filter scale for group8</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>FSC9</name>
                        <description>Filter scale for group9</description>
                        <bitOffset>9</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>FSC10</name>
                        <description>Filter scale for group10</description>
                        <bitOffset>10</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>FSC11</name>
                        <description>Filter scale for group11</description>
                        <bitOffset>11</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>FSC12</name>
                        <description>Filter scale for group12</description>
                        <bitOffset>12</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>FSC13</name>
                        <description>Filter scale for group13</description>
                        <bitOffset>13</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                </fields>
            </register>
