Nsing-Community/Nsing-Pack/Nations_Device_PACK_Add_To_IAR_Tool/Nations Device PACK/debugger/Nsing/N32G41x/N32G41x.svd
            <register>
                <name>CAN_FFA1</name>
                <displayName>CAN_FFA1</displayName>
                <description>CAN Filter FIFO Assignment Register</description>
                <addressOffset>0x214</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>FAF0</name>
                        <description>Filter FIFO assignment for filter0</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>FAF1</name>
                        <description>Filter FIFO assignment for filter1</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>FAF2</name>
                        <description>Filter FIFO assignment for filter2</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>FAF3</name>
                        <description>Filter FIFO assignment for filter3</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>FAF4</name>
                        <description>Filter FIFO assignment for filter4</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>FAF5</name>
                        <description>Filter FIFO assignment for filter5</description>
                        <bitOffset>5</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>FAF6</name>
                        <description>Filter FIFO assignment for filter6</description>
                        <bitOffset>6</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>FAF7</name>
                        <description>Filter FIFO assignment for filter7</description>
                        <bitOffset>7</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>FAF8</name>
                        <description>Filter FIFO assignment for filter8</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>FAF9</name>
                        <description>Filter FIFO assignment for filter9</description>
                        <bitOffset>9</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>FAF10</name>
                        <description>Filter FIFO assignment for filter10</description>
                        <bitOffset>10</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>FAF11</name>
                        <description>Filter FIFO assignment for filter11</description>
                        <bitOffset>11</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>FAF12</name>
                        <description>Filter FIFO assignment for filter12</description>
                        <bitOffset>12</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>FAF13</name>
                        <description>Filter FIFO assignment for filter13</description>
                        <bitOffset>13</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>CAN_FA1</name>
                <displayName>CAN_FA1</displayName>
                <description>CAN Filter Activation Register</description>
                <addressOffset>0x21C</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>FAC0</name>
                        <description>Filter active for filter0</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>FAC1</name>
                        <description>Filter active for filter1</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>FAC2</name>
                        <description>Filter active for filter2</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>FAC3</name>
                        <description>Filter active for filter3</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>FAC4</name>
                        <description>Filter active for filter4</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>FAC5</name>
                        <description>Filter active for filter5</description>
                        <bitOffset>5</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>FAC6</name>
                        <description>Filter active for filter6</description>
                        <bitOffset>6</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>FAC7</name>
                        <description>Filter active for filter7</description>
                        <bitOffset>7</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>FAC8</name>
                        <description>Filter active for filter8</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>FAC9</name>
                        <description>Filter active for filter9</description>
                        <bitOffset>9</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>FAC10</name>
                        <description>Filter active for filter10</description>
                        <bitOffset>10</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>FAC11</name>
                        <description>Filter active for filter11</description>
                        <bitOffset>11</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>FAC12</name>
                        <description>Filter active for filter12</description>
                        <bitOffset>12</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>FAC13</name>
                        <description>Filter active for filter13</description>
                        <bitOffset>13</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>CAN_F0R1</name>
                <displayName>CAN_F0R1</displayName>
                <description>CAN Filter0 Register1</description>
                <addressOffset>0x240</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>FBC</name>
                        <description>Filter bits identifier or mask</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>32</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>CAN_F0R2</name>
                <displayName>CAN_F0R2</displayName>
                <description>CAN Filter0 Register2</description>
                <addressOffset>0x244</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>FBC</name>
                        <description>Filter bits identifier or mask</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>32</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>CAN_F1R1</name>
                <displayName>CAN_F1R1</displayName>
                <description>CAN Filter1 Register1</description>
                <addressOffset>0x248</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>FBC</name>
                        <description>Filter bits identifier or mask</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>32</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>CAN_F1R2</name>
                <displayName>CAN_F1R2</displayName>
                <description>CAN Filter1 Register2</description>
                <addressOffset>0x24C</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>FBC</name>
                        <description>Filter bits identifier or mask</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>32</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>CAN_F2R1</name>
                <displayName>CAN_F2R1</displayName>
                <description>CAN Filter2 Register1</description>
                <addressOffset>0x250</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>FBC</name>
                        <description>Filter bits identifier or mask</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>32</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>CAN_F2R2</name>
                <displayName>CAN_F2R2</displayName>
                <description>CAN Filter2 Register2</description>
                <addressOffset>0x254</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>FBC</name>
                        <description>Filter bits identifier or mask</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>32</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>CAN_F3R1</name>
                <displayName>CAN_F3R1</displayName>
                <description>CAN Filter3 Register1</description>
                <addressOffset>0x258</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>FBC</name>
                        <description>Filter bits identifier or mask</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>32</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>CAN_F3R2</name>
                <displayName>CAN_F3R2</displayName>
                <description>CAN Filter3 Register2</description>
                <addressOffset>0x25C</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>FBC</name>
                        <description>Filter bits identifier or mask</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>32</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>CAN_F4R1</name>
                <displayName>CAN_F4R1</displayName>
                <description>CAN Filter4 Register1</description>
                <addressOffset>0x260</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>FBC</name>
                        <description>Filter bits identifier or mask</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>32</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>CAN_F4R2</name>
                <displayName>CAN_F4R2</displayName>
                <description>CAN Filter4 Register2</description>
                <addressOffset>0x264</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>FBC</name>
                        <description>Filter bits identifier or mask</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>32</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>CAN_F5R1</name>
                <displayName>CAN_F5R1</displayName>
                <description>CAN Filter5 Register1</description>
                <addressOffset>0x268</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>FBC</name>
                        <description>Filter bits identifier or mask</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>32</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>CAN_F5R2</name>
                <displayName>CAN_F5R2</displayName>
                <description>CAN Filter5 Register2</description>
                <addressOffset>0x26C</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>FBC</name>
                        <description>Filter bits identifier or mask</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>32</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>CAN_F6R1</name>
                <displayName>CAN_F6R1</displayName>
                <description>CAN Filter6 Register1</description>
                <addressOffset>0x270</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>FBC</name>
                        <description>Filter bits identifier or mask</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>32</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>CAN_F6R2</name>
                <displayName>CAN_F6R2</displayName>
                <description>CAN Filter6 Register2</description>
                <addressOffset>0x274</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>FBC</name>
                        <description>Filter bits identifier or mask</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>32</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>CAN_F7R1</name>
                <displayName>CAN_F7R1</displayName>
                <description>CAN Filter7 Register1</description>
                <addressOffset>0x278</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>FBC</name>
                        <description>Filter bits identifier or mask</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>32</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>CAN_F7R2</name>
                <displayName>CAN_F7R2</displayName>
                <description>CAN Filter7 Register2</description>
                <addressOffset>0x27C</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>FBC</name>
                        <description>Filter bits identifier or mask</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>32</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>CAN_F8R1</name>
                <displayName>CAN_F8R1</displayName>
                <description>CAN Filter8 Register1</description>
                <addressOffset>0x280</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>FBC</name>
                        <description>Filter bits identifier or mask</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>32</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>CAN_F8R2</name>
                <displayName>CAN_F8R2</displayName>
                <description>CAN Filter8 Register2</description>
                <addressOffset>0x284</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>FBC</name>
                        <description>Filter bits identifier or mask</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>32</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>CAN_F9R1</name>
                <displayName>CAN_F9R1</displayName>
                <description>CAN Filter9 Register1</description>
                <addressOffset>0x288</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>FBC</name>
                        <description>Filter bits identifier or mask</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>32</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>CAN_F9R2</name>
                <displayName>CAN_F9R2</displayName>
                <description>CAN Filter9 Register2</description>
                <addressOffset>0x28C</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>FBC</name>
                        <description>Filter bits identifier or mask</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>32</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>CAN_F10R1</name>
                <displayName>CAN_F10R1</displayName>
                <description>CAN Filter10 Register1</description>
                <addressOffset>0x290</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>FBC</name>
                        <description>Filter bits identifier or mask</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>32</bitWidth>
                    </field>
                </fields>
            </register>
