Nsing-Community/Nsing-Pack/Nations_Device_PACK_Add_To_IAR_Tool/Nations Device PACK/debugger/Nsing/N32G41x/N32G41x.svd
            <register>
                <name>CAN_F10R2</name>
                <displayName>CAN_F10R2</displayName>
                <description>CAN Filter10 Register2</description>
                <addressOffset>0x294</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>FBC</name>
                        <description>Filter bits identifier or mask</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>32</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>CAN_F11R1</name>
                <displayName>CAN_F11R1</displayName>
                <description>CAN Filter11 Register1</description>
                <addressOffset>0x298</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>FBC</name>
                        <description>Filter bits identifier or mask</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>32</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>CAN_F11R2</name>
                <displayName>CAN_F11R2</displayName>
                <description>CAN Filter11 Register2</description>
                <addressOffset>0x29C</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>FBC</name>
                        <description>Filter bits identifier or mask</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>32</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>CAN_F12R1</name>
                <displayName>CAN_F12R1</displayName>
                <description>CAN Filter12 Register1</description>
                <addressOffset>0x2A0</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>FBC</name>
                        <description>Filter bits identifier or mask</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>32</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>CAN_F12R2</name>
                <displayName>CAN_F12R2</displayName>
                <description>CAN Filter12 Register2</description>
                <addressOffset>0x2A4</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>FBC</name>
                        <description>Filter bits identifier or mask</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>32</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>CAN_F13R1</name>
                <displayName>CAN_F13R1</displayName>
                <description>CAN Filter13 Register1</description>
                <addressOffset>0x2A8</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>FBC</name>
                        <description>Filter bits identifier or mask</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>32</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>CAN_F13R2</name>
                <displayName>CAN_F13R2</displayName>
                <description>CAN Filter13 Register2</description>
                <addressOffset>0x2AC</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>FBC</name>
                        <description>Filter bits identifier or mask</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>32</bitWidth>
                    </field>
                </fields>
            </register>
        </registers>
    </peripheral>
    <peripheral>
        <name>USART1</name>
        <description>Universal Synchronous Asynchronous Receiver Transmitter</description>
        <groupName>USART</groupName>
        <baseAddress>0x40013800</baseAddress>
        <addressBlock>
            <offset>0x0</offset>
            <size>0x400</size>
            <usage>registers</usage>
        </addressBlock>
        <interrupt>
            <name>USART1</name>
            <description>USART1 global interrupt</description>
            <value>37</value>
        </interrupt>
        <registers>
            <register>
                <name>USART_CTRL1</name>
                <displayName>USART_CTRL1</displayName>
                <description>USART Control Register 1</description>
                <addressOffset>0x00</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>TEDEN</name>
                        <description>TX enable delay</description>
                        <bitOffset>29</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>SWAP</name>
                        <description>Swap TX/RX pins</description>
                        <bitOffset>27</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>OSPM</name>
                        <description>Oversampling mode</description>
                        <bitOffset>26</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>DEAT</name>
                        <description>Driver enable assertion time</description>
                        <bitOffset>21</bitOffset>
                        <bitWidth>5</bitWidth>
                    </field>
                    <field>
                        <name>DEDT</name>
                        <description>Driver enable deassertion time</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>5</bitWidth>
                    </field>
                    <field>
                        <name>DEP</name>
                        <description>Driver enable polarity</description>
                        <bitOffset>15</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>DEM</name>
                        <description>Driver enable mode</description>
                        <bitOffset>14</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>SDBRK</name>
                        <description>Send break</description>
                        <bitOffset>13</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>PEIEN</name>
                        <description>PE interrupt enable</description>
                        <bitOffset>12</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>TXCIEN</name>
                        <description>TX complete interrupt enable</description>
                        <bitOffset>11</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>TXDEIEN</name>
                        <description>TX data empty interrupt enable</description>
                        <bitOffset>10</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>RXDNEIEN</name>
                        <description>RX data not empty interrupt enable</description>
                        <bitOffset>9</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>IDLEIEN</name>
                        <description>IDLE line interrupt enable</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>WUM</name>
                        <description>Wake up mode</description>
                        <bitOffset>7</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>RCVWU</name>
                        <description>Receiver wakeup</description>
                        <bitOffset>6</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>WL</name>
                        <description>Word length</description>
                        <bitOffset>5</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>PCEN</name>
                        <description>Parity control enable</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>PSEL</name>
                        <description>Parity selection</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>TXEN</name>
                        <description>Transmitter enable</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>RXEN</name>
                        <description>Receiver enable</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>UEN</name>
                        <description>USART enable</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>USART_CTRL2</name>
                <displayName>USART_CTRL2</displayName>
                <description>USART Control Register 2</description>
                <addressOffset>0x04</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>RTOITE</name>
                        <description>Receiver timeout interrupt enable</description>
                        <bitOffset>17</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>RTOCF</name>
                        <description>Receiver timeout clear flag</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>RTOEN</name>
                        <description>Receiver timeout enable</description>
                        <bitOffset>15</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>LINBDL</name>
                        <description>LIN break detection length</description>
                        <bitOffset>14</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>LINBDIEN</name>
                        <description>LIN break detection interrupt enable</description>
                        <bitOffset>13</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>LINMEN</name>
                        <description>LIN mode enable</description>
                        <bitOffset>12</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>LBCLK</name>
                        <description>Last bit clock pulse</description>
                        <bitOffset>11</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>CLKPHA</name>
                        <description>Clock phase</description>
                        <bitOffset>10</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>CLKPOL</name>
                        <description>Clock polarity</description>
                        <bitOffset>9</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>CLKEN</name>
                        <description>Clock enable</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>STPB</name>
                        <description>STOP bits</description>
                        <bitOffset>5</bitOffset>
                        <bitWidth>2</bitWidth>
                    </field>
                    <field>
                        <name>ADDR</name>
                        <description>USART address</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>4</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>USART_CTRL3</name>
                <displayName>USART_CTRL3</displayName>
                <description>USART Control Register 3</description>
                <addressOffset>0x08</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>SCNACK</name>
                        <description>Smartcard NACK enable</description>
                        <bitOffset>10</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>SCMEN</name>
                        <description>Smartcard mode enable</description>
                        <bitOffset>9</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>IRDALP</name>
                        <description>IrDA low-power</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>IRDAMEN</name>
                        <description>IrDA mode enable</description>
                        <bitOffset>7</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>ERRIEN</name>
                        <description>Error interrupt enable</description>
                        <bitOffset>6</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>DMARXEN</name>
                        <description>DMA receiver enable</description>
                        <bitOffset>5</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>DMATXEN</name>
                        <description>DMA transmitter enable</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>HDMEN</name>
                        <description>Half-duplex mode enable</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>RTSEN</name>
                        <description>RTS enable</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>CTSIEN</name>
                        <description>CTS interrupt enable</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>CTSEN</name>
                        <description>CTS enable</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>USART_STS</name>
                <displayName>USART_STS</displayName>
                <description>USART Status Register</description>
                <addressOffset>0x0C</addressOffset>
                <size>0x20</size>
                <resetValue>0x00000180</resetValue>
                <fields>
                    <field>
                        <name>RTOF</name>
                        <description>Receiver timeout</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>1</bitWidth>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>FEF</name>
                        <description>Framing error</description>
                        <bitOffset>15</bitOffset>
                        <bitWidth>1</bitWidth>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>NEF</name>
                        <description>Noise error flag</description>
                        <bitOffset>14</bitOffset>
                        <bitWidth>1</bitWidth>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>OREF</name>
                        <description>Overrun error</description>
                        <bitOffset>13</bitOffset>
                        <bitWidth>1</bitWidth>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>PEF</name>
                        <description>Parity error</description>
                        <bitOffset>12</bitOffset>
                        <bitWidth>1</bitWidth>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>LINBDF</name>
                        <description>LIN break detection flag</description>
                        <bitOffset>11</bitOffset>
                        <bitWidth>1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>CTSF</name>
                        <description>CTS flag</description>
                        <bitOffset>10</bitOffset>
                        <bitWidth>1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>RXDNE</name>
                        <description>Read data register not empty</description>
                        <bitOffset>9</bitOffset>
                        <bitWidth>1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>TXC</name>
                        <description>Transmission complete</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>TXDE</name>
                        <description>Transmit data register empty</description>
                        <bitOffset>7</bitOffset>
                        <bitWidth>1</bitWidth>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>IDLEF</name>
                        <description>IDLE line detected</description>
                        <bitOffset>6</bitOffset>
                        <bitWidth>1</bitWidth>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>USART_DAT</name>
                <displayName>USART_DAT</displayName>
                <description>USART Data Register</description>
                <addressOffset>0x10</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>DATV</name>
                        <description>Data value</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>9</bitWidth>
                    </field>
                </fields>
            </register>
