Nsing-Community/Nsing-Pack/Nations_Device_PACK_Add_To_IAR_Tool/Nations Device PACK/debugger/Nsing/N32G41x/N32G41x.svd
            <register>
                <name>USART_BRCF</name>
                <displayName>USART_BRCF</displayName>
                <description>USART Baud Rate Configuration Register</description>
                <addressOffset>0x14</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>DIV_Integer</name>
                        <description>Divider integer part</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>12</bitWidth>
                    </field>
                    <field>
                        <name>DIV_Decimal</name>
                        <description>Divider decimal part</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>4</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>USART_GTP</name>
                <displayName>USART_GTP</displayName>
                <description>USART Guard Time and Prescaler Register</description>
                <addressOffset>0x18</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>GTV</name>
                        <description>Guard time value</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>8</bitWidth>
                    </field>
                    <field>
                        <name>PSCV</name>
                        <description>Prescaler value</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>8</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>USART_RTO</name>
                <displayName>USART_RTO</displayName>
                <description>USART Receiver Timeout Register</description>
                <addressOffset>0x24</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>TIME</name>
                        <description>Receiver timeout value</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>28</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>USART_WKUP</name>
                <displayName>USART_WKUP</displayName>
                <description>USART Low Power Wakeup Register</description>
                <addressOffset>0x28</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>DATCLR</name>
                        <description>Clear received wakeup data</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>EN</name>
                        <description>Wakeup enable</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                </fields>
            </register>
        </registers>
    </peripheral>
    <peripheral derivedFrom="USART1">
        <name>USART2</name>
        <baseAddress>0x40004400</baseAddress>
        <interrupt>
            <name>USART2</name>
            <description>USART2 global interrupt</description>
            <value>38</value>
        </interrupt>
    </peripheral>
    <peripheral derivedFrom="USART1">
        <name>USART3</name>
        <baseAddress>0x40004800</baseAddress>
        <interrupt>
            <name>USART3</name>
            <description>USART3 global interrupt</description>
            <value>39</value>
        </interrupt>
    </peripheral>
    <peripheral derivedFrom="USART1">
        <name>USART4</name>
        <baseAddress>0x40015000</baseAddress>
        <interrupt>
            <name>USART4</name>
            <description>USART4 global interrupt</description>
            <value>32</value>
        </interrupt>
    </peripheral>
    <peripheral>
        <name>I2C1</name>
        <description>Inter-Integrated Circuit</description>
        <groupName>I2C</groupName>
        <baseAddress>0x40005400</baseAddress>
        <addressBlock>
            <offset>0x0</offset>
            <size>0x400</size>
            <usage>registers</usage>
        </addressBlock>
        <interrupt>
            <name>I2C1</name>
            <description>I2C1 global interrupt</description>
            <value>31</value>
        </interrupt>
        <registers>
            <register>
                <name>I2C_CTRL1</name>
                <displayName>I2C_CTRL1</displayName>
                <description>I2C Control Register 1</description>
                <addressOffset>0x00</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>STPBP</name>
                        <description>Stop bypass</description>
                        <bitOffset>31</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>LTOSEL</name>
                        <description>Low timeout threshold selection</description>
                        <bitOffset>29</bitOffset>
                        <bitWidth>2</bitWidth>
                    </field>
                    <field>
                        <name>HTOSEL</name>
                        <description>High timeout threshold selection</description>
                        <bitOffset>27</bitOffset>
                        <bitWidth>2</bitWidth>
                    </field>
                    <field>
                        <name>DATACKTC</name>
                        <description>Data ACK timing control</description>
                        <bitOffset>19</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>SWRESET</name>
                        <description>Software reset</description>
                        <bitOffset>13</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>SMBALERT</name>
                        <description>SMBus alert</description>
                        <bitOffset>12</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>PEC</name>
                        <description>Packet error checking</description>
                        <bitOffset>11</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>ACKPOS</name>
                        <description>Acknowledge/PEC position</description>
                        <bitOffset>10</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>ACKEN</name>
                        <description>Acknowledge enable</description>
                        <bitOffset>9</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>STOPGEN</name>
                        <description>Stop generation</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>STARTGEN</name>
                        <description>Start generation</description>
                        <bitOffset>7</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>NOEXTEND</name>
                        <description>Clock stretching disable</description>
                        <bitOffset>6</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>GCEN</name>
                        <description>General call enable</description>
                        <bitOffset>5</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>PECEN</name>
                        <description>PEC enable</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>ARPEN</name>
                        <description>ARP enable</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>SMBTYPE</name>
                        <description>SMBus type</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>SMBMODE</name>
                        <description>SMBus mode</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>EN</name>
                        <description>Peripheral enable</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>I2C_CTRL2</name>
                <displayName>I2C_CTRL2</displayName>
                <description>I2C Control Register 2</description>
                <addressOffset>0x04</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>LTOEN</name>
                        <description>SCL and SDA low timeout enable</description>
                        <bitOffset>30</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>HTOEN</name>
                        <description>High timeout enable</description>
                        <bitOffset>29</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>SCLLTOINTEN</name>
                        <description>SCL low timeout error interrupt enable</description>
                        <bitOffset>28</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>SCLHTOINTEN</name>
                        <description>SCL high timeout error interrupt enable</description>
                        <bitOffset>27</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>SDALTOINTEN</name>
                        <description>SDA low timeout error interrupt enable</description>
                        <bitOffset>26</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>DMAEN</name>
                        <description>DMA requests enable</description>
                        <bitOffset>15</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>ERRINTEN</name>
                        <description>Error interrupt enable</description>
                        <bitOffset>14</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>EVTINTEN</name>
                        <description>Event interrupt enable</description>
                        <bitOffset>13</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>BUFINTEN</name>
                        <description>Buffer interrupt enable</description>
                        <bitOffset>12</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>DMALAST</name>
                        <description>DMA last transfer</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>CLKFREQ</name>
                        <description>Peripheral clock frequency</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>7</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>I2C_OADDR1</name>
                <displayName>I2C_OADDR1</displayName>
                <description>I2C Own Address Register 1</description>
                <addressOffset>0x08</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x0000</resetValue>
                <fields>
                    <field>
                        <name>ADDRMODE</name>
                        <description>Addressing mode</description>
                        <bitOffset>15</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>ADDR_H</name>
                        <description>Interface address bits 9:8</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>2</bitWidth>
                    </field>
                    <field>
                        <name>ADDR</name>
                        <description>Interface address bits 7:1</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>7</bitWidth>
                    </field>
                    <field>
                        <name>ADDR0</name>
                        <description>Interface address bit 0</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>I2C_OADDR2</name>
                <displayName>I2C_OADDR2</displayName>
                <description>I2C Own Address Register 2</description>
                <addressOffset>0x0C</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x0000</resetValue>
                <fields>
                    <field>
                        <name>ADDR2</name>
                        <description>Interface address bits 7:1</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>7</bitWidth>
                    </field>
                    <field>
                        <name>DUALEN</name>
                        <description>Dual addressing mode enable</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>I2C_DAT</name>
                <displayName>I2C_DAT</displayName>
                <description>I2C Data Register</description>
                <addressOffset>0x10</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x0000</resetValue>
                <fields>
                    <field>
                        <name>DATA</name>
                        <description>8-bit data register</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>8</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>I2C_STS1</name>
                <displayName>I2C_STS1</displayName>
                <description>I2C Status Register 1</description>
                <addressOffset>0x14</addressOffset>
                <size>0x20</size>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>SCLLTO</name>
                        <description>SCL low timeout error</description>
                        <bitOffset>25</bitOffset>
                        <bitWidth>1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>SCLHTO</name>
                        <description>SCL high timeout error</description>
                        <bitOffset>24</bitOffset>
                        <bitWidth>1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>SDALTO</name>
                        <description>SDA low timeout error</description>
                        <bitOffset>23</bitOffset>
                        <bitWidth>1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>SMBALERT</name>
                        <description>SMBus alert</description>
                        <bitOffset>14</bitOffset>
                        <bitWidth>1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>TIMEOUT</name>
                        <description>Timeout flag</description>
                        <bitOffset>13</bitOffset>
                        <bitWidth>1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>PECERR</name>
                        <description>PEC error in reception</description>
                        <bitOffset>12</bitOffset>
                        <bitWidth>1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>OVERRUN</name>
                        <description>Overrun/Underrun</description>
                        <bitOffset>11</bitOffset>
                        <bitWidth>1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>BUSERR</name>
                        <description>Bus error</description>
                        <bitOffset>10</bitOffset>
                        <bitWidth>1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>ARLOST</name>
                        <description>Arbitration lost</description>
                        <bitOffset>9</bitOffset>
                        <bitWidth>1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>ACKFAIL</name>
                        <description>Acknowledge failure</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>ADDR10F</name>
                        <description>10-bit header sent</description>
                        <bitOffset>6</bitOffset>
                        <bitWidth>1</bitWidth>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>TXDATE</name>
                        <description>Data register empty</description>
                        <bitOffset>5</bitOffset>
                        <bitWidth>1</bitWidth>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>RXDATNE</name>
                        <description>Data register not empty</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>1</bitWidth>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>STOPF</name>
                        <description>Stop condition detected</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>1</bitWidth>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>BSF</name>
                        <description>Byte transfer finished</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>ADDRF</name>
                        <description>Address sent/matched</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>STARTBF</name>
                        <description>Start bit</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
