Nsing-Community/Nsing-Pack/Nations_Device_PACK_Add_To_IAR_Tool/Nations Device PACK/debugger/Nsing/N32G41x/N32G41x.svd
            <register>
                <name>I2C_STS2</name>
                <displayName>I2C_STS2</displayName>
                <description>I2C Status Register 2</description>
                <addressOffset>0x18</addressOffset>
                <size>0x20</size>
                <access>read-only</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>PECVAL</name>
                        <description>Packet error checking register</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>8</bitWidth>
                    </field>
                    <field>
                        <name>SMBHADDR</name>
                        <description>SMBus host address</description>
                        <bitOffset>7</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>SMBDADDR</name>
                        <description>SMBus device default address</description>
                        <bitOffset>6</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>DUALFLAG</name>
                        <description>Dual flag</description>
                        <bitOffset>5</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>GCALLADDR</name>
                        <description>General call address</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>TRF</name>
                        <description>Transmitter/receiver</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>MSMODE</name>
                        <description>Master/slave mode</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>BUSY</name>
                        <description>Bus busy</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>I2C_CLKCTRL</name>
                <displayName>I2C_CLKCTRL</displayName>
                <description>I2C Clock Control Register</description>
                <addressOffset>0x1C</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x0000</resetValue>
                <fields>
                    <field>
                        <name>DUTY</name>
                        <description>Fast mode duty cycle</description>
                        <bitOffset>15</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>FSMODE</name>
                        <description>I2C fast mode selection</description>
                        <bitOffset>14</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>CLKCTRL</name>
                        <description>Clock control divider</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>12</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>I2C_TMRISE</name>
                <displayName>I2C_TMRISE</displayName>
                <description>I2C Rise Time Register</description>
                <addressOffset>0x20</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x0002</resetValue>
                <fields>
                    <field>
                        <name>TMRISE</name>
                        <description>Maximum rise time</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>6</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>I2C_GFLTRCTRL</name>
                <displayName>I2C_GFLTRCTRL</displayName>
                <description>I2C Filter Control Register</description>
                <addressOffset>0x28</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x0000</resetValue>
                <fields>
                    <field>
                        <name>SCLAFENN</name>
                        <description>SCL analog filter enable</description>
                        <bitOffset>15</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>SCLAFW</name>
                        <description>SCL analog filter width</description>
                        <bitOffset>12</bitOffset>
                        <bitWidth>2</bitWidth>
                    </field>
                    <field>
                        <name>SDAAFENN</name>
                        <description>SDA analog filter enable</description>
                        <bitOffset>11</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>SDAAFW</name>
                        <description>SDA analog filter width</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>2</bitWidth>
                    </field>
                    <field>
                        <name>SCLDFW</name>
                        <description>SCL digital filter width</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>4</bitWidth>
                    </field>
                    <field>
                        <name>SDADFW</name>
                        <description>SDA digital filter width</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>4</bitWidth>
                    </field>
                </fields>
            </register>
