Nsing-Community/Nsing-Pack/Nations_Device_PACK_Add_To_IAR_Tool/Nations Device PACK/debugger/Nsing/N32G41x/N32G41x.svd
        </registers>
    </peripheral>
    <peripheral derivedFrom="I2C1">
        <name>I2C2</name>
        <baseAddress>0x40005800</baseAddress>
        <interrupt>
            <name>I2C2</name>
            <description>I2C2 global interrupt</description>
            <value>33</value>
        </interrupt>
    </peripheral>
    <peripheral>
        <name>RTC</name>
        <description>Real-Time Clock</description>
        <groupName>RTC</groupName>
        <baseAddress>0x40002800</baseAddress>
        <addressBlock>
            <offset>0x0</offset>
            <size>0x400</size>
            <usage>registers</usage>
        </addressBlock>
        <interrupt>
            <name>RTC_STAMP_LSECSS</name>
            <description>RTC timestamp and LSE CSS interrupt</description>
            <value>2</value>
        </interrupt>
        <interrupt>
            <name>RTC_WKUP</name>
            <description>RTC wakeup interrupt</description>
            <value>3</value>
        </interrupt>
        <interrupt>
            <name>RTC_Alarm</name>
            <description>RTC alarm interrupt</description>
            <value>41</value>
        </interrupt>
        <registers>
            <register>
                <name>RTC_INITSTS</name>
                <displayName>RTC_INITSTS</displayName>
                <description>RTC Initial Status Register</description>
                <addressOffset>0x00</addressOffset>
                <size>0x20</size>
                <resetValue>0x00000007</resetValue>
                <fields>
                    <field>
                        <name>RECPF</name>
                        <description>Recalibration pending flag</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>1</bitWidth>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>TISOVF</name>
                        <description>Timestamp overflow flag</description>
                        <bitOffset>12</bitOffset>
                        <bitWidth>1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>TISF</name>
                        <description>Timestamp flag</description>
                        <bitOffset>11</bitOffset>
                        <bitWidth>1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>WTF</name>
                        <description>Wakeup timer flag</description>
                        <bitOffset>10</bitOffset>
                        <bitWidth>1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>ALBF</name>
                        <description>Alarm B flag</description>
                        <bitOffset>9</bitOffset>
                        <bitWidth>1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>ALAF</name>
                        <description>Alarm A flag</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>INITM</name>
                        <description>Initialization mode</description>
                        <bitOffset>7</bitOffset>
                        <bitWidth>1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>INITF</name>
                        <description>Initialization flag</description>
                        <bitOffset>6</bitOffset>
                        <bitWidth>1</bitWidth>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>RSYF</name>
                        <description>Registers synchronization flag</description>
                        <bitOffset>5</bitOffset>
                        <bitWidth>1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>INITSF</name>
                        <description>Initial state flag</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>1</bitWidth>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>SHOPF</name>
                        <description>Shift operation pending flag</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>1</bitWidth>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>WTWF</name>
                        <description>Wakeup timer write flag</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>ALBWF</name>
                        <description>Alarm B write flag</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>ALAWF</name>
                        <description>Alarm A write flag</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>RTC_CTRL</name>
                <displayName>RTC_CTRL</displayName>
                <description>RTC Control Register</description>
                <addressOffset>0x04</addressOffset>
                <size>0x20</size>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>COEN</name>
                        <description>Calibration output enable</description>
                        <bitOffset>23</bitOffset>
                        <bitWidth>1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>OUTSEL</name>
                        <description>Output selection</description>
                        <bitOffset>21</bitOffset>
                        <bitWidth>2</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>OPOL</name>
                        <description>Output polarity</description>
                        <bitOffset>20</bitOffset>
                        <bitWidth>1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>CALOSEL</name>
                        <description>Calibration output selection</description>
                        <bitOffset>19</bitOffset>
                        <bitWidth>1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>BAKP</name>
                        <description>Daylight saving backup</description>
                        <bitOffset>18</bitOffset>
                        <bitWidth>1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>SU1H</name>
                        <description>Subtract 1 hour</description>
                        <bitOffset>17</bitOffset>
                        <bitWidth>1</bitWidth>
                        <access>write-only</access>
                    </field>
                    <field>
                        <name>AD1H</name>
                        <description>Add 1 hour</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>1</bitWidth>
                        <access>write-only</access>
                    </field>
                    <field>
                        <name>TSIEN</name>
                        <description>Timestamp interrupt enable</description>
                        <bitOffset>15</bitOffset>
                        <bitWidth>1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>WTIEN</name>
                        <description>Wakeup timer interrupt enable</description>
                        <bitOffset>14</bitOffset>
                        <bitWidth>1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>ALBIEN</name>
                        <description>Alarm B interrupt enable</description>
                        <bitOffset>13</bitOffset>
                        <bitWidth>1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>ALAIEN</name>
                        <description>Alarm A interrupt enable</description>
                        <bitOffset>12</bitOffset>
                        <bitWidth>1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>TSEN</name>
                        <description>Timestamp enable</description>
                        <bitOffset>11</bitOffset>
                        <bitWidth>1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>WTEN</name>
                        <description>Wakeup timer enable</description>
                        <bitOffset>10</bitOffset>
                        <bitWidth>1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>ALBEN</name>
                        <description>Alarm B enable</description>
                        <bitOffset>9</bitOffset>
                        <bitWidth>1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>ALAEN</name>
                        <description>Alarm A enable</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>HFMT</name>
                        <description>Hour format</description>
                        <bitOffset>6</bitOffset>
                        <bitWidth>1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>BYPS</name>
                        <description>Bypass shadow registers</description>
                        <bitOffset>5</bitOffset>
                        <bitWidth>1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>REFCLKEN</name>
                        <description>RTC_REFIN detection enable</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>TEDGE</name>
                        <description>Timestamp event trigger edge</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>WKUPSEL</name>
                        <description>Wakeup clock selection</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>3</bitWidth>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>RTC_TSH</name>
                <displayName>RTC_TSH</displayName>
                <description>RTC Calendar Time Register</description>
                <addressOffset>0x08</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>APM</name>
                        <description>AM/PM format</description>
                        <bitOffset>22</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>HOT</name>
                        <description>Hour tens BCD</description>
                        <bitOffset>20</bitOffset>
                        <bitWidth>2</bitWidth>
                    </field>
                    <field>
                        <name>HOU</name>
                        <description>Hour units BCD</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>4</bitWidth>
                    </field>
                    <field>
                        <name>MIT</name>
                        <description>Minute tens BCD</description>
                        <bitOffset>12</bitOffset>
                        <bitWidth>3</bitWidth>
                    </field>
                    <field>
                        <name>MIU</name>
                        <description>Minute units BCD</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>4</bitWidth>
                    </field>
                    <field>
                        <name>SCT</name>
                        <description>Second tens BCD</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>3</bitWidth>
                    </field>
                    <field>
                        <name>SCU</name>
                        <description>Second units BCD</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>4</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>RTC_DATE</name>
                <displayName>RTC_DATE</displayName>
                <description>RTC Calendar Date Register</description>
                <addressOffset>0x0C</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00002101</resetValue>
                <fields>
                    <field>
                        <name>YRT</name>
                        <description>Year tens BCD</description>
                        <bitOffset>20</bitOffset>
                        <bitWidth>4</bitWidth>
                    </field>
                    <field>
                        <name>YRU</name>
                        <description>Year units BCD</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>4</bitWidth>
                    </field>
                    <field>
                        <name>WDU</name>
                        <description>Week day units</description>
                        <bitOffset>13</bitOffset>
                        <bitWidth>3</bitWidth>
                    </field>
                    <field>
                        <name>MOT</name>
                        <description>Month tens BCD</description>
                        <bitOffset>12</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>MOU</name>
                        <description>Month units BCD</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>4</bitWidth>
                    </field>
                    <field>
                        <name>DAT</name>
                        <description>Date tens BCD</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>2</bitWidth>
                    </field>
                    <field>
                        <name>DAU</name>
                        <description>Date units BCD</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>4</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>RTC_WRP</name>
                <displayName>RTC_WRP</displayName>
                <description>RTC Write Protection Register</description>
                <addressOffset>0x10</addressOffset>
                <size>0x20</size>
                <access>write-only</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>PKEY</name>
                        <description>Write protection key</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>8</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>RTC_SCTRL</name>
                <displayName>RTC_SCTRL</displayName>
                <description>RTC Shift Control Register</description>
                <addressOffset>0x14</addressOffset>
                <size>0x20</size>
                <access>write-only</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>AD1S</name>
                        <description>Add one second</description>
                        <bitOffset>31</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>SUBF</name>
                        <description>Subtract sub-second value</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>15</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>RTC_SUBS</name>
                <displayName>RTC_SUBS</displayName>
                <description>RTC Sub-Second Register</description>
                <addressOffset>0x18</addressOffset>
                <size>0x20</size>
                <access>read-only</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>SS</name>
                        <description>Sub-second value</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>16</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>RTC_TST</name>
                <displayName>RTC_TST</displayName>
                <description>RTC Timestamp Time Register</description>
                <addressOffset>0x1C</addressOffset>
                <size>0x20</size>
                <access>read-only</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>APM</name>
                        <description>AM/PM format</description>
                        <bitOffset>22</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>HOT</name>
                        <description>Hour tens BCD</description>
                        <bitOffset>20</bitOffset>
                        <bitWidth>2</bitWidth>
                    </field>
                    <field>
                        <name>HOU</name>
                        <description>Hour units BCD</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>4</bitWidth>
                    </field>
                    <field>
                        <name>MIT</name>
                        <description>Minute tens BCD</description>
                        <bitOffset>12</bitOffset>
                        <bitWidth>3</bitWidth>
                    </field>
                    <field>
                        <name>MIU</name>
                        <description>Minute units BCD</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>4</bitWidth>
                    </field>
                    <field>
                        <name>SET</name>
                        <description>Second tens BCD</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>3</bitWidth>
                    </field>
                    <field>
                        <name>SEU</name>
                        <description>Second units BCD</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>4</bitWidth>
                    </field>
                </fields>
            </register>
