Nsing-Community/Nsing-Pack/Nations_Device_PACK_Add_To_IAR_Tool/Nations Device PACK/debugger/Nsing/N32G41x/N32G41x.svd
            <register>
                <name>RTC_ALARMA</name>
                <displayName>RTC_ALARMA</displayName>
                <description>RTC Alarm A Register</description>
                <addressOffset>0x20</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>MASK4</name>
                        <description>Alarm date mask</description>
                        <bitOffset>31</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>WKDSEL</name>
                        <description>Week day selection</description>
                        <bitOffset>30</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>DTT</name>
                        <description>Date tens BCD</description>
                        <bitOffset>28</bitOffset>
                        <bitWidth>2</bitWidth>
                    </field>
                    <field>
                        <name>DTU</name>
                        <description>Date units BCD</description>
                        <bitOffset>24</bitOffset>
                        <bitWidth>4</bitWidth>
                    </field>
                    <field>
                        <name>MASK3</name>
                        <description>Alarm hours mask</description>
                        <bitOffset>23</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>APM</name>
                        <description>AM/PM format</description>
                        <bitOffset>22</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>HOT</name>
                        <description>Hour tens BCD</description>
                        <bitOffset>20</bitOffset>
                        <bitWidth>2</bitWidth>
                    </field>
                    <field>
                        <name>HOU</name>
                        <description>Hour units BCD</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>4</bitWidth>
                    </field>
                    <field>
                        <name>MASK2</name>
                        <description>Alarm minutes mask</description>
                        <bitOffset>15</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>MIT</name>
                        <description>Minute tens BCD</description>
                        <bitOffset>12</bitOffset>
                        <bitWidth>3</bitWidth>
                    </field>
                    <field>
                        <name>MIU</name>
                        <description>Minute units BCD</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>4</bitWidth>
                    </field>
                    <field>
                        <name>MASK1</name>
                        <description>Alarm seconds mask</description>
                        <bitOffset>7</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>SET</name>
                        <description>Second tens BCD</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>3</bitWidth>
                    </field>
                    <field>
                        <name>SEU</name>
                        <description>Second units BCD</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>4</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>RTC_PRE</name>
                <displayName>RTC_PRE</displayName>
                <description>RTC Prescaler Register</description>
                <addressOffset>0x24</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x007F00FF</resetValue>
                <fields>
                    <field>
                        <name>DIVA</name>
                        <description>Asynchronous prescaler</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>7</bitWidth>
                    </field>
                    <field>
                        <name>DIVS</name>
                        <description>Synchronous prescaler</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>15</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>RTC_ALARMB</name>
                <displayName>RTC_ALARMB</displayName>
                <description>RTC Alarm B Register</description>
                <addressOffset>0x28</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>MASK4</name>
                        <description>Alarm date mask</description>
                        <bitOffset>31</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>WKDSEL</name>
                        <description>Week day selection</description>
                        <bitOffset>30</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>DTT</name>
                        <description>Date tens BCD</description>
                        <bitOffset>28</bitOffset>
                        <bitWidth>2</bitWidth>
                    </field>
                    <field>
                        <name>DTU</name>
                        <description>Date units BCD</description>
                        <bitOffset>24</bitOffset>
                        <bitWidth>4</bitWidth>
                    </field>
                    <field>
                        <name>MASK3</name>
                        <description>Alarm hours mask</description>
                        <bitOffset>23</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>APM</name>
                        <description>AM/PM format</description>
                        <bitOffset>22</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>HOT</name>
                        <description>Hour tens BCD</description>
                        <bitOffset>20</bitOffset>
                        <bitWidth>2</bitWidth>
                    </field>
                    <field>
                        <name>HOU</name>
                        <description>Hour units BCD</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>4</bitWidth>
                    </field>
                    <field>
                        <name>MASK2</name>
                        <description>Alarm minutes mask</description>
                        <bitOffset>15</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>MIT</name>
                        <description>Minute tens BCD</description>
                        <bitOffset>12</bitOffset>
                        <bitWidth>3</bitWidth>
                    </field>
                    <field>
                        <name>MIU</name>
                        <description>Minute units BCD</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>4</bitWidth>
                    </field>
                    <field>
                        <name>MASK1</name>
                        <description>Alarm seconds mask</description>
                        <bitOffset>7</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>SET</name>
                        <description>Second tens BCD</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>3</bitWidth>
                    </field>
                    <field>
                        <name>SEU</name>
                        <description>Second units BCD</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>4</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>RTC_WKUPT</name>
                <displayName>RTC_WKUPT</displayName>
                <description>RTC Wakeup Timer Register</description>
                <addressOffset>0x2C</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x0000FFFF</resetValue>
                <fields>
                    <field>
                        <name>WKUPT</name>
                        <description>Wakeup auto-reload value</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>16</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>RTC_ALRMASS</name>
                <displayName>RTC_ALRMASS</displayName>
                <description>RTC Alarm A Sub-Second Register</description>
                <addressOffset>0x34</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>MASKSSB</name>
                        <description>Mask most-significant bits</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>4</bitWidth>
                    </field>
                    <field>
                        <name>SSV</name>
                        <description>Sub-second value</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>15</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>RTC_OPT</name>
                <displayName>RTC_OPT</displayName>
                <description>RTC Options Register</description>
                <addressOffset>0x38</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>TYPE</name>
                        <description>Output type</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>RTC_ALRMBSS</name>
                <displayName>RTC_ALRMBSS</displayName>
                <description>RTC Alarm B Sub-Second Register</description>
                <addressOffset>0x3C</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>MASKSSB</name>
                        <description>Mask most-significant bits</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>4</bitWidth>
                    </field>
                    <field>
                        <name>SSV</name>
                        <description>Sub-second value</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>15</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>RTC_CALIB</name>
                <displayName>RTC_CALIB</displayName>
                <description>RTC Calibration Register</description>
                <addressOffset>0x40</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>CP</name>
                        <description>Increase frequency 488.5ppm</description>
                        <bitOffset>11</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>CW8</name>
                        <description>Use 8-second calibration</description>
                        <bitOffset>10</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>CW16</name>
                        <description>Use 16-second calibration</description>
                        <bitOffset>9</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>CM</name>
                        <description>Negative calibration</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>9</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>RTC_TSSS</name>
                <displayName>RTC_TSSS</displayName>
                <description>RTC Timestamp Sub-Second Register</description>
                <addressOffset>0x44</addressOffset>
                <size>0x20</size>
                <access>read-only</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>SSE</name>
                        <description>Sub-second value</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>16</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>RTC_TSD</name>
                <displayName>RTC_TSD</displayName>
                <description>RTC Timestamp Date Register</description>
                <addressOffset>0x48</addressOffset>
                <size>0x20</size>
                <access>read-only</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>MOT</name>
                        <description>Month tens BCD</description>
                        <bitOffset>15</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>WDU</name>
                        <description>Week day units</description>
                        <bitOffset>12</bitOffset>
                        <bitWidth>3</bitWidth>
                    </field>
                    <field>
                        <name>MOU</name>
                        <description>Month units BCD</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>4</bitWidth>
                    </field>
                    <field>
                        <name>DAT</name>
                        <description>Date tens BCD</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>2</bitWidth>
                    </field>
                    <field>
                        <name>DAU</name>
                        <description>Date units BCD</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>4</bitWidth>
                    </field>
                </fields>
            </register>
