Nsing-Community/Nsing-Pack/Nations_Device_PACK_Add_To_IAR_Tool/Nations Device PACK/debugger/Nsing/N32G41x/N32G41x.svd
        </registers>
    </peripheral>
    <peripheral>
        <name>BTIM1</name>
        <description>Basic Timer 1</description>
        <groupName>BTIM</groupName>
        <baseAddress>0x40001000</baseAddress>
        <addressBlock>
            <offset>0x0</offset>
            <size>0x400</size>
            <usage>registers</usage>
        </addressBlock>
        <interrupt>
            <name>BTIM1</name>
            <description>BTIM1 global interrupt</description>
            <value>20</value>
        </interrupt>
        <registers>
            <register>
                <name>TIM_CTRL1</name>
                <displayName>TIM_CTRL1</displayName>
                <description>TIM Control Register 1</description>
                <addressOffset>0x00</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>ARPEN</name>
                        <description>Auto-reload preload enable</description>
                        <bitOffset>9</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>ONEPM</name>
                        <description>One pulse mode</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>UPDIS</name>
                        <description>Update disable</description>
                        <bitOffset>5</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>UPRS</name>
                        <description>Update request source</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>CNTEN</name>
                        <description>Counter enable</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>TIM_CTRL2</name>
                <displayName>TIM_CTRL2</displayName>
                <description>TIM Control Register 2</description>
                <addressOffset>0x04</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>MMSEL</name>
                        <description>Master mode selection</description>
                        <bitOffset>12</bitOffset>
                        <bitWidth>4</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>TIM_STS</name>
                <displayName>TIM_STS</displayName>
                <description>TIM Status Register</description>
                <addressOffset>0x08</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>UDITF</name>
                        <description>Update interrupt flag</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>TIM_EVTGEN</name>
                <displayName>TIM_EVTGEN</displayName>
                <description>TIM Event Generation Register</description>
                <addressOffset>0x0C</addressOffset>
                <size>0x20</size>
                <access>write-only</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>UDGN</name>
                        <description>Update generation</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>TIM_DINTEN</name>
                <displayName>TIM_DINTEN</displayName>
                <description>TIM DMA/Interrupt Enable Register</description>
                <addressOffset>0x14</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>UDEN</name>
                        <description>Update DMA request enable</description>
                        <bitOffset>19</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>UIEN</name>
                        <description>Update interrupt enable</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>TIM_PSC</name>
                <displayName>TIM_PSC</displayName>
                <description>TIM Prescaler Register</description>
                <addressOffset>0x40</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>PSC</name>
                        <description>Prescaler value</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>16</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>TIM_AR</name>
                <displayName>TIM_AR</displayName>
                <description>TIM Auto-Reload Register</description>
                <addressOffset>0x44</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x0000FFFF</resetValue>
                <fields>
                    <field>
                        <name>AR</name>
                        <description>Auto-reload value</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>16</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>TIM_CNT</name>
                <displayName>TIM_CNT</displayName>
                <description>TIM Counter Register</description>
                <addressOffset>0x48</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>CNT</name>
                        <description>Counter value</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>16</bitWidth>
                    </field>
                </fields>
            </register>
