Nsing-Community/Nsing-Pack/Nations_Device_PACK_Add_To_IAR_Tool/Nations Device PACK/debugger/Nsing/N32G41x/N32G41x.svd
        </registers>
    </peripheral>
    <peripheral derivedFrom="BTIM1">
        <name>BTIM2</name>
        <baseAddress>0x40001400</baseAddress>
        <interrupt>
            <name>BTIM2</name>
            <description>BTIM2 global interrupt</description>
            <value>21</value>
        </interrupt>
    </peripheral>
    <peripheral>
        <name>GTIM3</name>
        <description>General-purpose Timer 3</description>
        <groupName>GTIM</groupName>
        <baseAddress>0x40000800</baseAddress>
        <addressBlock>
            <offset>0x0</offset>
            <size>0x400</size>
            <usage>registers</usage>
        </addressBlock>
        <interrupt>
            <name>GTIM3</name>
            <description>GTIM3 global interrupt</description>
            <value>30</value>
        </interrupt>
        <registers>
            <register>
                <name>TIM_CTRL1</name>
                <displayName>TIM_CTRL1</displayName>
                <description>TIM Control Register 1</description>
                <addressOffset>0x00</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>ASYMMETRIC</name>
                        <description>Asymmetric mode enable</description>
                        <bitOffset>23</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>CLRSEL</name>
                        <description>OcxRef clear selection</description>
                        <bitOffset>13</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>PBKPEN</name>
                        <description>PVD as BRK enable</description>
                        <bitOffset>11</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>LBKPEN</name>
                        <description>LockUp as BRK enable</description>
                        <bitOffset>10</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>ARPEN</name>
                        <description>Auto-reload preload enable</description>
                        <bitOffset>9</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>ONEPM</name>
                        <description>One pulse mode</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>CLKD</name>
                        <description>Clock division</description>
                        <bitOffset>6</bitOffset>
                        <bitWidth>2</bitWidth>
                    </field>
                    <field>
                        <name>UPDIS</name>
                        <description>Update disable</description>
                        <bitOffset>5</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>UPRS</name>
                        <description>Update request source</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>CAMSEL</name>
                        <description>Center-aligned mode selection</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>2</bitWidth>
                    </field>
                    <field>
                        <name>DIR</name>
                        <description>Direction</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>CNTEN</name>
                        <description>Counter enable</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>TIM_CTRL2</name>
                <displayName>TIM_CTRL2</displayName>
                <description>TIM Control Register 2</description>
                <addressOffset>0x04</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>TI1SEL</name>
                        <description>TI1 selection</description>
                        <bitOffset>19</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>CCPCTL</name>
                        <description>Capture/compare preloaded control</description>
                        <bitOffset>18</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>CCDSEL</name>
                        <description>Capture/compare DMA selection</description>
                        <bitOffset>17</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>CCUSEL</name>
                        <description>Capture/compare control update selection</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>MMSEL</name>
                        <description>Master mode selection</description>
                        <bitOffset>12</bitOffset>
                        <bitWidth>4</bitWidth>
                    </field>
                    <field>
                        <name>OI4</name>
                        <description>Output idle state 4</description>
                        <bitOffset>6</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>OI3</name>
                        <description>Output idle state 3</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>OI2</name>
                        <description>Output idle state 2</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>OI1N</name>
                        <description>Output idle state 1N</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>OI1</name>
                        <description>Output idle state 1</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>TIM_STS</name>
                <displayName>TIM_STS</displayName>
                <description>TIM Status Register</description>
                <addressOffset>0x08</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>CSSFBITF</name>
                        <description>CSSF break interrupt flag</description>
                        <bitOffset>29</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>LBKPITF</name>
                        <description>Lockup break interrupt flag</description>
                        <bitOffset>28</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>IOMBITF</name>
                        <description>IOM break interrupt flag</description>
                        <bitOffset>27</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>CC9ITF</name>
                        <description>Capture/Compare 9 interrupt flag</description>
                        <bitOffset>26</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>CC8ITF</name>
                        <description>Capture/Compare 8 interrupt flag</description>
                        <bitOffset>25</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>CC7ITF</name>
                        <description>Capture/Compare 7 interrupt flag</description>
                        <bitOffset>24</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>COMPBITF</name>
                        <description>COMP break interrupt flag</description>
                        <bitOffset>23</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>PBKPITF</name>
                        <description>PVD break interrupt flag</description>
                        <bitOffset>22</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>SBITF</name>
                        <description>System break interrupt flag</description>
                        <bitOffset>21</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>BITF</name>
                        <description>Break1 interrupt flag</description>
                        <bitOffset>19</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>TITF</name>
                        <description>Trigger interrupt flag</description>
                        <bitOffset>18</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>COMITF</name>
                        <description>COM interrupt flag</description>
                        <bitOffset>17</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>UDITF</name>
                        <description>Update interrupt flag</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>CC4OCF</name>
                        <description>Capture/Compare 4 overcapture flag</description>
                        <bitOffset>11</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>CC3OCF</name>
                        <description>Capture/Compare 3 overcapture flag</description>
                        <bitOffset>10</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>CC2OCF</name>
                        <description>Capture/Compare 2 overcapture flag</description>
                        <bitOffset>9</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>CC1OCF</name>
                        <description>Capture/Compare 1 overcapture flag</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>CC6ITF</name>
                        <description>Capture/Compare 6 interrupt flag</description>
                        <bitOffset>5</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>CC5ITF</name>
                        <description>Capture/Compare 5 interrupt flag</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>CC4ITF</name>
                        <description>Capture/Compare 4 interrupt flag</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>CC3ITF</name>
                        <description>Capture/Compare 3 interrupt flag</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>CC2ITF</name>
                        <description>Capture/Compare 2 interrupt flag</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>CC1ITF</name>
                        <description>Capture/Compare 1 interrupt flag</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>TIM_EVTGEN</name>
                <displayName>TIM_EVTGEN</displayName>
                <description>TIM Event Generation Register</description>
                <addressOffset>0x0C</addressOffset>
                <size>0x20</size>
                <access>write-only</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>BGN</name>
                        <description>Break1 generation</description>
                        <bitOffset>11</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>TGN</name>
                        <description>Trigger generation</description>
                        <bitOffset>10</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>CCUDGN</name>
                        <description>Capture/Compare control update generation</description>
                        <bitOffset>9</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>UDGN</name>
                        <description>Update generation</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>CC4GN</name>
                        <description>Capture/Compare 4 generation</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>CC3GN</name>
                        <description>Capture/Compare 3 generation</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>CC2GN</name>
                        <description>Capture/Compare 2 generation</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>CC1GN</name>
                        <description>Capture/Compare 1 generation</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>TIM_SMCTRL</name>
                <displayName>TIM_SMCTRL</displayName>
                <description>TIM Slave Mode Control Register</description>
                <addressOffset>0x10</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>MSMD</name>
                        <description>Master/slave mode</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>EXTF</name>
                        <description>External trigger filter</description>
                        <bitOffset>12</bitOffset>
                        <bitWidth>4</bitWidth>
                    </field>
                    <field>
                        <name>EXTP</name>
                        <description>External trigger polarity</description>
                        <bitOffset>11</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>EXCEN</name>
                        <description>External clock enable</description>
                        <bitOffset>10</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>EXTPS</name>
                        <description>External trigger prescaler</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>2</bitWidth>
                    </field>
                    <field>
                        <name>SMSEL</name>
                        <description>Slave mode selection</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>4</bitWidth>
                    </field>
                    <field>
                        <name>TSEL</name>
                        <description>Trigger selection</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>3</bitWidth>
                    </field>
                </fields>
            </register>
