Nsing-Community/Nsing-Pack/Nations_Device_PACK_Add_To_IAR_Tool/Nations Device PACK/debugger/Nsing/N32G41x/N32G41x.svd
            <register>
                <name>TIM_PSC</name>
                <displayName>TIM_PSC</displayName>
                <description>TIM Prescaler Register</description>
                <addressOffset>0x40</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>PSC</name>
                        <description>Prescaler value</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>16</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>TIM_AR</name>
                <displayName>TIM_AR</displayName>
                <description>TIM Auto-Reload Register</description>
                <addressOffset>0x44</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x0000FFFF</resetValue>
                <fields>
                    <field>
                        <name>AR</name>
                        <description>Auto-reload value</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>16</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>TIM_CNT</name>
                <displayName>TIM_CNT</displayName>
                <description>TIM Counter Register</description>
                <addressOffset>0x48</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>CNT</name>
                        <description>Counter value</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>16</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>TIM_REPCNT</name>
                <displayName>TIM_REPCNT</displayName>
                <description>TIM Repetition Counter Register</description>
                <addressOffset>0x4C</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>REPCNT</name>
                        <description>Repetition counter value</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>8</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>TIM_BKDT</name>
                <displayName>TIM_BKDT</displayName>
                <description>TIM Break and Dead-Time Register</description>
                <addressOffset>0x50</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>BRKBID</name>
                        <description>Break1 bidirectional enable</description>
                        <bitOffset>20</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>BRKDSRM</name>
                        <description>Break1 disarm</description>
                        <bitOffset>18</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>LCKCFG</name>
                        <description>Lock configuration</description>
                        <bitOffset>14</bitOffset>
                        <bitWidth>2</bitWidth>
                    </field>
                    <field>
                        <name>OSSR</name>
                        <description>Off-state selection for Run mode</description>
                        <bitOffset>13</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>OSSI</name>
                        <description>Off-state selection for Idle mode</description>
                        <bitOffset>12</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>BKEN</name>
                        <description>Break1 enable</description>
                        <bitOffset>11</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>BKP</name>
                        <description>Break1 polarity</description>
                        <bitOffset>10</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>AOEN</name>
                        <description>Automatic output enable</description>
                        <bitOffset>9</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>MOEN</name>
                        <description>Main output enable</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>DTGN</name>
                        <description>Dead-time generator setup</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>8</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>TIM_BKFR</name>
                <displayName>TIM_BKFR</displayName>
                <description>TIM Break Filter Register</description>
                <addressOffset>0x60</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>THRESH</name>
                        <description>Threshold</description>
                        <bitOffset>24</bitOffset>
                        <bitWidth>6</bitWidth>
                    </field>
                    <field>
                        <name>WSIZE</name>
                        <description>Window size</description>
                        <bitOffset>17</bitOffset>
                        <bitWidth>6</bitWidth>
                    </field>
                    <field>
                        <name>FILTEN</name>
                        <description>Filter enable</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>TIM_INSEL</name>
                <displayName>TIM_INSEL</displayName>
                <description>TIM Input Selection Register</description>
                <addressOffset>0x78</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>CLRS</name>
                        <description>Select tim_ocref_clr input</description>
                        <bitOffset>24</bitOffset>
                        <bitWidth>4</bitWidth>
                    </field>
                    <field>
                        <name>ITRS</name>
                        <description>Select tim_itr input</description>
                        <bitOffset>20</bitOffset>
                        <bitWidth>4</bitWidth>
                    </field>
                    <field>
                        <name>ETRS</name>
                        <description>Select tim_etr input</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>4</bitWidth>
                    </field>
                    <field>
                        <name>TI4S</name>
                        <description>Select tim_ti4 input</description>
                        <bitOffset>12</bitOffset>
                        <bitWidth>4</bitWidth>
                    </field>
                    <field>
                        <name>TI3S</name>
                        <description>Select tim_ti3 input</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>4</bitWidth>
                    </field>
                    <field>
                        <name>TI2S</name>
                        <description>Select tim_ti2 input</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>4</bitWidth>
                    </field>
                    <field>
                        <name>TI1S</name>
                        <description>Select tim_ti1 input</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>4</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>TIM_AF1</name>
                <displayName>TIM_AF1</displayName>
                <description>TIM Alternate Function Register 1</description>
                <addressOffset>0x7C</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>IOM3BRKP</name>
                        <description>BKIN IO3 brake polarity</description>
                        <bitOffset>20</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>IOM2BRKP</name>
                        <description>BKIN IO2 brake polarity</description>
                        <bitOffset>19</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>IOM3BRKEN</name>
                        <description>BKIN IO3 brake enable</description>
                        <bitOffset>17</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>IOM2BRKEN</name>
                        <description>BKIN IO2 brake enable</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>COMP3BRKP</name>
                        <description>COMP3 brake polarity</description>
                        <bitOffset>12</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>COMP2BRKP</name>
                        <description>COMP2 brake polarity</description>
                        <bitOffset>11</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>COMP1BRKP</name>
                        <description>COMP1 brake polarity</description>
                        <bitOffset>10</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>IOMBRKP</name>
                        <description>BKIN brake polarity</description>
                        <bitOffset>9</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>COMP3BRKEN</name>
                        <description>COMP3 brake enable</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>COMP2BRKEN</name>
                        <description>COMP2 brake enable</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>COMP1BRKEN</name>
                        <description>COMP1 brake enable</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>IOMBRKEN</name>
                        <description>BKIN brake enable</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>TIM_DCTRL</name>
                <displayName>TIM_DCTRL</displayName>
                <description>TIM DMA Control Register</description>
                <addressOffset>0x94</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>DBADDR</name>
                        <description>DMA base address</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>6</bitWidth>
                    </field>
                    <field>
                        <name>DBLEN</name>
                        <description>DMA burst length</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>6</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>TIM_DADDR</name>
                <displayName>TIM_DADDR</displayName>
                <description>TIM DMA Address Register</description>
                <addressOffset>0x98</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>BURST</name>
                        <description>DMA access buffer</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>32</bitWidth>
                    </field>
                </fields>
            </register>
