Nsing-Community/Nsing-Pack/Nations_Device_PACK_Add_To_IAR_Tool/Nations Device PACK/debugger/Nsing/N32G41x/N32G41x.svd
        </registers>
    </peripheral>
    <peripheral derivedFrom="GTIM3">
        <name>GTIM4</name>
        <baseAddress>0x40000C00</baseAddress>
        <interrupt>
            <name>GTIM4</name>
            <description>GTIM4 global interrupt</description>
            <value>42</value>
        </interrupt>
    </peripheral>
    <peripheral>
        <name>GTIM2</name>
        <description>General-purpose Timer 2</description>
        <groupName>GTIM</groupName>
        <baseAddress>0x40000400</baseAddress>
        <addressBlock>
            <offset>0x0</offset>
            <size>0x400</size>
            <usage>registers</usage>
        </addressBlock>
        <interrupt>
            <name>GTIM2</name>
            <description>GTIM2 global interrupt</description>
            <value>29</value>
        </interrupt>
        <registers>
            <register>
                <name>TIM_CTRL1</name>
                <displayName>TIM_CTRL1</displayName>
                <description>TIM Control Register 1</description>
                <addressOffset>0x00</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>TRGLDCNTEN</name>
                        <description>TRGI event trigger counter load LVR enable</description>
                        <bitOffset>31</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>CLRSEL</name>
                        <description>OCxRef selection</description>
                        <bitOffset>13</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>ARPEN</name>
                        <description>Auto-reload preload enable</description>
                        <bitOffset>9</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>ONEPM</name>
                        <description>One pulse mode</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>UPDIS</name>
                        <description>Update disable</description>
                        <bitOffset>5</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>UPRS</name>
                        <description>Update request source</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>CAMSEL</name>
                        <description>Center-aligned mode selection</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>2</bitWidth>
                    </field>
                    <field>
                        <name>DIR</name>
                        <description>Direction</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>CNTEN</name>
                        <description>Counter enable</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>TIM_CTRL2</name>
                <displayName>TIM_CTRL2</displayName>
                <description>TIM Control Register 2</description>
                <addressOffset>0x04</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>TI1SEL</name>
                        <description>TI1 selection</description>
                        <bitOffset>19</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>CCDSEL</name>
                        <description>Capture/compare DMA selection</description>
                        <bitOffset>17</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>MMSEL</name>
                        <description>Master mode selection</description>
                        <bitOffset>12</bitOffset>
                        <bitWidth>4</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>TIM_STS</name>
                <displayName>TIM_STS</displayName>
                <description>TIM Status Register</description>
                <addressOffset>0x08</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>TITF</name>
                        <description>Trigger interrupt flag</description>
                        <bitOffset>18</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>UDITF</name>
                        <description>Update interrupt flag</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>CC4OCF</name>
                        <description>Capture/Compare 4 overcapture flag</description>
                        <bitOffset>11</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>CC3OCF</name>
                        <description>Capture/Compare 3 overcapture flag</description>
                        <bitOffset>10</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>CC2OCF</name>
                        <description>Capture/Compare 2 overcapture flag</description>
                        <bitOffset>9</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>CC1OCF</name>
                        <description>Capture/Compare 1 overcapture flag</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>C3LDCNTITF</name>
                        <description>TI3 event load LVR interrupt flag</description>
                        <bitOffset>7</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>CC4ITF</name>
                        <description>Capture/Compare 4 interrupt flag</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>CC3ITF</name>
                        <description>Capture/Compare 3 interrupt flag</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>CC2ITF</name>
                        <description>Capture/Compare 2 interrupt flag</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>CC1ITF</name>
                        <description>Capture/Compare 1 interrupt flag</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>TIM_EVTGEN</name>
                <displayName>TIM_EVTGEN</displayName>
                <description>TIM Event Generation Register</description>
                <addressOffset>0x0C</addressOffset>
                <size>0x20</size>
                <access>write-only</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>TGN</name>
                        <description>Trigger generation</description>
                        <bitOffset>10</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>UDGN</name>
                        <description>Update generation</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>CC4GN</name>
                        <description>Capture/Compare 4 generation</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>CC3GN</name>
                        <description>Capture/Compare 3 generation</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>CC2GN</name>
                        <description>Capture/Compare 2 generation</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>CC1GN</name>
                        <description>Capture/Compare 1 generation</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>TIM_SMCTRL</name>
                <displayName>TIM_SMCTRL</displayName>
                <description>TIM Slave Mode Control Register</description>
                <addressOffset>0x10</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>MSMD</name>
                        <description>Master/slave mode</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>EXTF</name>
                        <description>External trigger filter</description>
                        <bitOffset>12</bitOffset>
                        <bitWidth>4</bitWidth>
                    </field>
                    <field>
                        <name>EXTP</name>
                        <description>External trigger polarity</description>
                        <bitOffset>11</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>EXCEN</name>
                        <description>External clock enable</description>
                        <bitOffset>10</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>EXTPS</name>
                        <description>External trigger prescaler</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>2</bitWidth>
                    </field>
                    <field>
                        <name>SMSEL</name>
                        <description>Slave mode selection</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>4</bitWidth>
                    </field>
                    <field>
                        <name>TSEL</name>
                        <description>Trigger selection</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>3</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>TIM_DINTEN</name>
                <displayName>TIM_DINTEN</displayName>
                <description>TIM DMA/Interrupt Enable Register</description>
                <addressOffset>0x14</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>TDEN</name>
                        <description>Trigger DMA request enable</description>
                        <bitOffset>21</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>UDEN</name>
                        <description>Update DMA request enable</description>
                        <bitOffset>19</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>TIEN</name>
                        <description>Trigger interrupt enable</description>
                        <bitOffset>17</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>UIEN</name>
                        <description>Update interrupt enable</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>CC4DEN</name>
                        <description>Capture/Compare 4 DMA request enable</description>
                        <bitOffset>11</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>CC3DEN</name>
                        <description>Capture/Compare 3 DMA request enable</description>
                        <bitOffset>10</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>CC2DEN</name>
                        <description>Capture/Compare 2 DMA request enable</description>
                        <bitOffset>9</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>CC1DEN</name>
                        <description>Capture/Compare 1 DMA request enable</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>C3LDCNTIEN</name>
                        <description>TI3 event load LVR interrupt enable</description>
                        <bitOffset>7</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>CC4IEN</name>
                        <description>Capture/Compare 4 interrupt enable</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>CC3IEN</name>
                        <description>Capture/Compare 3 interrupt enable</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>CC2IEN</name>
                        <description>Capture/Compare 2 interrupt enable</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>CC1IEN</name>
                        <description>Capture/Compare 1 interrupt enable</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>TIM_CCMOD1_Output</name>
                <displayName>TIM_CCMOD1_Output</displayName>
                <description>TIM Capture/Compare Mode Register 1 Output</description>
                <addressOffset>0x18</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>OC2MD3</name>
                        <description>Output compare 2 mode bit3</description>
                        <bitOffset>17</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>OC1MD3</name>
                        <description>Output compare 1 mode bit3</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>OC2MD</name>
                        <description>Output compare 2 mode</description>
                        <bitOffset>13</bitOffset>
                        <bitWidth>3</bitWidth>
                    </field>
                    <field>
                        <name>OC2CEN</name>
                        <description>OC2 clear enable</description>
                        <bitOffset>12</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>OC2FEN</name>
                        <description>OC2 fast enable</description>
                        <bitOffset>11</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>OC2PEN</name>
                        <description>OC2 preload enable</description>
                        <bitOffset>10</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>CC2SEL</name>
                        <description>Capture/Compare 2 selection</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>2</bitWidth>
                    </field>
                    <field>
                        <name>OC1MD</name>
                        <description>Output compare 1 mode</description>
                        <bitOffset>5</bitOffset>
                        <bitWidth>3</bitWidth>
                    </field>
                    <field>
                        <name>OC1CEN</name>
                        <description>OC1 clear enable</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>OC1FEN</name>
                        <description>OC1 fast enable</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>OC1PEN</name>
                        <description>OC1 preload enable</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>CC1SEL</name>
                        <description>Capture/Compare 1 selection</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>2</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>TIM_CCMOD1_Input</name>
                <displayName>TIM_CCMOD1_Input</displayName>
                <description>TIM Capture/Compare Mode Register 1 Input</description>
                <alternateRegister>TIM_CCMOD1_Output</alternateRegister>
                <addressOffset>0x18</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>IC2F</name>
                        <description>Input capture 2 filter</description>
                        <bitOffset>12</bitOffset>
                        <bitWidth>4</bitWidth>
                    </field>
                    <field>
                        <name>IC2PSC</name>
                        <description>Input capture 2 prescaler</description>
                        <bitOffset>10</bitOffset>
                        <bitWidth>2</bitWidth>
                    </field>
                    <field>
                        <name>CC2SEL</name>
                        <description>Capture/Compare 2 selection</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>2</bitWidth>
                    </field>
                    <field>
                        <name>IC1F</name>
                        <description>Input capture 1 filter</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>4</bitWidth>
                    </field>
                    <field>
                        <name>IC1PSC</name>
                        <description>Input capture 1 prescaler</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>2</bitWidth>
                    </field>
                    <field>
                        <name>CC1SEL</name>
                        <description>Capture/Compare 1 selection</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>2</bitWidth>
                    </field>
                </fields>
            </register>
