Nsing-Community/Nsing-Pack/Nations_Device_PACK_Add_To_IAR_Tool/Nations Device PACK/debugger/Nsing/N32G41x/N32G41x.svd
            <register>
                <name>TIM_CCMOD1_Output</name>
                <displayName>TIM_CCMOD1_Output</displayName>
                <description>TIM Capture/Compare Mode Register 1 Output</description>
                <addressOffset>0x18</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>OC2MD3</name>
                        <description>Output compare 2 mode bit3</description>
                        <bitOffset>17</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>OC1MD3</name>
                        <description>Output compare 1 mode bit3</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>OC2MD</name>
                        <description>Output compare 2 mode</description>
                        <bitOffset>13</bitOffset>
                        <bitWidth>3</bitWidth>
                    </field>
                    <field>
                        <name>OC2CEN</name>
                        <description>OC2 clear enable</description>
                        <bitOffset>12</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>OC2FEN</name>
                        <description>OC2 fast enable</description>
                        <bitOffset>11</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>OC2PEN</name>
                        <description>OC2 preload enable</description>
                        <bitOffset>10</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>CC2SEL</name>
                        <description>Capture/Compare 2 selection</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>2</bitWidth>
                    </field>
                    <field>
                        <name>OC1MD</name>
                        <description>Output compare 1 mode</description>
                        <bitOffset>5</bitOffset>
                        <bitWidth>3</bitWidth>
                    </field>
                    <field>
                        <name>OC1CEN</name>
                        <description>OC1 clear enable</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>OC1FEN</name>
                        <description>OC1 fast enable</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>OC1PEN</name>
                        <description>OC1 preload enable</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>CC1SEL</name>
                        <description>Capture/Compare 1 selection</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>2</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>TIM_CCMOD1_Input</name>
                <displayName>TIM_CCMOD1_Input</displayName>
                <description>TIM Capture/Compare Mode Register 1 Input</description>
                <alternateRegister>TIM_CCMOD1_Output</alternateRegister>
                <addressOffset>0x18</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>IC2F</name>
                        <description>Input capture 2 filter</description>
                        <bitOffset>12</bitOffset>
                        <bitWidth>4</bitWidth>
                    </field>
                    <field>
                        <name>IC2PSC</name>
                        <description>Input capture 2 prescaler</description>
                        <bitOffset>10</bitOffset>
                        <bitWidth>2</bitWidth>
                    </field>
                    <field>
                        <name>CC2SEL</name>
                        <description>Capture/Compare 2 selection</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>2</bitWidth>
                    </field>
                    <field>
                        <name>IC1F</name>
                        <description>Input capture 1 filter</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>4</bitWidth>
                    </field>
                    <field>
                        <name>IC1PSC</name>
                        <description>Input capture 1 prescaler</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>2</bitWidth>
                    </field>
                    <field>
                        <name>CC1SEL</name>
                        <description>Capture/Compare 1 selection</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>2</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>TIM_CCMOD2_Output</name>
                <displayName>TIM_CCMOD2_Output</displayName>
                <description>TIM Capture/Compare Mode Register 2 Output</description>
                <addressOffset>0x1C</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>OC4MD3</name>
                        <description>Output compare 4 mode bit3</description>
                        <bitOffset>17</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>OC3MD3</name>
                        <description>Output compare 3 mode bit3</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>OC4MD</name>
                        <description>Output compare 4 mode</description>
                        <bitOffset>13</bitOffset>
                        <bitWidth>3</bitWidth>
                    </field>
                    <field>
                        <name>OC4CEN</name>
                        <description>OC4 clear enable</description>
                        <bitOffset>12</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>OC4FEN</name>
                        <description>OC4 fast enable</description>
                        <bitOffset>11</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>OC4PEN</name>
                        <description>OC4 preload enable</description>
                        <bitOffset>10</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>CC4SEL</name>
                        <description>Capture/Compare 4 selection</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>2</bitWidth>
                    </field>
                    <field>
                        <name>OC3MD</name>
                        <description>Output compare 3 mode</description>
                        <bitOffset>5</bitOffset>
                        <bitWidth>3</bitWidth>
                    </field>
                    <field>
                        <name>OC3CEN</name>
                        <description>OC3 clear enable</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>OC3FEN</name>
                        <description>OC3 fast enable</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>OC3PEN</name>
                        <description>OC3 preload enable</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>CC3SEL</name>
                        <description>Capture/Compare 3 selection</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>2</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>TIM_CCMOD2_Input</name>
                <displayName>TIM_CCMOD2_Input</displayName>
                <description>TIM Capture/Compare Mode Register 2 Input</description>
                <alternateRegister>TIM_CCMOD2_Output</alternateRegister>
                <addressOffset>0x1C</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>IC4F</name>
                        <description>Input capture 4 filter</description>
                        <bitOffset>12</bitOffset>
                        <bitWidth>4</bitWidth>
                    </field>
                    <field>
                        <name>IC4PSC</name>
                        <description>Input capture 4 prescaler</description>
                        <bitOffset>10</bitOffset>
                        <bitWidth>2</bitWidth>
                    </field>
                    <field>
                        <name>CC4SEL</name>
                        <description>Capture/Compare 4 selection</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>2</bitWidth>
                    </field>
                    <field>
                        <name>IC3F</name>
                        <description>Input capture 3 filter</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>4</bitWidth>
                    </field>
                    <field>
                        <name>IC3PSC</name>
                        <description>Input capture 3 prescaler</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>2</bitWidth>
                    </field>
                    <field>
                        <name>CC3SEL</name>
                        <description>Capture/Compare 3 selection</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>2</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>TIM_CCEN</name>
                <displayName>TIM_CCEN</displayName>
                <description>TIM Capture/Compare Enable Register</description>
                <addressOffset>0x24</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>CC4P</name>
                        <description>Capture/Compare 4 output polarity</description>
                        <bitOffset>15</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>CC4EN</name>
                        <description>Capture/Compare 4 output enable</description>
                        <bitOffset>14</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>CC3P</name>
                        <description>Capture/Compare 3 output polarity</description>
                        <bitOffset>11</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>CC3EN</name>
                        <description>Capture/Compare 3 output enable</description>
                        <bitOffset>10</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>CC2P</name>
                        <description>Capture/Compare 2 output polarity</description>
                        <bitOffset>7</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>CC2EN</name>
                        <description>Capture/Compare 2 output enable</description>
                        <bitOffset>6</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>CC1P</name>
                        <description>Capture/Compare 1 output polarity</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>CC1EN</name>
                        <description>Capture/Compare 1 output enable</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>TIM_CCDAT1</name>
                <displayName>TIM_CCDAT1</displayName>
                <description>TIM Capture/Compare Register 1</description>
                <addressOffset>0x28</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>CCDAT1</name>
                        <description>Capture/Compare value</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>32</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>TIM_CCDAT2</name>
                <displayName>TIM_CCDAT2</displayName>
                <description>TIM Capture/Compare Register 2</description>
                <addressOffset>0x2C</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>CCDAT2</name>
                        <description>Capture/Compare value</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>32</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>TIM_CCDAT3</name>
                <displayName>TIM_CCDAT3</displayName>
                <description>TIM Capture/Compare Register 3</description>
                <addressOffset>0x30</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>CCDAT3</name>
                        <description>Capture/Compare value</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>32</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>TIM_CCDAT4</name>
                <displayName>TIM_CCDAT4</displayName>
                <description>TIM Capture/Compare Register 4</description>
                <addressOffset>0x34</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>CCDAT4</name>
                        <description>Capture/Compare value</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>32</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>TIM_PSC</name>
                <displayName>TIM_PSC</displayName>
                <description>TIM Prescaler Register</description>
                <addressOffset>0x40</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>PSC</name>
                        <description>Prescaler value</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>16</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>TIM_AR</name>
                <displayName>TIM_AR</displayName>
                <description>TIM Auto-Reload Register</description>
                <addressOffset>0x44</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0xFFFFFFFF</resetValue>
                <fields>
                    <field>
                        <name>AR</name>
                        <description>Auto-reload value</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>32</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>TIM_CNT</name>
                <displayName>TIM_CNT</displayName>
                <description>TIM Counter Register</description>
                <addressOffset>0x48</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>CNT</name>
                        <description>Counter value</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>32</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>TIM_C1FILT</name>
                <displayName>TIM_C1FILT</displayName>
                <description>TIM Channel 1 Filter Register</description>
                <addressOffset>0x64</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>THRESH</name>
                        <description>Threshold</description>
                        <bitOffset>24</bitOffset>
                        <bitWidth>6</bitWidth>
                    </field>
                    <field>
                        <name>WSIZE</name>
                        <description>Window size</description>
                        <bitOffset>17</bitOffset>
                        <bitWidth>6</bitWidth>
                    </field>
                    <field>
                        <name>FILTEN</name>
                        <description>Filter enable</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>TIM_C2FILT</name>
                <displayName>TIM_C2FILT</displayName>
                <description>TIM Channel 2 Filter Register</description>
                <addressOffset>0x68</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>THRESH</name>
                        <description>Threshold</description>
                        <bitOffset>24</bitOffset>
                        <bitWidth>6</bitWidth>
                    </field>
                    <field>
                        <name>WSIZE</name>
                        <description>Window size</description>
                        <bitOffset>17</bitOffset>
                        <bitWidth>6</bitWidth>
                    </field>
                    <field>
                        <name>FILTEN</name>
                        <description>Filter enable</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>TIM_C3FILT</name>
                <displayName>TIM_C3FILT</displayName>
                <description>TIM Channel 3 Filter Register</description>
                <addressOffset>0x6C</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>THRESH</name>
                        <description>Threshold</description>
                        <bitOffset>24</bitOffset>
                        <bitWidth>6</bitWidth>
                    </field>
                    <field>
                        <name>WSIZE</name>
                        <description>Window size</description>
                        <bitOffset>17</bitOffset>
                        <bitWidth>6</bitWidth>
                    </field>
                    <field>
                        <name>FILTEN</name>
                        <description>Filter enable</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                </fields>
            </register>
