Nsing-Community/Nsing-Pack/Nations_Device_PACK_Add_To_IAR_Tool/Nations Device PACK/debugger/Nsing/N32G41x/N32G41x.svd
            <register>
                <name>TIM_C4FILT</name>
                <displayName>TIM_C4FILT</displayName>
                <description>TIM Channel 4 Filter Register</description>
                <addressOffset>0x70</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>THRESH</name>
                        <description>Threshold</description>
                        <bitOffset>24</bitOffset>
                        <bitWidth>6</bitWidth>
                    </field>
                    <field>
                        <name>WSIZE</name>
                        <description>Window size</description>
                        <bitOffset>17</bitOffset>
                        <bitWidth>6</bitWidth>
                    </field>
                    <field>
                        <name>FILTEN</name>
                        <description>Filter enable</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>TIM_FILTO</name>
                <displayName>TIM_FILTO</displayName>
                <description>TIM Filter Output Register</description>
                <addressOffset>0x74</addressOffset>
                <size>0x20</size>
                <access>read-only</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>C4FILTO</name>
                        <description>Channel 4 filter output status</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>C3FILTO</name>
                        <description>Channel 3 filter output status</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>C2FILTO</name>
                        <description>Channel 2 filter output status</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>C1FILTO</name>
                        <description>Channel 1 filter output status</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>TIM_INSEL</name>
                <displayName>TIM_INSEL</displayName>
                <description>TIM Input Selection Register</description>
                <addressOffset>0x78</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>CLRS</name>
                        <description>Select tim_ocref_clr input</description>
                        <bitOffset>24</bitOffset>
                        <bitWidth>4</bitWidth>
                    </field>
                    <field>
                        <name>ITRS</name>
                        <description>Select tim_itr input</description>
                        <bitOffset>20</bitOffset>
                        <bitWidth>4</bitWidth>
                    </field>
                    <field>
                        <name>ETRS</name>
                        <description>Select tim_etr input</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>4</bitWidth>
                    </field>
                    <field>
                        <name>TI4S</name>
                        <description>Select tim_ti4 input</description>
                        <bitOffset>12</bitOffset>
                        <bitWidth>4</bitWidth>
                    </field>
                    <field>
                        <name>TI3S</name>
                        <description>Select tim_ti3 input</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>4</bitWidth>
                    </field>
                    <field>
                        <name>TI2S</name>
                        <description>Select tim_ti2 input</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>4</bitWidth>
                    </field>
                    <field>
                        <name>TI1S</name>
                        <description>Select tim_ti1 input</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>4</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>TIM_ENCDAT</name>
                <displayName>TIM_ENCDAT</displayName>
                <description>TIM Encoder Capture Data Register</description>
                <addressOffset>0x88</addressOffset>
                <size>0x20</size>
                <access>read-only</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>ENCDAT</name>
                        <description>Encoder capture data</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>32</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>TIM_ENCMCTRL</name>
                <displayName>TIM_ENCMCTRL</displayName>
                <description>TIM Encoder Mode Control Register</description>
                <addressOffset>0x8C</addressOffset>
                <size>0x20</size>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>ENCDATS</name>
                        <description>Encoder capture data sign</description>
                        <bitOffset>31</bitOffset>
                        <bitWidth>1</bitWidth>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>ENCMD</name>
                        <description>Encoder mode selection</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>4</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>C3LDCNTSEL</name>
                        <description>TI3 event selection</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>2</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>C3LDCNTEN</name>
                        <description>TI3 event load LVR enable</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>TIM_ENCLVR</name>
                <displayName>TIM_ENCLVR</displayName>
                <description>TIM Encoder Load Value Register</description>
                <addressOffset>0x90</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>LVR</name>
                        <description>TI3 load value</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>32</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>TIM_DCTRL</name>
                <displayName>TIM_DCTRL</displayName>
                <description>TIM DMA Control Register</description>
                <addressOffset>0x94</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>DBADDR</name>
                        <description>DMA base address</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>6</bitWidth>
                    </field>
                    <field>
                        <name>DBLEN</name>
                        <description>DMA burst length</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>6</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>TIM_DADDR</name>
                <displayName>TIM_DADDR</displayName>
                <description>TIM DMA Address Register</description>
                <addressOffset>0x98</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>BURST</name>
                        <description>DMA access buffer</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>32</bitWidth>
                    </field>
                </fields>
            </register>
