Nsing-Community/Nsing-Pack/Nations_Device_PACK_Add_To_IAR_Tool/Nations Device PACK/debugger/Nsing/N32G41x/N32G41x.svd
            <register>
                <name>TIM_DINTEN</name>
                <displayName>TIM_DINTEN</displayName>
                <description>TIM DMA/Interrupt Enable Register</description>
                <addressOffset>0x14</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>CC9IEN</name>
                        <description>Capture/Compare 9 interrupt enable</description>
                        <bitOffset>23</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>COMIEN</name>
                        <description>COM interrupt enable</description>
                        <bitOffset>22</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>TDEN</name>
                        <description>Trigger DMA request enable</description>
                        <bitOffset>21</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>COMDEN</name>
                        <description>COM DMA request enable</description>
                        <bitOffset>20</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>UDEN</name>
                        <description>Update DMA request enable</description>
                        <bitOffset>19</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>BIEN</name>
                        <description>Break interrupt enable</description>
                        <bitOffset>18</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>TIEN</name>
                        <description>Trigger interrupt enable</description>
                        <bitOffset>17</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>UIEN</name>
                        <description>Update interrupt enable</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>CC4DEN</name>
                        <description>Capture/Compare 4 DMA request enable</description>
                        <bitOffset>11</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>CC3DEN</name>
                        <description>Capture/Compare 3 DMA request enable</description>
                        <bitOffset>10</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>CC2DEN</name>
                        <description>Capture/Compare 2 DMA request enable</description>
                        <bitOffset>9</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>CC1DEN</name>
                        <description>Capture/Compare 1 DMA request enable</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>CC8IEN</name>
                        <description>Capture/Compare 8 interrupt enable</description>
                        <bitOffset>7</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>CC7IEN</name>
                        <description>Capture/Compare 7 interrupt enable</description>
                        <bitOffset>6</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>CC6IEN</name>
                        <description>Capture/Compare 6 interrupt enable</description>
                        <bitOffset>5</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>CC5IEN</name>
                        <description>Capture/Compare 5 interrupt enable</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>CC4IEN</name>
                        <description>Capture/Compare 4 interrupt enable</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>CC3IEN</name>
                        <description>Capture/Compare 3 interrupt enable</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>CC2IEN</name>
                        <description>Capture/Compare 2 interrupt enable</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>CC1IEN</name>
                        <description>Capture/Compare 1 interrupt enable</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>TIM_CCMOD1_Output</name>
                <displayName>TIM_CCMOD1_Output</displayName>
                <description>TIM Capture/Compare Mode Register 1 Output</description>
                <addressOffset>0x18</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>OC2MD3</name>
                        <description>Output compare 2 mode bit3</description>
                        <bitOffset>17</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>OC1MD3</name>
                        <description>Output compare 1 mode bit3</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>OC2MD</name>
                        <description>Output compare 2 mode</description>
                        <bitOffset>13</bitOffset>
                        <bitWidth>3</bitWidth>
                    </field>
                    <field>
                        <name>OC2CEN</name>
                        <description>OC2 clear enable</description>
                        <bitOffset>12</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>OC2FEN</name>
                        <description>OC2 fast enable</description>
                        <bitOffset>11</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>OC2PEN</name>
                        <description>OC2 preload enable</description>
                        <bitOffset>10</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>CC2SEL</name>
                        <description>Capture/Compare 2 selection</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>2</bitWidth>
                    </field>
                    <field>
                        <name>OC1MD</name>
                        <description>Output compare 1 mode</description>
                        <bitOffset>5</bitOffset>
                        <bitWidth>3</bitWidth>
                    </field>
                    <field>
                        <name>OC1CEN</name>
                        <description>OC1 clear enable</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>OC1FEN</name>
                        <description>OC1 fast enable</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>OC1PEN</name>
                        <description>OC1 preload enable</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>CC1SEL</name>
                        <description>Capture/Compare 1 selection</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>2</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>TIM_CCMOD1_Input</name>
                <displayName>TIM_CCMOD1_Input</displayName>
                <description>TIM Capture/Compare Mode Register 1 Input</description>
                <alternateRegister>TIM_CCMOD1_Output</alternateRegister>
                <addressOffset>0x18</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>IC2F</name>
                        <description>Input capture 2 filter</description>
                        <bitOffset>12</bitOffset>
                        <bitWidth>4</bitWidth>
                    </field>
                    <field>
                        <name>IC2PSC</name>
                        <description>Input capture 2 prescaler</description>
                        <bitOffset>10</bitOffset>
                        <bitWidth>2</bitWidth>
                    </field>
                    <field>
                        <name>CC2SEL</name>
                        <description>Capture/Compare 2 selection</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>2</bitWidth>
                    </field>
                    <field>
                        <name>IC1F</name>
                        <description>Input capture 1 filter</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>4</bitWidth>
                    </field>
                    <field>
                        <name>IC1PSC</name>
                        <description>Input capture 1 prescaler</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>2</bitWidth>
                    </field>
                    <field>
                        <name>CC1SEL</name>
                        <description>Capture/Compare 1 selection</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>2</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>TIM_CCMOD2_Output</name>
                <displayName>TIM_CCMOD2_Output</displayName>
                <description>TIM Capture/Compare Mode Register 2 Output</description>
                <addressOffset>0x1C</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>OC4MD3</name>
                        <description>Output compare 4 mode bit3</description>
                        <bitOffset>17</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>OC3MD3</name>
                        <description>Output compare 3 mode bit3</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>OC4MD</name>
                        <description>Output compare 4 mode</description>
                        <bitOffset>13</bitOffset>
                        <bitWidth>3</bitWidth>
                    </field>
                    <field>
                        <name>OC4CEN</name>
                        <description>OC4 clear enable</description>
                        <bitOffset>12</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>OC4FEN</name>
                        <description>OC4 fast enable</description>
                        <bitOffset>11</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>OC4PEN</name>
                        <description>OC4 preload enable</description>
                        <bitOffset>10</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>CC4SEL</name>
                        <description>Capture/Compare 4 selection</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>2</bitWidth>
                    </field>
                    <field>
                        <name>OC3MD</name>
                        <description>Output compare 3 mode</description>
                        <bitOffset>5</bitOffset>
                        <bitWidth>3</bitWidth>
                    </field>
                    <field>
                        <name>OC3CEN</name>
                        <description>OC3 clear enable</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>OC3FEN</name>
                        <description>OC3 fast enable</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>OC3PEN</name>
                        <description>OC3 preload enable</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>CC3SEL</name>
                        <description>Capture/Compare 3 selection</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>2</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>TIM_CCMOD2_Input</name>
                <displayName>TIM_CCMOD2_Input</displayName>
                <description>TIM Capture/Compare Mode Register 2 Input</description>
                <alternateRegister>TIM_CCMOD2_Output</alternateRegister>
                <addressOffset>0x1C</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>IC4F</name>
                        <description>Input capture 4 filter</description>
                        <bitOffset>12</bitOffset>
                        <bitWidth>4</bitWidth>
                    </field>
                    <field>
                        <name>IC4PSC</name>
                        <description>Input capture 4 prescaler</description>
                        <bitOffset>10</bitOffset>
                        <bitWidth>2</bitWidth>
                    </field>
                    <field>
                        <name>CC4SEL</name>
                        <description>Capture/Compare 4 selection</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>2</bitWidth>
                    </field>
                    <field>
                        <name>IC3F</name>
                        <description>Input capture 3 filter</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>4</bitWidth>
                    </field>
                    <field>
                        <name>IC3PSC</name>
                        <description>Input capture 3 prescaler</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>2</bitWidth>
                    </field>
                    <field>
                        <name>CC3SEL</name>
                        <description>Capture/Compare 3 selection</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>2</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>TIM_CCMOD3</name>
                <displayName>TIM_CCMOD3</displayName>
                <description>TIM Capture/Compare Mode Register 3</description>
                <addressOffset>0x20</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x0000</resetValue>
                <fields>
                    <field>
                        <name>OC9PEN</name>
                        <description>Output compare 9 preload enable</description>
                        <bitOffset>24</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>OC8PEN</name>
                        <description>Output compare 8 preload enable</description>
                        <bitOffset>20</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>OC7PEN</name>
                        <description>Output compare 7 preload enable</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>OC6MD</name>
                        <description>Output compare 6 mode</description>
                        <bitOffset>13</bitOffset>
                        <bitWidth>3</bitWidth>
                    </field>
                    <field>
                        <name>OC6CEN</name>
                        <description>OC6 clear enable</description>
                        <bitOffset>12</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>OC6FEN</name>
                        <description>OC6 fast enable</description>
                        <bitOffset>11</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>OC6PEN</name>
                        <description>OC6 preload enable</description>
                        <bitOffset>10</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>OC5MD</name>
                        <description>Output compare 5 mode</description>
                        <bitOffset>5</bitOffset>
                        <bitWidth>3</bitWidth>
                    </field>
                    <field>
                        <name>OC5CEN</name>
                        <description>OC5 clear enable</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>OC5FEN</name>
                        <description>OC5 fast enable</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>OC5PEN</name>
                        <description>OC5 preload enable</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                </fields>
            </register>
