Nsing-Community/Nsing-Pack/Nations_Device_PACK_Add_To_IAR_Tool/Nations Device PACK/debugger/Nsing/N32G41x/N32G41x.svd
            <register>
                <name>TIM_CCEN</name>
                <displayName>TIM_CCEN</displayName>
                <description>TIM Capture/Compare Enable Register</description>
                <addressOffset>0x24</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>CC6P</name>
                        <description>Capture/Compare 6 output polarity</description>
                        <bitOffset>23</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>CC6EN</name>
                        <description>Capture/Compare 6 output enable</description>
                        <bitOffset>22</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>CC5P</name>
                        <description>Capture/Compare 5 output polarity</description>
                        <bitOffset>19</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>CC5EN</name>
                        <description>Capture/Compare 5 output enable</description>
                        <bitOffset>18</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>CC4P</name>
                        <description>Capture/Compare 4 output polarity</description>
                        <bitOffset>15</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>CC4EN</name>
                        <description>Capture/Compare 4 output enable</description>
                        <bitOffset>14</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>CC4NP</name>
                        <description>Capture/Compare 4 complementary output polarity</description>
                        <bitOffset>13</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>CC4NEN</name>
                        <description>Capture/Compare 4 complementary output enable</description>
                        <bitOffset>12</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>CC3P</name>
                        <description>Capture/Compare 3 output polarity</description>
                        <bitOffset>11</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>CC3EN</name>
                        <description>Capture/Compare 3 output enable</description>
                        <bitOffset>10</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>CC3NP</name>
                        <description>Capture/Compare 3 complementary output polarity</description>
                        <bitOffset>9</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>CC3NEN</name>
                        <description>Capture/Compare 3 complementary output enable</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>CC2P</name>
                        <description>Capture/Compare 2 output polarity</description>
                        <bitOffset>7</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>CC2EN</name>
                        <description>Capture/Compare 2 output enable</description>
                        <bitOffset>6</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>CC2NP</name>
                        <description>Capture/Compare 2 complementary output polarity</description>
                        <bitOffset>5</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>CC2NEN</name>
                        <description>Capture/Compare 2 complementary output enable</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>CC1P</name>
                        <description>Capture/Compare 1 output polarity</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>CC1EN</name>
                        <description>Capture/Compare 1 output enable</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>CC1NP</name>
                        <description>Capture/Compare 1 complementary output polarity</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>CC1NEN</name>
                        <description>Capture/Compare 1 complementary output enable</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>TIM_CCDAT1</name>
                <displayName>TIM_CCDAT1</displayName>
                <description>TIM Capture/Compare Register 1</description>
                <addressOffset>0x28</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>CCDDAT1</name>
                        <description>Capture/Compare down-counting value</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>16</bitWidth>
                    </field>
                    <field>
                        <name>CCDAT1</name>
                        <description>Capture/Compare value</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>16</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>TIM_CCDAT2</name>
                <displayName>TIM_CCDAT2</displayName>
                <description>TIM Capture/Compare Register 2</description>
                <addressOffset>0x2C</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>CCDDAT2</name>
                        <description>Capture/Compare down-counting value</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>16</bitWidth>
                    </field>
                    <field>
                        <name>CCDAT2</name>
                        <description>Capture/Compare value</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>16</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>TIM_CCDAT3</name>
                <displayName>TIM_CCDAT3</displayName>
                <description>TIM Capture/Compare Register 3</description>
                <addressOffset>0x30</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>CCDDAT3</name>
                        <description>Capture/Compare down-counting value</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>16</bitWidth>
                    </field>
                    <field>
                        <name>CCDAT3</name>
                        <description>Capture/Compare value</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>16</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>TIM_CCDAT4</name>
                <displayName>TIM_CCDAT4</displayName>
                <description>TIM Capture/Compare Register 4</description>
                <addressOffset>0x34</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>CCDDAT4</name>
                        <description>Capture/Compare down-counting value</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>16</bitWidth>
                    </field>
                    <field>
                        <name>CCDAT4</name>
                        <description>Capture/Compare value</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>16</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>TIM_CCDAT5</name>
                <displayName>TIM_CCDAT5</displayName>
                <description>TIM Capture/Compare Register 5</description>
                <addressOffset>0x38</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>CCDAT5</name>
                        <description>Capture/Compare value</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>16</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>TIM_CCDAT6</name>
                <displayName>TIM_CCDAT6</displayName>
                <description>TIM Capture/Compare Register 6</description>
                <addressOffset>0x3C</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>CCDAT6</name>
                        <description>Capture/Compare value</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>16</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>TIM_PSC</name>
                <displayName>TIM_PSC</displayName>
                <description>TIM Prescaler Register</description>
                <addressOffset>0x40</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>PSC</name>
                        <description>Prescaler value</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>16</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>TIM_AR</name>
                <displayName>TIM_AR</displayName>
                <description>TIM Auto-Reload Register</description>
                <addressOffset>0x44</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x0000FFFF</resetValue>
                <fields>
                    <field>
                        <name>AR</name>
                        <description>Auto-reload value</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>16</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>TIM_CNT</name>
                <displayName>TIM_CNT</displayName>
                <description>TIM Counter Register</description>
                <addressOffset>0x48</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>CNT</name>
                        <description>Counter value</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>16</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>TIM_REPCNT</name>
                <displayName>TIM_REPCNT</displayName>
                <description>TIM Repetition Counter Register</description>
                <addressOffset>0x4C</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>REPCNT</name>
                        <description>Repetition counter value</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>8</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>TIM_BKDT</name>
                <displayName>TIM_BKDT</displayName>
                <description>TIM Break and Dead-Time Register</description>
                <addressOffset>0x50</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>BRKBID</name>
                        <description>Break1 bidirectional enable</description>
                        <bitOffset>20</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>BRKDSRM</name>
                        <description>Break1 disarm</description>
                        <bitOffset>18</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>LCKCFG</name>
                        <description>Lock configuration</description>
                        <bitOffset>14</bitOffset>
                        <bitWidth>2</bitWidth>
                    </field>
                    <field>
                        <name>OSSR</name>
                        <description>Off-state selection for Run mode</description>
                        <bitOffset>13</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>OSSI</name>
                        <description>Off-state selection for Idle mode</description>
                        <bitOffset>12</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>BKEN</name>
                        <description>Break1 enable</description>
                        <bitOffset>11</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>BKP</name>
                        <description>Break1 polarity</description>
                        <bitOffset>10</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>AOEN</name>
                        <description>Automatic output enable</description>
                        <bitOffset>9</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>MOEN</name>
                        <description>Main output enable</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>DTGN</name>
                        <description>Dead-time generator setup</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>8</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>TIM_CCDAT7</name>
                <displayName>TIM_CCDAT7</displayName>
                <description>TIM Capture/Compare Register 7</description>
                <addressOffset>0x54</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>CCDAT7</name>
                        <description>Capture/Compare value</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>16</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>TIM_CCDAT8</name>
                <displayName>TIM_CCDAT8</displayName>
                <description>TIM Capture/Compare Register 8</description>
                <addressOffset>0x58</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>CCDAT8</name>
                        <description>Capture/Compare value</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>16</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>TIM_CCDAT9</name>
                <displayName>TIM_CCDAT9</displayName>
                <description>TIM Capture/Compare Register 9</description>
                <addressOffset>0x5C</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>CCDAT9</name>
                        <description>Capture/Compare value</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>16</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>TIM_BKFR</name>
                <displayName>TIM_BKFR</displayName>
                <description>TIM Break Filter Register</description>
                <addressOffset>0x60</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>THRESH</name>
                        <description>Threshold</description>
                        <bitOffset>24</bitOffset>
                        <bitWidth>6</bitWidth>
                    </field>
                    <field>
                        <name>WSIZE</name>
                        <description>Window size</description>
                        <bitOffset>17</bitOffset>
                        <bitWidth>6</bitWidth>
                    </field>
                    <field>
                        <name>FILTEN</name>
                        <description>Filter enable</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>TIM_INSEL</name>
                <displayName>TIM_INSEL</displayName>
                <description>TIM Input Selection Register</description>
                <addressOffset>0x78</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>CLRS</name>
                        <description>Select tim_ocref_clr input</description>
                        <bitOffset>24</bitOffset>
                        <bitWidth>4</bitWidth>
                    </field>
                    <field>
                        <name>ITRS</name>
                        <description>Select tim_itr input</description>
                        <bitOffset>20</bitOffset>
                        <bitWidth>4</bitWidth>
                    </field>
                    <field>
                        <name>ETRS</name>
                        <description>Select tim_etr input</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>4</bitWidth>
                    </field>
                    <field>
                        <name>TI4S</name>
                        <description>Select tim_ti4 input</description>
                        <bitOffset>12</bitOffset>
                        <bitWidth>4</bitWidth>
                    </field>
                    <field>
                        <name>TI3S</name>
                        <description>Select tim_ti3 input</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>4</bitWidth>
                    </field>
                    <field>
                        <name>TI2S</name>
                        <description>Select tim_ti2 input</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>4</bitWidth>
                    </field>
                    <field>
                        <name>TI1S</name>
                        <description>Select tim_ti1 input</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>4</bitWidth>
                    </field>
                </fields>
            </register>
