Nsing-Community/Nsing-Pack/Nations_Device_PACK_Add_To_IAR_Tool/Nations Device PACK/debugger/Nsing/N32G41x/N32G41x.svd
            <register>
                <name>TIM_AF1</name>
                <displayName>TIM_AF1</displayName>
                <description>TIM Alternate Function Register 1</description>
                <addressOffset>0x7C</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>IOM7BRKP</name>
                        <description>BKIN IO7 brake polarity</description>
                        <bitOffset>27</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>IOM7BRKEN</name>
                        <description>BKIN IO7 brake enable</description>
                        <bitOffset>26</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>IOM6BRKP</name>
                        <description>BKIN IO6 brake polarity</description>
                        <bitOffset>25</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>IOM6BRKEN</name>
                        <description>BKIN IO6 brake enable</description>
                        <bitOffset>24</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>IOM5BRKP</name>
                        <description>BKIN IO5 brake polarity</description>
                        <bitOffset>23</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>IOM5BRKEN</name>
                        <description>BKIN IO5 brake enable</description>
                        <bitOffset>22</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>IOM4BRKP</name>
                        <description>BKIN IO4 brake polarity</description>
                        <bitOffset>21</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>IOM3BRKP</name>
                        <description>BKIN IO3 brake polarity</description>
                        <bitOffset>20</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>IOM2BRKP</name>
                        <description>BKIN IO2 brake polarity</description>
                        <bitOffset>19</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>IOM4BRKEN</name>
                        <description>BKIN IO4 brake enable</description>
                        <bitOffset>18</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>IOM3BRKEN</name>
                        <description>BKIN IO3 brake enable</description>
                        <bitOffset>17</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>IOM2BRKEN</name>
                        <description>BKIN IO2 brake enable</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>COMP3BRKP</name>
                        <description>COMP3 brake polarity</description>
                        <bitOffset>12</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>COMP2BRKP</name>
                        <description>COMP2 brake polarity</description>
                        <bitOffset>11</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>COMP1BRKP</name>
                        <description>COMP1 brake polarity</description>
                        <bitOffset>10</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>IOMBRKP</name>
                        <description>BKIN brake polarity</description>
                        <bitOffset>9</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>COMP3BRKEN</name>
                        <description>COMP3 brake enable</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>COMP2BRKEN</name>
                        <description>COMP2 brake enable</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>COMP1BRKEN</name>
                        <description>COMP1 brake enable</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>IOMBRKEN</name>
                        <description>BKIN brake enable</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>TIM_DCTRL</name>
                <displayName>TIM_DCTRL</displayName>
                <description>TIM DMA Control Register</description>
                <addressOffset>0x94</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>DBADDR</name>
                        <description>DMA base address</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>6</bitWidth>
                    </field>
                    <field>
                        <name>DBLEN</name>
                        <description>DMA burst length</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>6</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>TIM_DADDR</name>
                <displayName>TIM_DADDR</displayName>
                <description>TIM DMA Address Register</description>
                <addressOffset>0x98</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>BURST</name>
                        <description>DMA access buffer</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>32</bitWidth>
                    </field>
                </fields>
            </register>
