Nsing-Community/Nsing-Pack/Nations_Device_PACK_Add_To_IAR_Tool/Nations Device PACK/debugger/Nsing/N32G41x/N32G41x.svd
        </registers>
    </peripheral>
    <peripheral derivedFrom="ATIM1">
        <name>ATIM2</name>
        <description>Advanced Timer 2</description>
        <baseAddress>0x40013400</baseAddress>
        <interrupt>
            <name>ATIM2_BRK</name>
            <description>ATIM2 break interrupt</description>
            <value>43</value>
        </interrupt>
        <interrupt>
            <name>ATIM2_UP</name>
            <description>ATIM2 update interrupt</description>
            <value>44</value>
        </interrupt>
        <interrupt>
            <name>ATIM2_TRG_COM</name>
            <description>ATIM2 trigger and commutation interrupt</description>
            <value>45</value>
        </interrupt>
        <interrupt>
            <name>ATIM2_CC</name>
            <description>ATIM2 capture compare interrupt</description>
            <value>46</value>
        </interrupt>
    </peripheral>
    <peripheral>
        <name>CRC</name>
        <description>CRC Calculation Unit</description>
        <groupName>CRC</groupName>
        <baseAddress>0x40023000</baseAddress>
        <addressBlock>
            <offset>0x0</offset>
            <size>0x400</size>
            <usage>registers</usage>
        </addressBlock>
        <registers>
            <register>
                <name>CRC_CRC32CTRL</name>
                <displayName>CRC_CRC32CTRL</displayName>
                <description>CRC32 Control Register</description>
                <addressOffset>0x00</addressOffset>
                <size>0x20</size>
                <access>write-only</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>RESET</name>
                        <description>CRC32 reset control</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>CRC_CRC32DAT</name>
                <displayName>CRC_CRC32DAT</displayName>
                <description>CRC32 Data Input Register</description>
                <addressOffset>0x04</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0xFFFFFFFF</resetValue>
                <fields>
                    <field>
                        <name>CRC32DAT</name>
                        <description>Data register (write: input, read: CRC result)</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>32</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>CRC_CRC32IDAT</name>
                <displayName>CRC_CRC32IDAT</displayName>
                <description>CRC32 Independent Data Register</description>
                <addressOffset>0x08</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>CRC32IDAT</name>
                        <description>General-purpose 8-bit data register</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>8</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>CRC_CRC32D</name>
                <displayName>CRC_CRC32D</displayName>
                <description>CRC32 Result Register</description>
                <addressOffset>0x0C</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0xFFFFFFFF</resetValue>
                <fields>
                    <field>
                        <name>CRC32D</name>
                        <description>CRC32 calculation result</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>32</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>CRC_CRC16CTRL</name>
                <displayName>CRC_CRC16CTRL</displayName>
                <description>CRC16 Control Register</description>
                <addressOffset>0x10</addressOffset>
                <size>0x20</size>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>CLEAR</name>
                        <description>Clear CRC16 result register</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                        <access>write-only</access>
                    </field>
                    <field>
                        <name>ENDIAN</name>
                        <description>Data endianness</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>CRC_CRC16DAT</name>
                <displayName>CRC_CRC16DAT</displayName>
                <description>CRC16 Data Register</description>
                <addressOffset>0x14</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>CRC16DAT</name>
                        <description>CRC16 input data</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>8</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>CRC_CRC16D</name>
                <displayName>CRC_CRC16D</displayName>
                <description>CRC16 Result Register</description>
                <addressOffset>0x18</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>CRC16D</name>
                        <description>CRC16 calculation result</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>16</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>CRC_LRC</name>
                <displayName>CRC_LRC</displayName>
                <description>LRC Result Register</description>
                <addressOffset>0x1C</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>LRCDAT</name>
                        <description>LRC check value</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>8</bitWidth>
                    </field>
                </fields>
            </register>
