Nsing-Community/Nsing-Pack/Nations_Device_PACK_Add_To_IAR_Tool/Nations Device PACK/debugger/Nsing/N32G41x/N32G41x.svd
        </registers>
    </peripheral>
    <peripheral>
        <name>DMA</name>
        <description>Direct Memory Access Controller</description>
        <groupName>DMA</groupName>
        <baseAddress>0x40020000</baseAddress>
        <addressBlock>
            <offset>0x0</offset>
            <size>0x400</size>
            <usage>registers</usage>
        </addressBlock>
        <interrupt>
            <name>DMA_CH1</name>
            <description>DMA Channel 1 global interrupt</description>
            <value>11</value>
        </interrupt>
        <interrupt>
            <name>DMA_CH2</name>
            <description>DMA Channel 2 global interrupt</description>
            <value>12</value>
        </interrupt>
        <interrupt>
            <name>DMA_CH3</name>
            <description>DMA Channel 3 global interrupt</description>
            <value>13</value>
        </interrupt>
        <interrupt>
            <name>DMA_CH4</name>
            <description>DMA Channel 4 global interrupt</description>
            <value>14</value>
        </interrupt>
        <interrupt>
            <name>DMA_CH5</name>
            <description>DMA Channel 5 global interrupt</description>
            <value>15</value>
        </interrupt>
        <interrupt>
            <name>DMA_CH6</name>
            <description>DMA Channel 6 global interrupt</description>
            <value>16</value>
        </interrupt>
        <interrupt>
            <name>DMA_CH7</name>
            <description>DMA Channel 7 global interrupt</description>
            <value>17</value>
        </interrupt>
        <registers>
            <register>
                <name>DMA_INTSTS</name>
                <displayName>DMA_INTSTS</displayName>
                <description>DMA Interrupt Status Register</description>
                <addressOffset>0x00</addressOffset>
                <size>0x20</size>
                <access>read-only</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>ERRF7</name>
                        <description>Transfer error flag for channel 7</description>
                        <bitOffset>27</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>ERRF6</name>
                        <description>Transfer error flag for channel 6</description>
                        <bitOffset>23</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>ERRF5</name>
                        <description>Transfer error flag for channel 5</description>
                        <bitOffset>19</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>ERRF4</name>
                        <description>Transfer error flag for channel 4</description>
                        <bitOffset>15</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>ERRF3</name>
                        <description>Transfer error flag for channel 3</description>
                        <bitOffset>11</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>ERRF2</name>
                        <description>Transfer error flag for channel 2</description>
                        <bitOffset>7</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>ERRF1</name>
                        <description>Transfer error flag for channel 1</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>TXCF7</name>
                        <description>Transfer complete flag for channel 7</description>
                        <bitOffset>25</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>TXCF6</name>
                        <description>Transfer complete flag for channel 6</description>
                        <bitOffset>21</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>TXCF5</name>
                        <description>Transfer complete flag for channel 5</description>
                        <bitOffset>17</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>TXCF4</name>
                        <description>Transfer complete flag for channel 4</description>
                        <bitOffset>13</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>TXCF3</name>
                        <description>Transfer complete flag for channel 3</description>
                        <bitOffset>9</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>TXCF2</name>
                        <description>Transfer complete flag for channel 2</description>
                        <bitOffset>5</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>TXCF1</name>
                        <description>Transfer complete flag for channel 1</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>HTXF7</name>
                        <description>Half transfer flag for channel 7</description>
                        <bitOffset>26</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>HTXF6</name>
                        <description>Half transfer flag for channel 6</description>
                        <bitOffset>22</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>HTXF5</name>
                        <description>Half transfer flag for channel 5</description>
                        <bitOffset>18</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>HTXF4</name>
                        <description>Half transfer flag for channel 4</description>
                        <bitOffset>14</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>HTXF3</name>
                        <description>Half transfer flag for channel 3</description>
                        <bitOffset>10</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>HTXF2</name>
                        <description>Half transfer flag for channel 2</description>
                        <bitOffset>6</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>HTXF1</name>
                        <description>Half transfer flag for channel 1</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>GLBF7</name>
                        <description>Global flag for channel 7</description>
                        <bitOffset>24</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>GLBF6</name>
                        <description>Global flag for channel 6</description>
                        <bitOffset>20</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>GLBF5</name>
                        <description>Global flag for channel 5</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>GLBF4</name>
                        <description>Global flag for channel 4</description>
                        <bitOffset>12</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>GLBF3</name>
                        <description>Global flag for channel 3</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>GLBF2</name>
                        <description>Global flag for channel 2</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>GLBF1</name>
                        <description>Global flag for channel 1</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>DMA_INTCLR</name>
                <displayName>DMA_INTCLR</displayName>
                <description>DMA Interrupt Flag Clear Register</description>
                <addressOffset>0x04</addressOffset>
                <size>0x20</size>
                <access>write-only</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>CERRF7</name>
                        <description>Clear transfer error flag for channel 7</description>
                        <bitOffset>27</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>CERRF6</name>
                        <description>Clear transfer error flag for channel 6</description>
                        <bitOffset>23</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>CERRF5</name>
                        <description>Clear transfer error flag for channel 5</description>
                        <bitOffset>19</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>CERRF4</name>
                        <description>Clear transfer error flag for channel 4</description>
                        <bitOffset>15</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>CERRF3</name>
                        <description>Clear transfer error flag for channel 3</description>
                        <bitOffset>11</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>CERRF2</name>
                        <description>Clear transfer error flag for channel 2</description>
                        <bitOffset>7</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>CERRF1</name>
                        <description>Clear transfer error flag for channel 1</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>CTXCF7</name>
                        <description>Clear transfer complete flag for channel 7</description>
                        <bitOffset>25</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>CTXCF6</name>
                        <description>Clear transfer complete flag for channel 6</description>
                        <bitOffset>21</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>CTXCF5</name>
                        <description>Clear transfer complete flag for channel 5</description>
                        <bitOffset>17</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>CTXCF4</name>
                        <description>Clear transfer complete flag for channel 4</description>
                        <bitOffset>13</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>CTXCF3</name>
                        <description>Clear transfer complete flag for channel 3</description>
                        <bitOffset>9</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>CTXCF2</name>
                        <description>Clear transfer complete flag for channel 2</description>
                        <bitOffset>5</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>CTXCF1</name>
                        <description>Clear transfer complete flag for channel 1</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>CHTXF7</name>
                        <description>Clear half transfer flag for channel 7</description>
                        <bitOffset>26</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>CHTXF6</name>
                        <description>Clear half transfer flag for channel 6</description>
                        <bitOffset>22</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>CHTXF5</name>
                        <description>Clear half transfer flag for channel 5</description>
                        <bitOffset>18</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>CHTXF4</name>
                        <description>Clear half transfer flag for channel 4</description>
                        <bitOffset>14</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>CHTXF3</name>
                        <description>Clear half transfer flag for channel 3</description>
                        <bitOffset>10</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>CHTXF2</name>
                        <description>Clear half transfer flag for channel 2</description>
                        <bitOffset>6</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>CHTXF1</name>
                        <description>Clear half transfer flag for channel 1</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>CGLBF7</name>
                        <description>Clear global flag for channel 7</description>
                        <bitOffset>24</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>CGLBF6</name>
                        <description>Clear global flag for channel 6</description>
                        <bitOffset>20</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>CGLBF5</name>
                        <description>Clear global flag for channel 5</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>CGLBF4</name>
                        <description>Clear global flag for channel 4</description>
                        <bitOffset>12</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>CGLBF3</name>
                        <description>Clear global flag for channel 3</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>CGLBF2</name>
                        <description>Clear global flag for channel 2</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>CGLBF1</name>
                        <description>Clear global flag for channel 1</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>DMA_CHCFG1</name>
                <displayName>DMA_CHCFG1</displayName>
                <description>DMA Channel 1 Configuration Register</description>
                <addressOffset>0x08</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>MEM2MEM</name>
                        <description>Memory to memory mode</description>
                        <bitOffset>14</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>PRIOLVL</name>
                        <description>Channel priority</description>
                        <bitOffset>12</bitOffset>
                        <bitWidth>2</bitWidth>
                    </field>
                    <field>
                        <name>MSIZE</name>
                        <description>Memory data size</description>
                        <bitOffset>10</bitOffset>
                        <bitWidth>2</bitWidth>
                    </field>
                    <field>
                        <name>PSIZE</name>
                        <description>Peripheral data size</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>2</bitWidth>
                    </field>
                    <field>
                        <name>MINC</name>
                        <description>Memory address increment mode</description>
                        <bitOffset>7</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>PINC</name>
                        <description>Peripheral address increment mode</description>
                        <bitOffset>6</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>CIRC</name>
                        <description>Circular mode</description>
                        <bitOffset>5</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>DIR</name>
                        <description>Data transfer direction</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>ERRIE</name>
                        <description>Transfer error interrupt enable</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>HTXIE</name>
                        <description>Half transfer interrupt enable</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>TXCIE</name>
                        <description>Transfer complete interrupt enable</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>CHEN</name>
                        <description>Channel enable</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>DMA_TXNUM1</name>
                <displayName>DMA_TXNUM1</displayName>
                <description>DMA Channel 1 Transfer Number Register</description>
                <addressOffset>0x0C</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>NDTX</name>
                        <description>Number of data to transfer</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>16</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>DMA_PADDR1</name>
                <displayName>DMA_PADDR1</displayName>
                <description>DMA Channel 1 Peripheral Address Register</description>
                <addressOffset>0x10</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>ADDR</name>
                        <description>Peripheral base address</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>32</bitWidth>
                    </field>
                </fields>
            </register>
