Nsing-Community/Nsing-Pack/Nations_Device_PACK_Add_To_IAR_Tool/Nations Device PACK/debugger/Nsing/N32G41x/N32G41x.svd
            <register>
                <name>DMA_MADDR1</name>
                <displayName>DMA_MADDR1</displayName>
                <description>DMA Channel 1 Memory Address Register</description>
                <addressOffset>0x14</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>ADDR</name>
                        <description>Memory base address</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>32</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>DMA_CHSEL1</name>
                <displayName>DMA_CHSEL1</displayName>
                <description>DMA Channel 1 Request Selection Register</description>
                <addressOffset>0x18</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>CH_SEL</name>
                        <description>DMA channel request source selection</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>6</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>DMA_CHCFG2</name>
                <displayName>DMA_CHCFG2</displayName>
                <description>DMA Channel 2 Configuration Register</description>
                <addressOffset>0x1C</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>MEM2MEM</name>
                        <description>Memory to memory mode</description>
                        <bitOffset>14</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>PRIOLVL</name>
                        <description>Channel priority</description>
                        <bitOffset>12</bitOffset>
                        <bitWidth>2</bitWidth>
                    </field>
                    <field>
                        <name>MSIZE</name>
                        <description>Memory data size</description>
                        <bitOffset>10</bitOffset>
                        <bitWidth>2</bitWidth>
                    </field>
                    <field>
                        <name>PSIZE</name>
                        <description>Peripheral data size</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>2</bitWidth>
                    </field>
                    <field>
                        <name>MINC</name>
                        <description>Memory address increment mode</description>
                        <bitOffset>7</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>PINC</name>
                        <description>Peripheral address increment mode</description>
                        <bitOffset>6</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>CIRC</name>
                        <description>Circular mode</description>
                        <bitOffset>5</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>DIR</name>
                        <description>Data transfer direction</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>ERRIE</name>
                        <description>Transfer error interrupt enable</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>HTXIE</name>
                        <description>Half transfer interrupt enable</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>TXCIE</name>
                        <description>Transfer complete interrupt enable</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>CHEN</name>
                        <description>Channel enable</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>DMA_TXNUM2</name>
                <displayName>DMA_TXNUM2</displayName>
                <description>DMA Channel 2 Transfer Number Register</description>
                <addressOffset>0x20</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>NDTX</name>
                        <description>Number of data to transfer</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>16</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>DMA_PADDR2</name>
                <displayName>DMA_PADDR2</displayName>
                <description>DMA Channel 2 Peripheral Address Register</description>
                <addressOffset>0x24</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>ADDR</name>
                        <description>Peripheral base address</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>32</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>DMA_MADDR2</name>
                <displayName>DMA_MADDR2</displayName>
                <description>DMA Channel 2 Memory Address Register</description>
                <addressOffset>0x28</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>ADDR</name>
                        <description>Memory base address</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>32</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>DMA_CHSEL2</name>
                <displayName>DMA_CHSEL2</displayName>
                <description>DMA Channel 2 Request Selection Register</description>
                <addressOffset>0x2C</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>CH_SEL</name>
                        <description>DMA channel request source selection</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>6</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>DMA_CHCFG3</name>
                <displayName>DMA_CHCFG3</displayName>
                <description>DMA Channel 3 Configuration Register</description>
                <addressOffset>0x30</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>MEM2MEM</name>
                        <description>Memory to memory mode</description>
                        <bitOffset>14</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>PRIOLVL</name>
                        <description>Channel priority</description>
                        <bitOffset>12</bitOffset>
                        <bitWidth>2</bitWidth>
                    </field>
                    <field>
                        <name>MSIZE</name>
                        <description>Memory data size</description>
                        <bitOffset>10</bitOffset>
                        <bitWidth>2</bitWidth>
                    </field>
                    <field>
                        <name>PSIZE</name>
                        <description>Peripheral data size</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>2</bitWidth>
                    </field>
                    <field>
                        <name>MINC</name>
                        <description>Memory address increment mode</description>
                        <bitOffset>7</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>PINC</name>
                        <description>Peripheral address increment mode</description>
                        <bitOffset>6</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>CIRC</name>
                        <description>Circular mode</description>
                        <bitOffset>5</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>DIR</name>
                        <description>Data transfer direction</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>ERRIE</name>
                        <description>Transfer error interrupt enable</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>HTXIE</name>
                        <description>Half transfer interrupt enable</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>TXCIE</name>
                        <description>Transfer complete interrupt enable</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>CHEN</name>
                        <description>Channel enable</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>DMA_TXNUM3</name>
                <displayName>DMA_TXNUM3</displayName>
                <description>DMA Channel 3 Transfer Number Register</description>
                <addressOffset>0x34</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>NDTX</name>
                        <description>Number of data to transfer</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>16</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>DMA_PADDR3</name>
                <displayName>DMA_PADDR3</displayName>
                <description>DMA Channel 3 Peripheral Address Register</description>
                <addressOffset>0x38</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>ADDR</name>
                        <description>Peripheral base address</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>32</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>DMA_MADDR3</name>
                <displayName>DMA_MADDR3</displayName>
                <description>DMA Channel 3 Memory Address Register</description>
                <addressOffset>0x3C</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>ADDR</name>
                        <description>Memory base address</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>32</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>DMA_CHSEL3</name>
                <displayName>DMA_CHSEL3</displayName>
                <description>DMA Channel 3 Request Selection Register</description>
                <addressOffset>0x40</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>CH_SEL</name>
                        <description>DMA channel request source selection</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>6</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>DMA_CHCFG4</name>
                <displayName>DMA_CHCFG4</displayName>
                <description>DMA Channel 4 Configuration Register</description>
                <addressOffset>0x44</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>MEM2MEM</name>
                        <description>Memory to memory mode</description>
                        <bitOffset>14</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>PRIOLVL</name>
                        <description>Channel priority</description>
                        <bitOffset>12</bitOffset>
                        <bitWidth>2</bitWidth>
                    </field>
                    <field>
                        <name>MSIZE</name>
                        <description>Memory data size</description>
                        <bitOffset>10</bitOffset>
                        <bitWidth>2</bitWidth>
                    </field>
                    <field>
                        <name>PSIZE</name>
                        <description>Peripheral data size</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>2</bitWidth>
                    </field>
                    <field>
                        <name>MINC</name>
                        <description>Memory address increment mode</description>
                        <bitOffset>7</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>PINC</name>
                        <description>Peripheral address increment mode</description>
                        <bitOffset>6</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>CIRC</name>
                        <description>Circular mode</description>
                        <bitOffset>5</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>DIR</name>
                        <description>Data transfer direction</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>ERRIE</name>
                        <description>Transfer error interrupt enable</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>HTXIE</name>
                        <description>Half transfer interrupt enable</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>TXCIE</name>
                        <description>Transfer complete interrupt enable</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>CHEN</name>
                        <description>Channel enable</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>DMA_TXNUM4</name>
                <displayName>DMA_TXNUM4</displayName>
                <description>DMA Channel 4 Transfer Number Register</description>
                <addressOffset>0x48</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>NDTX</name>
                        <description>Number of data to transfer</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>16</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>DMA_PADDR4</name>
                <displayName>DMA_PADDR4</displayName>
                <description>DMA Channel 4 Peripheral Address Register</description>
                <addressOffset>0x4C</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>ADDR</name>
                        <description>Peripheral base address</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>32</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>DMA_MADDR4</name>
                <displayName>DMA_MADDR4</displayName>
                <description>DMA Channel 4 Memory Address Register</description>
                <addressOffset>0x50</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>ADDR</name>
                        <description>Memory base address</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>32</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>DMA_CHSEL4</name>
                <displayName>DMA_CHSEL4</displayName>
                <description>DMA Channel 4 Request Selection Register</description>
                <addressOffset>0x54</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>CH_SEL</name>
                        <description>DMA channel request source selection</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>6</bitWidth>
                    </field>
                </fields>
            </register>
