Nsing-Community/Nsing-Pack/Nations_Device_PACK_Add_To_IAR_Tool/Nations Device PACK/debugger/Nsing/N32G41x/N32G41x.svd
            <register>
                <name>DMA_CHCFG5</name>
                <displayName>DMA_CHCFG5</displayName>
                <description>DMA Channel 5 Configuration Register</description>
                <addressOffset>0x58</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>MEM2MEM</name>
                        <description>Memory to memory mode</description>
                        <bitOffset>14</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>PRIOLVL</name>
                        <description>Channel priority</description>
                        <bitOffset>12</bitOffset>
                        <bitWidth>2</bitWidth>
                    </field>
                    <field>
                        <name>MSIZE</name>
                        <description>Memory data size</description>
                        <bitOffset>10</bitOffset>
                        <bitWidth>2</bitWidth>
                    </field>
                    <field>
                        <name>PSIZE</name>
                        <description>Peripheral data size</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>2</bitWidth>
                    </field>
                    <field>
                        <name>MINC</name>
                        <description>Memory address increment mode</description>
                        <bitOffset>7</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>PINC</name>
                        <description>Peripheral address increment mode</description>
                        <bitOffset>6</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>CIRC</name>
                        <description>Circular mode</description>
                        <bitOffset>5</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>DIR</name>
                        <description>Data transfer direction</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>ERRIE</name>
                        <description>Transfer error interrupt enable</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>HTXIE</name>
                        <description>Half transfer interrupt enable</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>TXCIE</name>
                        <description>Transfer complete interrupt enable</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>CHEN</name>
                        <description>Channel enable</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>DMA_TXNUM5</name>
                <displayName>DMA_TXNUM5</displayName>
                <description>DMA Channel 5 Transfer Number Register</description>
                <addressOffset>0x5C</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>NDTX</name>
                        <description>Number of data to transfer</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>16</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>DMA_PADDR5</name>
                <displayName>DMA_PADDR5</displayName>
                <description>DMA Channel 5 Peripheral Address Register</description>
                <addressOffset>0x60</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>ADDR</name>
                        <description>Peripheral base address</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>32</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>DMA_MADDR5</name>
                <displayName>DMA_MADDR5</displayName>
                <description>DMA Channel 5 Memory Address Register</description>
                <addressOffset>0x64</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>ADDR</name>
                        <description>Memory base address</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>32</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>DMA_CHSEL5</name>
                <displayName>DMA_CHSEL5</displayName>
                <description>DMA Channel 5 Request Selection Register</description>
                <addressOffset>0x68</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>CH_SEL</name>
                        <description>DMA channel request source selection</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>6</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>DMA_CHCFG6</name>
                <displayName>DMA_CHCFG6</displayName>
                <description>DMA Channel 6 Configuration Register</description>
                <addressOffset>0x6C</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>MEM2MEM</name>
                        <description>Memory to memory mode</description>
                        <bitOffset>14</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>PRIOLVL</name>
                        <description>Channel priority</description>
                        <bitOffset>12</bitOffset>
                        <bitWidth>2</bitWidth>
                    </field>
                    <field>
                        <name>MSIZE</name>
                        <description>Memory data size</description>
                        <bitOffset>10</bitOffset>
                        <bitWidth>2</bitWidth>
                    </field>
                    <field>
                        <name>PSIZE</name>
                        <description>Peripheral data size</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>2</bitWidth>
                    </field>
                    <field>
                        <name>MINC</name>
                        <description>Memory address increment mode</description>
                        <bitOffset>7</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>PINC</name>
                        <description>Peripheral address increment mode</description>
                        <bitOffset>6</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>CIRC</name>
                        <description>Circular mode</description>
                        <bitOffset>5</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>DIR</name>
                        <description>Data transfer direction</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>ERRIE</name>
                        <description>Transfer error interrupt enable</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>HTXIE</name>
                        <description>Half transfer interrupt enable</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>TXCIE</name>
                        <description>Transfer complete interrupt enable</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>CHEN</name>
                        <description>Channel enable</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>DMA_TXNUM6</name>
                <displayName>DMA_TXNUM6</displayName>
                <description>DMA Channel 6 Transfer Number Register</description>
                <addressOffset>0x70</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>NDTX</name>
                        <description>Number of data to transfer</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>16</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>DMA_PADDR6</name>
                <displayName>DMA_PADDR6</displayName>
                <description>DMA Channel 6 Peripheral Address Register</description>
                <addressOffset>0x74</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>ADDR</name>
                        <description>Peripheral base address</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>32</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>DMA_MADDR6</name>
                <displayName>DMA_MADDR6</displayName>
                <description>DMA Channel 6 Memory Address Register</description>
                <addressOffset>0x78</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>ADDR</name>
                        <description>Memory base address</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>32</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>DMA_CHSEL6</name>
                <displayName>DMA_CHSEL6</displayName>
                <description>DMA Channel 6 Request Selection Register</description>
                <addressOffset>0x7C</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>CH_SEL</name>
                        <description>DMA channel request source selection</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>6</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>DMA_CHCFG7</name>
                <displayName>DMA_CHCFG7</displayName>
                <description>DMA Channel 7 Configuration Register</description>
                <addressOffset>0x80</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>MEM2MEM</name>
                        <description>Memory to memory mode</description>
                        <bitOffset>14</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>PRIOLVL</name>
                        <description>Channel priority</description>
                        <bitOffset>12</bitOffset>
                        <bitWidth>2</bitWidth>
                    </field>
                    <field>
                        <name>MSIZE</name>
                        <description>Memory data size</description>
                        <bitOffset>10</bitOffset>
                        <bitWidth>2</bitWidth>
                    </field>
                    <field>
                        <name>PSIZE</name>
                        <description>Peripheral data size</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>2</bitWidth>
                    </field>
                    <field>
                        <name>MINC</name>
                        <description>Memory address increment mode</description>
                        <bitOffset>7</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>PINC</name>
                        <description>Peripheral address increment mode</description>
                        <bitOffset>6</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>CIRC</name>
                        <description>Circular mode</description>
                        <bitOffset>5</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>DIR</name>
                        <description>Data transfer direction</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>ERRIE</name>
                        <description>Transfer error interrupt enable</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>HTXIE</name>
                        <description>Half transfer interrupt enable</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>TXCIE</name>
                        <description>Transfer complete interrupt enable</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>CHEN</name>
                        <description>Channel enable</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>DMA_TXNUM7</name>
                <displayName>DMA_TXNUM7</displayName>
                <description>DMA Channel 7 Transfer Number Register</description>
                <addressOffset>0x84</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>NDTX</name>
                        <description>Number of data to transfer</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>16</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>DMA_PADDR7</name>
                <displayName>DMA_PADDR7</displayName>
                <description>DMA Channel 7 Peripheral Address Register</description>
                <addressOffset>0x88</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>ADDR</name>
                        <description>Peripheral base address</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>32</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>DMA_MADDR7</name>
                <displayName>DMA_MADDR7</displayName>
                <description>DMA Channel 7 Memory Address Register</description>
                <addressOffset>0x8C</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>ADDR</name>
                        <description>Memory base address</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>32</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>DMA_CHSEL7</name>
                <displayName>DMA_CHSEL7</displayName>
                <description>DMA Channel 7 Request Selection Register</description>
                <addressOffset>0x90</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>CH_SEL</name>
                        <description>DMA channel request source selection</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>6</bitWidth>
                    </field>
                </fields>
            </register>
