Nsing-Community/Nsing-Pack/Nations_Device_PACK_Add_To_IAR_Tool/Nations Device PACK/debugger/Nsing/N32G41x/N32G41x.svd
        </registers>
    </peripheral>
    <peripheral>
        <name>EXTI</name>
        <description>External Interrupt/Event Controller</description>
        <groupName>EXTI</groupName>
        <baseAddress>0x40010400</baseAddress>
        <addressBlock>
            <offset>0x0</offset>
            <size>0x400</size>
            <usage>registers</usage>
        </addressBlock>
        <interrupt>
            <name>EXTI0</name>
            <description>EXTI Line 0 interrupt</description>
            <value>6</value>
        </interrupt>
        <interrupt>
            <name>EXTI1</name>
            <description>EXTI Line 1 interrupt</description>
            <value>7</value>
        </interrupt>
        <interrupt>
            <name>EXTI2</name>
            <description>EXTI Line 2 interrupt</description>
            <value>8</value>
        </interrupt>
        <interrupt>
            <name>EXTI3</name>
            <description>EXTI Line 3 interrupt</description>
            <value>9</value>
        </interrupt>
        <interrupt>
            <name>EXTI4</name>
            <description>EXTI Line 4 interrupt</description>
            <value>10</value>
        </interrupt>
        <interrupt>
            <name>EXTI9_5</name>
            <description>EXTI Line 9 to 5 interrupt</description>
            <value>23</value>
        </interrupt>
        <interrupt>
            <name>EXTI15_10</name>
            <description>EXTI Line 15 to 10 interrupt</description>
            <value>40</value>
        </interrupt>
        <registers>
            <register>
                <name>EXTI_EMASK</name>
                <displayName>EXTI_EMASK</displayName>
                <description>EXTI Event Mask Register</description>
                <addressOffset>0x00</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>EMASK</name>
                        <description>Event mask for line x</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>26</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>EXTI_IMASK</name>
                <displayName>EXTI_IMASK</displayName>
                <description>EXTI Interrupt Mask Register</description>
                <addressOffset>0x04</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>IMASK</name>
                        <description>Interrupt mask for line x</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>26</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>EXTI_FT_CFG</name>
                <displayName>EXTI_FT_CFG</displayName>
                <description>EXTI Falling Trigger Configuration Register</description>
                <addressOffset>0x08</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>FT_CFG</name>
                        <description>Falling trigger for line x</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>26</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>EXTI_RT_CFG</name>
                <displayName>EXTI_RT_CFG</displayName>
                <description>EXTI Rising Trigger Configuration Register</description>
                <addressOffset>0x0C</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>RT_CFG</name>
                        <description>Rising trigger for line x</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>26</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>EXTI_PEND</name>
                <displayName>EXTI_PEND</displayName>
                <description>EXTI Pending Register</description>
                <addressOffset>0x10</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>PEND</name>
                        <description>Pending bit for line x</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>26</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>EXTI_SWIE</name>
                <displayName>EXTI_SWIE</displayName>
                <description>EXTI Software Interrupt Event Register</description>
                <addressOffset>0x14</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>SWIE</name>
                        <description>Software interrupt for line x</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>26</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>EXTI_TS_SEL</name>
                <displayName>EXTI_TS_SEL</displayName>
                <description>EXTI Timestamp Trigger Selection Register</description>
                <addressOffset>0x18</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>TSSEL</name>
                        <description>Timestamp trigger source selection</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>4</bitWidth>
                    </field>
                </fields>
            </register>
