Nsing-Community/Nsing-Pack/Nations_Device_PACK_Add_To_IAR_Tool/Nations Device PACK/debugger/Nsing/N32G41x/N32G41x.svd
            <register>
                <name>GPIOA_AFH</name>
                <displayName>GPIOA_AFH</displayName>
                <description>GPIOA Alternate Function High Register</description>
                <addressOffset>0x24</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0xF00FFFFF</resetValue>
                <fields>
                    <field>
                        <name>AFSEL8</name>
                        <description>Port A alternate function for pin 8</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>4</bitWidth>
                    </field>
                    <field>
                        <name>AFSEL9</name>
                        <description>Port A alternate function for pin 9</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>4</bitWidth>
                    </field>
                    <field>
                        <name>AFSEL10</name>
                        <description>Port A alternate function for pin 10</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>4</bitWidth>
                    </field>
                    <field>
                        <name>AFSEL11</name>
                        <description>Port A alternate function for pin 11</description>
                        <bitOffset>12</bitOffset>
                        <bitWidth>4</bitWidth>
                    </field>
                    <field>
                        <name>AFSEL12</name>
                        <description>Port A alternate function for pin 12</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>4</bitWidth>
                    </field>
                    <field>
                        <name>AFSEL13</name>
                        <description>Port A alternate function for pin 13</description>
                        <bitOffset>20</bitOffset>
                        <bitWidth>4</bitWidth>
                    </field>
                    <field>
                        <name>AFSEL14</name>
                        <description>Port A alternate function for pin 14</description>
                        <bitOffset>24</bitOffset>
                        <bitWidth>4</bitWidth>
                    </field>
                    <field>
                        <name>AFSEL15</name>
                        <description>Port A alternate function for pin 15</description>
                        <bitOffset>28</bitOffset>
                        <bitWidth>4</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>GPIOA_PBC</name>
                <displayName>GPIOA_PBC</displayName>
                <description>GPIOA Port Bit Clear Register</description>
                <addressOffset>0x28</addressOffset>
                <size>0x20</size>
                <access>write-only</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>PBC0</name>
                        <description>Port A clear output bit 0</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>PBC1</name>
                        <description>Port A clear output bit 1</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>PBC2</name>
                        <description>Port A clear output bit 2</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>PBC3</name>
                        <description>Port A clear output bit 3</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>PBC4</name>
                        <description>Port A clear output bit 4</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>PBC5</name>
                        <description>Port A clear output bit 5</description>
                        <bitOffset>5</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>PBC6</name>
                        <description>Port A clear output bit 6</description>
                        <bitOffset>6</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>PBC7</name>
                        <description>Port A clear output bit 7</description>
                        <bitOffset>7</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>PBC8</name>
                        <description>Port A clear output bit 8</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>PBC9</name>
                        <description>Port A clear output bit 9</description>
                        <bitOffset>9</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>PBC10</name>
                        <description>Port A clear output bit 10</description>
                        <bitOffset>10</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>PBC11</name>
                        <description>Port A clear output bit 11</description>
                        <bitOffset>11</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>PBC12</name>
                        <description>Port A clear output bit 12</description>
                        <bitOffset>12</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>PBC13</name>
                        <description>Port A clear output bit 13</description>
                        <bitOffset>13</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>PBC14</name>
                        <description>Port A clear output bit 14</description>
                        <bitOffset>14</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>PBC15</name>
                        <description>Port A clear output bit 15</description>
                        <bitOffset>15</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>GPIOA_DS</name>
                <displayName>GPIOA_DS</displayName>
                <description>GPIOA Drive Strength Register</description>
                <addressOffset>0x2C</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x0007FFFF</resetValue>
                <fields>
                    <field>
                        <name>SR2</name>
                        <description>Slew rate control PA2</description>
                        <bitOffset>18</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>SR1</name>
                        <description>Slew rate control PA1</description>
                        <bitOffset>17</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>SR0</name>
                        <description>Slew rate control PA0</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>DS15</name>
                        <description>Port A drive strength for pin 15</description>
                        <bitOffset>15</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>DS14</name>
                        <description>Port A drive strength for pin 14</description>
                        <bitOffset>14</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>DS13</name>
                        <description>Port A drive strength for pin 13</description>
                        <bitOffset>13</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>DS12</name>
                        <description>Port A drive strength for pin 12</description>
                        <bitOffset>12</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>DS11</name>
                        <description>Port A drive strength for pin 11</description>
                        <bitOffset>11</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>DS10</name>
                        <description>Port A drive strength for pin 10</description>
                        <bitOffset>10</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>DS9</name>
                        <description>Port A drive strength for pin 9</description>
                        <bitOffset>9</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>DS8</name>
                        <description>Port A drive strength for pin 8</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>DS7</name>
                        <description>Port A drive strength for pin 7</description>
                        <bitOffset>7</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>DS6</name>
                        <description>Port A drive strength for pin 6</description>
                        <bitOffset>6</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>DS5</name>
                        <description>Port A drive strength for pin 5</description>
                        <bitOffset>5</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>DS4</name>
                        <description>Port A drive strength for pin 4</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>DS3</name>
                        <description>Port A drive strength for pin 3</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>DS2</name>
                        <description>Port A drive strength for pin 2</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>DS1</name>
                        <description>Port A drive strength for pin 1</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>DS0</name>
                        <description>Port A drive strength for pin 0</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                </fields>
            </register>
