Nsing-Community/Nsing-Pack/Nations_Device_PACK_Add_To_IAR_Tool/Nations Device PACK/debugger/Nsing/N32G41x/N32G41x.svd
        </registers>
    </peripheral>
    <peripheral>
        <name>GPIOC</name>
        <description>GPIO Port C</description>
        <groupName>GPIO</groupName>
        <baseAddress>0x40021600</baseAddress>
        <addressBlock>
            <offset>0x0</offset>
            <size>0x100</size>
            <usage>registers</usage>
        </addressBlock>
        <registers>
            <register>
                <name>GPIOC_PMODE</name>
                <displayName>GPIOC_PMODE</displayName>
                <description>GPIOC Port Mode Register</description>
                <addressOffset>0x00</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0xFFFFFFFF</resetValue>
                <fields>
                    <field>
                        <name>PMODE0</name>
                        <description>Port C mode for pin 0</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>2</bitWidth>
                    </field>
                    <field>
                        <name>PMODE1</name>
                        <description>Port C mode for pin 1</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>2</bitWidth>
                    </field>
                    <field>
                        <name>PMODE2</name>
                        <description>Port C mode for pin 2</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>2</bitWidth>
                    </field>
                    <field>
                        <name>PMODE3</name>
                        <description>Port C mode for pin 3</description>
                        <bitOffset>6</bitOffset>
                        <bitWidth>2</bitWidth>
                    </field>
                    <field>
                        <name>PMODE4</name>
                        <description>Port C mode for pin 4</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>2</bitWidth>
                    </field>
                    <field>
                        <name>PMODE5</name>
                        <description>Port C mode for pin 5</description>
                        <bitOffset>10</bitOffset>
                        <bitWidth>2</bitWidth>
                    </field>
                    <field>
                        <name>PMODE6</name>
                        <description>Port C mode for pin 6</description>
                        <bitOffset>12</bitOffset>
                        <bitWidth>2</bitWidth>
                    </field>
                    <field>
                        <name>PMODE7</name>
                        <description>Port C mode for pin 7</description>
                        <bitOffset>14</bitOffset>
                        <bitWidth>2</bitWidth>
                    </field>
                    <field>
                        <name>PMODE8</name>
                        <description>Port C mode for pin 8</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>2</bitWidth>
                    </field>
                    <field>
                        <name>PMODE9</name>
                        <description>Port C mode for pin 9</description>
                        <bitOffset>18</bitOffset>
                        <bitWidth>2</bitWidth>
                    </field>
                    <field>
                        <name>PMODE10</name>
                        <description>Port C mode for pin 10</description>
                        <bitOffset>20</bitOffset>
                        <bitWidth>2</bitWidth>
                    </field>
                    <field>
                        <name>PMODE11</name>
                        <description>Port C mode for pin 11</description>
                        <bitOffset>22</bitOffset>
                        <bitWidth>2</bitWidth>
                    </field>
                    <field>
                        <name>PMODE12</name>
                        <description>Port C mode for pin 12</description>
                        <bitOffset>24</bitOffset>
                        <bitWidth>2</bitWidth>
                    </field>
                    <field>
                        <name>PMODE13</name>
                        <description>Port C mode for pin 13</description>
                        <bitOffset>26</bitOffset>
                        <bitWidth>2</bitWidth>
                    </field>
                    <field>
                        <name>PMODE14</name>
                        <description>Port C mode for pin 14</description>
                        <bitOffset>28</bitOffset>
                        <bitWidth>2</bitWidth>
                    </field>
                    <field>
                        <name>PMODE15</name>
                        <description>Port C mode for pin 15</description>
                        <bitOffset>30</bitOffset>
                        <bitWidth>2</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>GPIOC_POTYPE</name>
                <displayName>GPIOC_POTYPE</displayName>
                <description>GPIOC Port Output Type Register</description>
                <addressOffset>0x04</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>POT0</name>
                        <description>Port C output type for pin 0</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>POT1</name>
                        <description>Port C output type for pin 1</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>POT2</name>
                        <description>Port C output type for pin 2</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>POT3</name>
                        <description>Port C output type for pin 3</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>POT4</name>
                        <description>Port C output type for pin 4</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>POT5</name>
                        <description>Port C output type for pin 5</description>
                        <bitOffset>5</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>POT6</name>
                        <description>Port C output type for pin 6</description>
                        <bitOffset>6</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>POT7</name>
                        <description>Port C output type for pin 7</description>
                        <bitOffset>7</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>POT8</name>
                        <description>Port C output type for pin 8</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>POT9</name>
                        <description>Port C output type for pin 9</description>
                        <bitOffset>9</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>POT10</name>
                        <description>Port C output type for pin 10</description>
                        <bitOffset>10</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>POT11</name>
                        <description>Port C output type for pin 11</description>
                        <bitOffset>11</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>POT12</name>
                        <description>Port C output type for pin 12</description>
                        <bitOffset>12</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>POT13</name>
                        <description>Port C output type for pin 13</description>
                        <bitOffset>13</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>POT14</name>
                        <description>Port C output type for pin 14</description>
                        <bitOffset>14</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>POT15</name>
                        <description>Port C output type for pin 15</description>
                        <bitOffset>15</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>GPIOC_PUPD</name>
                <displayName>GPIOC_PUPD</displayName>
                <description>GPIOC Port Pull-Up/Pull-Down Register</description>
                <addressOffset>0x0C</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>PUPD0</name>
                        <description>Port C pull-up/pull-down for pin 0</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>2</bitWidth>
                    </field>
                    <field>
                        <name>PUPD1</name>
                        <description>Port C pull-up/pull-down for pin 1</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>2</bitWidth>
                    </field>
                    <field>
                        <name>PUPD2</name>
                        <description>Port C pull-up/pull-down for pin 2</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>2</bitWidth>
                    </field>
                    <field>
                        <name>PUPD3</name>
                        <description>Port C pull-up/pull-down for pin 3</description>
                        <bitOffset>6</bitOffset>
                        <bitWidth>2</bitWidth>
                    </field>
                    <field>
                        <name>PUPD4</name>
                        <description>Port C pull-up/pull-down for pin 4</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>2</bitWidth>
                    </field>
                    <field>
                        <name>PUPD5</name>
                        <description>Port C pull-up/pull-down for pin 5</description>
                        <bitOffset>10</bitOffset>
                        <bitWidth>2</bitWidth>
                    </field>
                    <field>
                        <name>PUPD6</name>
                        <description>Port C pull-up/pull-down for pin 6</description>
                        <bitOffset>12</bitOffset>
                        <bitWidth>2</bitWidth>
                    </field>
                    <field>
                        <name>PUPD7</name>
                        <description>Port C pull-up/pull-down for pin 7</description>
                        <bitOffset>14</bitOffset>
                        <bitWidth>2</bitWidth>
                    </field>
                    <field>
                        <name>PUPD8</name>
                        <description>Port C pull-up/pull-down for pin 8</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>2</bitWidth>
                    </field>
                    <field>
                        <name>PUPD9</name>
                        <description>Port C pull-up/pull-down for pin 9</description>
                        <bitOffset>18</bitOffset>
                        <bitWidth>2</bitWidth>
                    </field>
                    <field>
                        <name>PUPD10</name>
                        <description>Port C pull-up/pull-down for pin 10</description>
                        <bitOffset>20</bitOffset>
                        <bitWidth>2</bitWidth>
                    </field>
                    <field>
                        <name>PUPD11</name>
                        <description>Port C pull-up/pull-down for pin 11</description>
                        <bitOffset>22</bitOffset>
                        <bitWidth>2</bitWidth>
                    </field>
                    <field>
                        <name>PUPD12</name>
                        <description>Port C pull-up/pull-down for pin 12</description>
                        <bitOffset>24</bitOffset>
                        <bitWidth>2</bitWidth>
                    </field>
                    <field>
                        <name>PUPD13</name>
                        <description>Port C pull-up/pull-down for pin 13</description>
                        <bitOffset>26</bitOffset>
                        <bitWidth>2</bitWidth>
                    </field>
                    <field>
                        <name>PUPD14</name>
                        <description>Port C pull-up/pull-down for pin 14</description>
                        <bitOffset>28</bitOffset>
                        <bitWidth>2</bitWidth>
                    </field>
                    <field>
                        <name>PUPD15</name>
                        <description>Port C pull-up/pull-down for pin 15</description>
                        <bitOffset>30</bitOffset>
                        <bitWidth>2</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>GPIOC_PID</name>
                <displayName>GPIOC_PID</displayName>
                <description>GPIOC Port Input Data Register</description>
                <addressOffset>0x10</addressOffset>
                <size>0x20</size>
                <access>read-only</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>PID0</name>
                        <description>Port C input data for pin 0</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>PID1</name>
                        <description>Port C input data for pin 1</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>PID2</name>
                        <description>Port C input data for pin 2</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>PID3</name>
                        <description>Port C input data for pin 3</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>PID4</name>
                        <description>Port C input data for pin 4</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>PID5</name>
                        <description>Port C input data for pin 5</description>
                        <bitOffset>5</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>PID6</name>
                        <description>Port C input data for pin 6</description>
                        <bitOffset>6</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>PID7</name>
                        <description>Port C input data for pin 7</description>
                        <bitOffset>7</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>PID8</name>
                        <description>Port C input data for pin 8</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>PID9</name>
                        <description>Port C input data for pin 9</description>
                        <bitOffset>9</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>PID10</name>
                        <description>Port C input data for pin 10</description>
                        <bitOffset>10</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>PID11</name>
                        <description>Port C input data for pin 11</description>
                        <bitOffset>11</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>PID12</name>
                        <description>Port C input data for pin 12</description>
                        <bitOffset>12</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>PID13</name>
                        <description>Port C input data for pin 13</description>
                        <bitOffset>13</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>PID14</name>
                        <description>Port C input data for pin 14</description>
                        <bitOffset>14</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>PID15</name>
                        <description>Port C input data for pin 15</description>
                        <bitOffset>15</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                </fields>
            </register>
