Nsing-Community/Nsing-Pack/Nations_Device_PACK_Add_To_IAR_Tool/Nations Device PACK/debugger/Nsing/N32G41x/N32G41x.svd
            <register>
                <name>GPIOD_POD</name>
                <displayName>GPIOD_POD</displayName>
                <description>GPIOD Port Output Data Register</description>
                <addressOffset>0x14</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>POD0</name>
                        <description>Port D output data for pin 0</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>POD1</name>
                        <description>Port D output data for pin 1</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>POD2</name>
                        <description>Port D output data for pin 2</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>POD3</name>
                        <description>Port D output data for pin 3</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>POD4</name>
                        <description>Port D output data for pin 4</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>POD5</name>
                        <description>Port D output data for pin 5</description>
                        <bitOffset>5</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>POD6</name>
                        <description>Port D output data for pin 6</description>
                        <bitOffset>6</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>POD7</name>
                        <description>Port D output data for pin 7</description>
                        <bitOffset>7</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>POD8</name>
                        <description>Port D output data for pin 8</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>POD9</name>
                        <description>Port D output data for pin 9</description>
                        <bitOffset>9</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>POD10</name>
                        <description>Port D output data for pin 10</description>
                        <bitOffset>10</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>POD11</name>
                        <description>Port D output data for pin 11</description>
                        <bitOffset>11</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>POD12</name>
                        <description>Port D output data for pin 12</description>
                        <bitOffset>12</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>POD13</name>
                        <description>Port D output data for pin 13</description>
                        <bitOffset>13</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>POD14</name>
                        <description>Port D output data for pin 14</description>
                        <bitOffset>14</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>POD15</name>
                        <description>Port D output data for pin 15</description>
                        <bitOffset>15</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>GPIOD_PBSC</name>
                <displayName>GPIOD_PBSC</displayName>
                <description>GPIOD Port Bit Set/Clear Register</description>
                <addressOffset>0x18</addressOffset>
                <size>0x20</size>
                <access>write-only</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>PBC0</name>
                        <description>Port D clear bit 0</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>PBC1</name>
                        <description>Port D clear bit 1</description>
                        <bitOffset>17</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>PBC2</name>
                        <description>Port D clear bit 2</description>
                        <bitOffset>18</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>PBC3</name>
                        <description>Port D clear bit 3</description>
                        <bitOffset>19</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>PBC4</name>
                        <description>Port D clear bit 4</description>
                        <bitOffset>20</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>PBC5</name>
                        <description>Port D clear bit 5</description>
                        <bitOffset>21</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>PBC6</name>
                        <description>Port D clear bit 6</description>
                        <bitOffset>22</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>PBC7</name>
                        <description>Port D clear bit 7</description>
                        <bitOffset>23</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>PBC8</name>
                        <description>Port D clear bit 8</description>
                        <bitOffset>24</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>PBC9</name>
                        <description>Port D clear bit 9</description>
                        <bitOffset>25</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>PBC10</name>
                        <description>Port D clear bit 10</description>
                        <bitOffset>26</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>PBC11</name>
                        <description>Port D clear bit 11</description>
                        <bitOffset>27</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>PBC12</name>
                        <description>Port D clear bit 12</description>
                        <bitOffset>28</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>PBC13</name>
                        <description>Port D clear bit 13</description>
                        <bitOffset>29</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>PBC14</name>
                        <description>Port D clear bit 14</description>
                        <bitOffset>30</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>PBC15</name>
                        <description>Port D clear bit 15</description>
                        <bitOffset>31</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>PBS0</name>
                        <description>Port D set bit 0</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>PBS1</name>
                        <description>Port D set bit 1</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>PBS2</name>
                        <description>Port D set bit 2</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>PBS3</name>
                        <description>Port D set bit 3</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>PBS4</name>
                        <description>Port D set bit 4</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>PBS5</name>
                        <description>Port D set bit 5</description>
                        <bitOffset>5</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>PBS6</name>
                        <description>Port D set bit 6</description>
                        <bitOffset>6</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>PBS7</name>
                        <description>Port D set bit 7</description>
                        <bitOffset>7</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>PBS8</name>
                        <description>Port D set bit 8</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>PBS9</name>
                        <description>Port D set bit 9</description>
                        <bitOffset>9</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>PBS10</name>
                        <description>Port D set bit 10</description>
                        <bitOffset>10</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>PBS11</name>
                        <description>Port D set bit 11</description>
                        <bitOffset>11</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>PBS12</name>
                        <description>Port D set bit 12</description>
                        <bitOffset>12</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>PBS13</name>
                        <description>Port D set bit 13</description>
                        <bitOffset>13</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>PBS14</name>
                        <description>Port D set bit 14</description>
                        <bitOffset>14</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>PBS15</name>
                        <description>Port D set bit 15</description>
                        <bitOffset>15</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>GPIOD_PLOCK</name>
                <displayName>GPIOD_PLOCK</displayName>
                <description>GPIOD Port Configuration Lock Register</description>
                <addressOffset>0x1C</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>PLOCKK</name>
                        <description>Port configuration lock key</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>PLOCK0</name>
                        <description>Port D configuration lock for pin 0</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>PLOCK1</name>
                        <description>Port D configuration lock for pin 1</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>PLOCK2</name>
                        <description>Port D configuration lock for pin 2</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>PLOCK3</name>
                        <description>Port D configuration lock for pin 3</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>PLOCK4</name>
                        <description>Port D configuration lock for pin 4</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>PLOCK5</name>
                        <description>Port D configuration lock for pin 5</description>
                        <bitOffset>5</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>PLOCK6</name>
                        <description>Port D configuration lock for pin 6</description>
                        <bitOffset>6</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>PLOCK7</name>
                        <description>Port D configuration lock for pin 7</description>
                        <bitOffset>7</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>PLOCK8</name>
                        <description>Port D configuration lock for pin 8</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>PLOCK9</name>
                        <description>Port D configuration lock for pin 9</description>
                        <bitOffset>9</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>PLOCK10</name>
                        <description>Port D configuration lock for pin 10</description>
                        <bitOffset>10</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>PLOCK11</name>
                        <description>Port D configuration lock for pin 11</description>
                        <bitOffset>11</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>PLOCK12</name>
                        <description>Port D configuration lock for pin 12</description>
                        <bitOffset>12</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>PLOCK13</name>
                        <description>Port D configuration lock for pin 13</description>
                        <bitOffset>13</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>PLOCK14</name>
                        <description>Port D configuration lock for pin 14</description>
                        <bitOffset>14</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>PLOCK15</name>
                        <description>Port D configuration lock for pin 15</description>
                        <bitOffset>15</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>GPIOD_AFL</name>
                <displayName>GPIOD_AFL</displayName>
                <description>GPIOD Alternate Function Low Register</description>
                <addressOffset>0x20</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0xFFFFFFFF</resetValue>
                <fields>
                    <field>
                        <name>AFSEL0</name>
                        <description>Port D alternate function for pin 0</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>4</bitWidth>
                    </field>
                    <field>
                        <name>AFSEL1</name>
                        <description>Port D alternate function for pin 1</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>4</bitWidth>
                    </field>
                    <field>
                        <name>AFSEL2</name>
                        <description>Port D alternate function for pin 2</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>4</bitWidth>
                    </field>
                    <field>
                        <name>AFSEL3</name>
                        <description>Port D alternate function for pin 3</description>
                        <bitOffset>12</bitOffset>
                        <bitWidth>4</bitWidth>
                    </field>
                    <field>
                        <name>AFSEL4</name>
                        <description>Port D alternate function for pin 4</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>4</bitWidth>
                    </field>
                    <field>
                        <name>AFSEL5</name>
                        <description>Port D alternate function for pin 5</description>
                        <bitOffset>20</bitOffset>
                        <bitWidth>4</bitWidth>
                    </field>
                    <field>
                        <name>AFSEL6</name>
                        <description>Port D alternate function for pin 6</description>
                        <bitOffset>24</bitOffset>
                        <bitWidth>4</bitWidth>
                    </field>
                    <field>
                        <name>AFSEL7</name>
                        <description>Port D alternate function for pin 7</description>
                        <bitOffset>28</bitOffset>
                        <bitWidth>4</bitWidth>
                    </field>
                </fields>
            </register>
