Nsing-Community/Nsing-Pack/Nations_Device_PACK_Add_To_IAR_Tool/Nations Device PACK/debugger/Nsing/N32G41x/N32G41x.svd
        </registers>
    </peripheral>
    <peripheral>
        <name>AFIO</name>
        <description>Alternate Function I/O</description>
        <groupName>AFIO</groupName>
        <baseAddress>0x40021800</baseAddress>
        <addressBlock>
            <offset>0x0</offset>
            <size>0x400</size>
            <usage>registers</usage>
        </addressBlock>
        <registers>
            <register>
                <name>AFIO_CFG</name>
                <displayName>AFIO_CFG</displayName>
                <description>AFIO Configuration Register</description>
                <addressOffset>0x00</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>SPI2_NSS</name>
                        <description>SPI2 NSS mode</description>
                        <bitOffset>23</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>SPI1_NSS</name>
                        <description>SPI1 NSS mode</description>
                        <bitOffset>22</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>EXTIFLITEN</name>
                        <description>EXTI line filter enable</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>IOFILTCFG</name>
                        <description>IO filter control</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>2</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>AFIO_EXTI_CFG1</name>
                <displayName>AFIO_EXTI_CFG1</displayName>
                <description>AFIO EXTI Configuration Register 1</description>
                <addressOffset>0x04</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00007777</resetValue>
                <fields>
                    <field>
                        <name>EXTI0</name>
                        <description>EXTI0 configuration</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>3</bitWidth>
                    </field>
                    <field>
                        <name>EXTI1</name>
                        <description>EXTI1 configuration</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>3</bitWidth>
                    </field>
                    <field>
                        <name>EXTI2</name>
                        <description>EXTI2 configuration</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>3</bitWidth>
                    </field>
                    <field>
                        <name>EXTI3</name>
                        <description>EXTI3 configuration</description>
                        <bitOffset>12</bitOffset>
                        <bitWidth>3</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>AFIO_EXTI_CFG2</name>
                <displayName>AFIO_EXTI_CFG2</displayName>
                <description>AFIO EXTI Configuration Register 2</description>
                <addressOffset>0x08</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00007777</resetValue>
                <fields>
                    <field>
                        <name>EXTI4</name>
                        <description>EXTI4 configuration</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>3</bitWidth>
                    </field>
                    <field>
                        <name>EXTI5</name>
                        <description>EXTI5 configuration</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>3</bitWidth>
                    </field>
                    <field>
                        <name>EXTI6</name>
                        <description>EXTI6 configuration</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>3</bitWidth>
                    </field>
                    <field>
                        <name>EXTI7</name>
                        <description>EXTI7 configuration</description>
                        <bitOffset>12</bitOffset>
                        <bitWidth>3</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>AFIO_EXTI_CFG3</name>
                <displayName>AFIO_EXTI_CFG3</displayName>
                <description>AFIO EXTI Configuration Register 3</description>
                <addressOffset>0x0C</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00007777</resetValue>
                <fields>
                    <field>
                        <name>EXTI8</name>
                        <description>EXTI8 configuration</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>3</bitWidth>
                    </field>
                    <field>
                        <name>EXTI9</name>
                        <description>EXTI9 configuration</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>3</bitWidth>
                    </field>
                    <field>
                        <name>EXTI10</name>
                        <description>EXTI10 configuration</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>3</bitWidth>
                    </field>
                    <field>
                        <name>EXTI11</name>
                        <description>EXTI11 configuration</description>
                        <bitOffset>12</bitOffset>
                        <bitWidth>3</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>AFIO_EXTI_CFG4</name>
                <displayName>AFIO_EXTI_CFG4</displayName>
                <description>AFIO EXTI Configuration Register 4</description>
                <addressOffset>0x10</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00007777</resetValue>
                <fields>
                    <field>
                        <name>EXTI12</name>
                        <description>EXTI12 configuration</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>3</bitWidth>
                    </field>
                    <field>
                        <name>EXTI13</name>
                        <description>EXTI13 configuration</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>3</bitWidth>
                    </field>
                    <field>
                        <name>EXTI14</name>
                        <description>EXTI14 configuration</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>3</bitWidth>
                    </field>
                    <field>
                        <name>EXTI15</name>
                        <description>EXTI15 configuration</description>
                        <bitOffset>12</bitOffset>
                        <bitWidth>3</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>AFIO_DIGEFT_CFG1</name>
                <displayName>AFIO_DIGEFT_CFG1</displayName>
                <description>AFIO PA Digital Filter Configuration Register</description>
                <addressOffset>0x14</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>DIGEFTEN</name>
                        <description>PA digital filter enable</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>16</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>AFIO_DIGEFT_CFG2</name>
                <displayName>AFIO_DIGEFT_CFG2</displayName>
                <description>AFIO PB Digital Filter Configuration Register</description>
                <addressOffset>0x18</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>DIGEFTEN</name>
                        <description>PB digital filter enable</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>16</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>AFIO_DIGEFT_CFG3</name>
                <displayName>AFIO_DIGEFT_CFG3</displayName>
                <description>AFIO PC Digital Filter Configuration Register</description>
                <addressOffset>0x1C</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>DIGEFTEN</name>
                        <description>PC digital filter enable</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>16</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>AFIO_DIGEFT_CFG4</name>
                <displayName>AFIO_DIGEFT_CFG4</displayName>
                <description>AFIO PD Digital Filter Configuration Register</description>
                <addressOffset>0x20</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>DIGEFTEN</name>
                        <description>PD digital filter enable</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>16</bitWidth>
                    </field>
                </fields>
            </register>
