Nsing-Community/Nsing-Pack/Nations_Device_PACK_Add_To_IAR_Tool/Nations Device PACK/debugger/Nsing/N32G41x/N32G41x.svd
        </registers>
    </peripheral>
    <peripheral>
        <name>RCC</name>
        <description>Reset and Clock Control</description>
        <groupName>RCC</groupName>
        <baseAddress>0x40021000</baseAddress>
        <addressBlock>
            <offset>0x0</offset>
            <size>0x400</size>
            <usage>registers</usage>
        </addressBlock>
        <interrupt>
            <name>RCC</name>
            <description>RCC global interrupt</description>
            <value>5</value>
        </interrupt>
        <registers>
            <register>
                <name>RCC_CTRL</name>
                <displayName>RCC_CTRL</displayName>
                <description>RCC Clock Control Register</description>
                <addressOffset>0x00</addressOffset>
                <size>0x20</size>
                <resetValue>0x80014073</resetValue>
                <fields>
                    <field>
                        <name>LSIEN</name>
                        <description>LSI enable</description>
                        <bitOffset>31</bitOffset>
                        <bitWidth>1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>LSEEN</name>
                        <description>LSE enable</description>
                        <bitOffset>30</bitOffset>
                        <bitWidth>1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>LSECSSEN</name>
                        <description>LSE CSS enable</description>
                        <bitOffset>29</bitOffset>
                        <bitWidth>1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>LSEBP</name>
                        <description>LSE bypass</description>
                        <bitOffset>28</bitOffset>
                        <bitWidth>1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>LSERDF</name>
                        <description>LSE ready flag</description>
                        <bitOffset>27</bitOffset>
                        <bitWidth>1</bitWidth>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>LSIRDF</name>
                        <description>LSI ready flag</description>
                        <bitOffset>26</bitOffset>
                        <bitWidth>1</bitWidth>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>PLLRDF</name>
                        <description>PLL ready flag</description>
                        <bitOffset>25</bitOffset>
                        <bitWidth>1</bitWidth>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>PLLEN</name>
                        <description>PLL enable</description>
                        <bitOffset>24</bitOffset>
                        <bitWidth>1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>PLLBP</name>
                        <description>PLL bypass mode</description>
                        <bitOffset>23</bitOffset>
                        <bitWidth>1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>LSECAPEN</name>
                        <description>LSE capture enable</description>
                        <bitOffset>22</bitOffset>
                        <bitWidth>1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>HSECAPEN</name>
                        <description>HSE capture enable</description>
                        <bitOffset>21</bitOffset>
                        <bitWidth>1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>CLKSSEN</name>
                        <description>HSE CSS enable</description>
                        <bitOffset>20</bitOffset>
                        <bitWidth>1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>HSEBP</name>
                        <description>HSE bypass</description>
                        <bitOffset>19</bitOffset>
                        <bitWidth>1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>HSERDF</name>
                        <description>HSE ready flag</description>
                        <bitOffset>18</bitOffset>
                        <bitWidth>1</bitWidth>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>HSEEN</name>
                        <description>HSE enable</description>
                        <bitOffset>17</bitOffset>
                        <bitWidth>1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>HSITRIM</name>
                        <description>HSI calibration</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>9</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>LSITRIM</name>
                        <description>LSI calibration</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>6</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>HSIRDF</name>
                        <description>HSI ready flag</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>HSIEN</name>
                        <description>HSI enable</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>RCC_CFG</name>
                <displayName>RCC_CFG</displayName>
                <description>RCC Clock Configuration Register</description>
                <addressOffset>0x04</addressOffset>
                <size>0x20</size>
                <resetValue>0x00804000</resetValue>
                <fields>
                    <field>
                        <name>MCOPRE</name>
                        <description>MCO prescaler</description>
                        <bitOffset>29</bitOffset>
                        <bitWidth>3</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>MCO</name>
                        <description>MCU clock output source</description>
                        <bitOffset>24</bitOffset>
                        <bitWidth>3</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>PLLSYSDIV</name>
                        <description>PLL to system clock divider</description>
                        <bitOffset>23</bitOffset>
                        <bitWidth>1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>PLLMUL</name>
                        <description>PLL multiplication factor</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>7</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>PLLSRC</name>
                        <description>PLL clock source</description>
                        <bitOffset>15</bitOffset>
                        <bitWidth>1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>PLLOD</name>
                        <description>PLL output divider</description>
                        <bitOffset>14</bitOffset>
                        <bitWidth>1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>APB2PRES</name>
                        <description>APB2 prescaler</description>
                        <bitOffset>11</bitOffset>
                        <bitWidth>3</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>APB1PRES</name>
                        <description>APB1 prescaler</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>3</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>AHBPRES</name>
                        <description>AHB prescaler</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>4</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>SCLKSTS</name>
                        <description>System clock status</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>2</bitWidth>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>SCLKSW</name>
                        <description>System clock switch</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>2</bitWidth>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>RCC_CLKINT</name>
                <displayName>RCC_CLKINT</displayName>
                <description>RCC Clock Interrupt Register</description>
                <addressOffset>0x08</addressOffset>
                <size>0x20</size>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>LSESSICLR</name>
                        <description>LSE CSS interrupt clear</description>
                        <bitOffset>26</bitOffset>
                        <bitWidth>1</bitWidth>
                        <access>write-only</access>
                    </field>
                    <field>
                        <name>LSESSIEN</name>
                        <description>LSE CSS int enable</description>
                        <bitOffset>25</bitOffset>
                        <bitWidth>1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>LSESSIF</name>
                        <description>LSE CSS int flag</description>
                        <bitOffset>24</bitOffset>
                        <bitWidth>1</bitWidth>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>CLKSSICLR</name>
                        <description>HSE CSS int clear</description>
                        <bitOffset>23</bitOffset>
                        <bitWidth>1</bitWidth>
                        <access>write-only</access>
                    </field>
                    <field>
                        <name>PLLRDICLR</name>
                        <description>PLL ready int clear</description>
                        <bitOffset>20</bitOffset>
                        <bitWidth>1</bitWidth>
                        <access>write-only</access>
                    </field>
                    <field>
                        <name>HSERDICLR</name>
                        <description>HSE ready int clear</description>
                        <bitOffset>19</bitOffset>
                        <bitWidth>1</bitWidth>
                        <access>write-only</access>
                    </field>
                    <field>
                        <name>HSIRDICLR</name>
                        <description>HSI ready int clear</description>
                        <bitOffset>18</bitOffset>
                        <bitWidth>1</bitWidth>
                        <access>write-only</access>
                    </field>
                    <field>
                        <name>LSERDICLR</name>
                        <description>LSE ready int clear</description>
                        <bitOffset>17</bitOffset>
                        <bitWidth>1</bitWidth>
                        <access>write-only</access>
                    </field>
                    <field>
                        <name>LSIRDICLR</name>
                        <description>LSI ready int clear</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>1</bitWidth>
                        <access>write-only</access>
                    </field>
                    <field>
                        <name>PLLRDIEN</name>
                        <description>PLL ready int enable</description>
                        <bitOffset>12</bitOffset>
                        <bitWidth>1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>HSERDIEN</name>
                        <description>HSE ready int enable</description>
                        <bitOffset>11</bitOffset>
                        <bitWidth>1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>HSIRDIEN</name>
                        <description>HSI ready int enable</description>
                        <bitOffset>10</bitOffset>
                        <bitWidth>1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>LSERDIEN</name>
                        <description>LSE ready int enable</description>
                        <bitOffset>9</bitOffset>
                        <bitWidth>1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>LSIRDIEN</name>
                        <description>LSI ready int enable</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>CLKSSIF</name>
                        <description>HSE CSS int flag</description>
                        <bitOffset>7</bitOffset>
                        <bitWidth>1</bitWidth>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>PLLRDIF</name>
                        <description>PLL ready int flag</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>1</bitWidth>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>HSERDIF</name>
                        <description>HSE ready int flag</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>1</bitWidth>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>HSIRDIF</name>
                        <description>HSI ready int flag</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>LSERDIF</name>
                        <description>LSE ready int flag</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>LSIRDIF</name>
                        <description>LSI ready int flag</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>RCC_APB2PRST</name>
                <displayName>RCC_APB2PRST</displayName>
                <description>RCC APB2 Peripheral Reset Register</description>
                <addressOffset>0x0C</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>SPI2RST</name>
                        <description>SPI2 reset</description>
                        <bitOffset>19</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>USART4RST</name>
                        <description>USART4 reset</description>
                        <bitOffset>17</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>USART1RST</name>
                        <description>USART1 reset</description>
                        <bitOffset>14</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>ATIM2RST</name>
                        <description>ATIM2 reset</description>
                        <bitOffset>13</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>SPI1RST</name>
                        <description>SPI1 reset</description>
                        <bitOffset>12</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>ATIM1RST</name>
                        <description>ATIM1 reset</description>
                        <bitOffset>11</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>RCC_APB1PRST</name>
                <displayName>RCC_APB1PRST</displayName>
                <description>RCC APB1 Peripheral Reset Register</description>
                <addressOffset>0x10</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>CANRST</name>
                        <description>CAN reset</description>
                        <bitOffset>25</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>I2C2RST</name>
                        <description>I2C2 reset</description>
                        <bitOffset>22</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>I2C1RST</name>
                        <description>I2C1 reset</description>
                        <bitOffset>21</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>USART3RST</name>
                        <description>USART3 reset</description>
                        <bitOffset>18</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>USART2RST</name>
                        <description>USART2 reset</description>
                        <bitOffset>17</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>WWDGRST</name>
                        <description>WWDG reset</description>
                        <bitOffset>11</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>RTCRST</name>
                        <description>RTC reset</description>
                        <bitOffset>10</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>COMPRST</name>
                        <description>COMP reset</description>
                        <bitOffset>6</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>BTIM2RST</name>
                        <description>BTIM2 reset</description>
                        <bitOffset>5</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>BTIM1RST</name>
                        <description>BTIM1 reset</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>GTIM4RST</name>
                        <description>GTIM4 reset</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>GTIM3RST</name>
                        <description>GTIM3 reset</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>GTIM2RST</name>
                        <description>GTIM2 reset</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>GTIM1RST</name>
                        <description>GTIM1 reset</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                </fields>
            </register>
