Nsing-Community/Nsing-Pack/Nations_Device_PACK_Add_To_IAR_Tool/Nations Device PACK/debugger/Nsing/N32G41x/N32G41x.svd
            <register>
                <name>RCC_AHBPCLKEN</name>
                <displayName>RCC_AHBPCLKEN</displayName>
                <description>RCC AHB Peripheral Clock Enable Register</description>
                <addressOffset>0x14</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00000004</resetValue>
                <fields>
                    <field>
                        <name>ADC2EN</name>
                        <description>ADC2 clock enable</description>
                        <bitOffset>13</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>ADC1EN</name>
                        <description>ADC1 clock enable</description>
                        <bitOffset>12</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>CRCEN</name>
                        <description>CRC clock enable</description>
                        <bitOffset>6</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>GPIOEN</name>
                        <description>GPIO clock enable</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>DMAEN</name>
                        <description>DMA clock enable</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>RCC_APB2PCLKEN</name>
                <displayName>RCC_APB2PCLKEN</displayName>
                <description>RCC APB2 Peripheral Clock Enable Register</description>
                <addressOffset>0x18</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>SPI2EN</name>
                        <description>SPI2 clock enable</description>
                        <bitOffset>19</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>USART4EN</name>
                        <description>USART4 clock enable</description>
                        <bitOffset>17</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>USART1EN</name>
                        <description>USART1 clock enable</description>
                        <bitOffset>14</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>ATIM2EN</name>
                        <description>ATIM2 clock enable</description>
                        <bitOffset>13</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>SPI1EN</name>
                        <description>SPI1 clock enable</description>
                        <bitOffset>12</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>ATIM1EN</name>
                        <description>ATIM1 clock enable</description>
                        <bitOffset>11</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>RCC_APB1PCLKEN</name>
                <displayName>RCC_APB1PCLKEN</displayName>
                <description>RCC APB1 Peripheral Clock Enable Register</description>
                <addressOffset>0x1C</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>OPAMPEN</name>
                        <description>OPAMP clock enable</description>
                        <bitOffset>31</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>CANEN</name>
                        <description>CAN clock enable</description>
                        <bitOffset>25</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>I2C2EN</name>
                        <description>I2C2 clock enable</description>
                        <bitOffset>22</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>I2C1EN</name>
                        <description>I2C1 clock enable</description>
                        <bitOffset>21</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>USART3EN</name>
                        <description>USART3 clock enable</description>
                        <bitOffset>18</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>USART2EN</name>
                        <description>USART2 clock enable</description>
                        <bitOffset>17</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>WWDGEN</name>
                        <description>WWDG clock enable</description>
                        <bitOffset>11</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>RTCEN</name>
                        <description>RTC clock enable</description>
                        <bitOffset>10</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>COMPFILTEN</name>
                        <description>COMP filter clock enable</description>
                        <bitOffset>7</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>COMPEN</name>
                        <description>COMP clock enable</description>
                        <bitOffset>6</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>BTIM2EN</name>
                        <description>BTIM2 clock enable</description>
                        <bitOffset>5</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>BTIM1EN</name>
                        <description>BTIM1 clock enable</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>GTIM4EN</name>
                        <description>GTIM4 clock enable</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>GTIM3EN</name>
                        <description>GTIM3 clock enable</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>GTIM2EN</name>
                        <description>GTIM2 clock enable</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>GTIM1EN</name>
                        <description>GTIM1 clock enable</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>RCC_CTRLSTS</name>
                <displayName>RCC_CTRLSTS</displayName>
                <description>RCC Control/Status Register</description>
                <addressOffset>0x24</addressOffset>
                <size>0x20</size>
                <resetValue>0x0000000C</resetValue>
                <fields>
                    <field>
                        <name>LKUPRSTF</name>
                        <description>CPU Lockup reset flag</description>
                        <bitOffset>11</bitOffset>
                        <bitWidth>1</bitWidth>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>EMCGBNRSTF</name>
                        <description>EMC GBN reset flag</description>
                        <bitOffset>9</bitOffset>
                        <bitWidth>1</bitWidth>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>EMCGBRSTF</name>
                        <description>EMC GB reset flag</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>1</bitWidth>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>GLITCHRSTF</name>
                        <description>GLITCH reset flag</description>
                        <bitOffset>7</bitOffset>
                        <bitWidth>1</bitWidth>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>IWDGRSTF</name>
                        <description>IWDG reset flag</description>
                        <bitOffset>6</bitOffset>
                        <bitWidth>1</bitWidth>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>SFTRSTF</name>
                        <description>Software reset flag</description>
                        <bitOffset>5</bitOffset>
                        <bitWidth>1</bitWidth>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>WWDGRSTF</name>
                        <description>WWDG reset flag</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>1</bitWidth>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>PINRSTF</name>
                        <description>NRST pin reset flag</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>1</bitWidth>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>PORRSTF</name>
                        <description>Power-on reset flag</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>RMRSTF</name>
                        <description>Clear reset flags</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>RCC_AHBPRST</name>
                <displayName>RCC_AHBPRST</displayName>
                <description>RCC AHB Peripheral Reset Register</description>
                <addressOffset>0x28</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>ADC2RST</name>
                        <description>ADC2 reset</description>
                        <bitOffset>13</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>ADC1RST</name>
                        <description>ADC1 reset</description>
                        <bitOffset>12</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>GPIORST</name>
                        <description>GPIO reset</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>RCC_CFG2</name>
                <displayName>RCC_CFG2</displayName>
                <description>RCC Clock Configuration Register 2</description>
                <addressOffset>0x2C</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x8CD87800</resetValue>
                <fields>
                    <field>
                        <name>ATIM1CLKSEL</name>
                        <description>ATIM1 clock source</description>
                        <bitOffset>30</bitOffset>
                        <bitWidth>2</bitWidth>
                    </field>
                    <field>
                        <name>GTIM1CLKSEL</name>
                        <description>GTIM1 clock source</description>
                        <bitOffset>29</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>BTIM1CLKSEL</name>
                        <description>BTIM1 clock source</description>
                        <bitOffset>26</bitOffset>
                        <bitWidth>2</bitWidth>
                    </field>
                    <field>
                        <name>RTCCLKSEL</name>
                        <description>RTC clock source</description>
                        <bitOffset>24</bitOffset>
                        <bitWidth>2</bitWidth>
                    </field>
                    <field>
                        <name>USART1CLKSEL</name>
                        <description>USART1 clock source</description>
                        <bitOffset>22</bitOffset>
                        <bitWidth>2</bitWidth>
                    </field>
                    <field>
                        <name>LPCLKSEL</name>
                        <description>Low power clock source</description>
                        <bitOffset>21</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>USART4CLKSEL</name>
                        <description>USART4 clock source</description>
                        <bitOffset>19</bitOffset>
                        <bitWidth>2</bitWidth>
                    </field>
                    <field>
                        <name>ADC1MSEL</name>
                        <description>ADC 1M clock source</description>
                        <bitOffset>17</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>I2SCLKSEL</name>
                        <description>I2S clock source</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>ADC1MPRE</name>
                        <description>ADC 1M prescaler</description>
                        <bitOffset>12</bitOffset>
                        <bitWidth>4</bitWidth>
                    </field>
                    <field>
                        <name>ATIM2CLKSEL</name>
                        <description>ATIM2 clock source</description>
                        <bitOffset>10</bitOffset>
                        <bitWidth>2</bitWidth>
                    </field>
                    <field>
                        <name>GTIM2CLKSEL</name>
                        <description>GTIM2 clock source</description>
                        <bitOffset>9</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>ADCSYSPRES</name>
                        <description>ADC SYSCLK prescaler</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>4</bitWidth>
                    </field>
                    <field>
                        <name>GTIM3CLKSEL</name>
                        <description>GTIM3 clock source</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>GTIM4CLKSEL</name>
                        <description>GTIM4 clock source</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>RCC_CFG3</name>
                <displayName>RCC_CFG3</displayName>
                <description>RCC Clock Configuration Register 3</description>
                <addressOffset>0x30</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>ATIM1FILTCLK</name>
                        <description>ATIM1 filter clock divider</description>
                        <bitOffset>25</bitOffset>
                        <bitWidth>5</bitWidth>
                    </field>
                    <field>
                        <name>ATIM2FILTCLK</name>
                        <description>ATIM2 filter clock divider</description>
                        <bitOffset>20</bitOffset>
                        <bitWidth>5</bitWidth>
                    </field>
                    <field>
                        <name>GTIM1FILTCLK</name>
                        <description>GTIM1 filter clock divider</description>
                        <bitOffset>15</bitOffset>
                        <bitWidth>5</bitWidth>
                    </field>
                    <field>
                        <name>GTIM2FILTCLK</name>
                        <description>GTIM2 filter clock divider</description>
                        <bitOffset>10</bitOffset>
                        <bitWidth>5</bitWidth>
                    </field>
                    <field>
                        <name>GTIM3FILTCLK</name>
                        <description>GTIM3 filter clock divider</description>
                        <bitOffset>5</bitOffset>
                        <bitWidth>5</bitWidth>
                    </field>
                    <field>
                        <name>GTIM4FILTCLK</name>
                        <description>GTIM4 filter clock divider</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>5</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>RCC_PLLCTRL</name>
                <displayName>RCC_PLLCTRL</displayName>
                <description>RCC PLL Clock Control Register</description>
                <addressOffset>0x40</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>PLLINPRES</name>
                        <description>PLL input prescaler</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>6</bitWidth>
                    </field>
                </fields>
            </register>
