Nsing-Community/Nsing-Pack/Nations_Device_PACK_Add_To_IAR_Tool/Nations Device PACK/debugger/Nsing/N32G41x/N32G41x.svd
            <register>
                <name>RCC_PWRCTRL</name>
                <displayName>RCC_PWRCTRL</displayName>
                <description>RCC PWR Control Register</description>
                <addressOffset>0x44</addressOffset>
                <size>0x20</size>
                <resetValue>0x60180000</resetValue>
                <fields>
                    <field>
                        <name>UPSTEPWID</name>
                        <description>Power up step width</description>
                        <bitOffset>22</bitOffset>
                        <bitWidth>10</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>DOWNSTEPWID</name>
                        <description>Power down step width</description>
                        <bitOffset>12</bitOffset>
                        <bitWidth>10</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>UPSTEPEN</name>
                        <description>Power up step enable</description>
                        <bitOffset>11</bitOffset>
                        <bitWidth>1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>DOWNSTEPEN</name>
                        <description>Power down step enable</description>
                        <bitOffset>10</bitOffset>
                        <bitWidth>1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>PSTEPSFDIV</name>
                        <description>SW power step divider</description>
                        <bitOffset>7</bitOffset>
                        <bitWidth>3</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>PSTEPSFTEN</name>
                        <description>SW power step enable</description>
                        <bitOffset>6</bitOffset>
                        <bitWidth>1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>PSTEPST</name>
                        <description>PLL Power Step state</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>4</bitWidth>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>PSTEPDNF</name>
                        <description>PLL Power Step down flag</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>RMVF</name>
                        <description>Clear Power Step down flag</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>RCC_CFG4</name>
                <displayName>RCC_CFG4</displayName>
                <description>RCC Clock Configuration Register 4</description>
                <addressOffset>0x48</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x000000A1</resetValue>
                <fields>
                    <field>
                        <name>LSEGFSEL</name>
                        <description>LSE glitch filter select</description>
                        <bitOffset>9</bitOffset>
                        <bitWidth>4</bitWidth>
                    </field>
                    <field>
                        <name>LSENIMEN</name>
                        <description>LSE anti-interference enable</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>LSEBUFFOPT</name>
                        <description>LSE buffer trimming</description>
                        <bitOffset>6</bitOffset>
                        <bitWidth>2</bitWidth>
                    </field>
                    <field>
                        <name>LSEBIASTRIM</name>
                        <description>LSE bias trimming</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>4</bitWidth>
                    </field>
                    <field>
                        <name>LSEDRVTRIM</name>
                        <description>LSE core trimming</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>2</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>RCC_EMCCTRL</name>
                <displayName>RCC_EMCCTRL</displayName>
                <description>RCC EMC Control Register</description>
                <addressOffset>0x4C</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>LKUPRSTEN</name>
                        <description>CPU Lockup reset enable</description>
                        <bitOffset>31</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>GBNIEN</name>
                        <description>EMC GBN int enable</description>
                        <bitOffset>26</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>GBIEN</name>
                        <description>EMC GB int enable</description>
                        <bitOffset>25</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>GLTIEN</name>
                        <description>GLITCH int enable</description>
                        <bitOffset>24</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>GBNSW</name>
                        <description>EMC GBN switch to LSI</description>
                        <bitOffset>23</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>GBNRST</name>
                        <description>EMC GBN reset</description>
                        <bitOffset>22</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>GBNDET</name>
                        <description>EMC GBN detect enable</description>
                        <bitOffset>21</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>GBNDETSEL</name>
                        <description>EMC GBN detect level</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>2</bitWidth>
                    </field>
                    <field>
                        <name>GBSW</name>
                        <description>EMC GB switch to LSI</description>
                        <bitOffset>15</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>GBRST</name>
                        <description>EMC GB reset</description>
                        <bitOffset>14</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>GBDET</name>
                        <description>EMC GB detect enable</description>
                        <bitOffset>13</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>GBDETSEL</name>
                        <description>EMC GB detect level</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>2</bitWidth>
                    </field>
                    <field>
                        <name>GVSW</name>
                        <description>GLITCH switch to LSI</description>
                        <bitOffset>7</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>GVRST</name>
                        <description>GLITCH reset</description>
                        <bitOffset>6</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>GVDET</name>
                        <description>GLITCH detect enable</description>
                        <bitOffset>5</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>GVDETSEL</name>
                        <description>GLITCH detect level</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>5</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>RCC_CFG5</name>
                <displayName>RCC_CFG5</displayName>
                <description>RCC Clock Configuration Register 5</description>
                <addressOffset>0x50</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>HSERDFDIV</name>
                        <description>HSE ready delay divider</description>
                        <bitOffset>7</bitOffset>
                        <bitWidth>2</bitWidth>
                    </field>
                    <field>
                        <name>HSERDFDLY</name>
                        <description>HSE ready delay control</description>
                        <bitOffset>6</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>GPIOFCLKDIV</name>
                        <description>GPIO filter clock divider</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>6</bitWidth>
                    </field>
                </fields>
            </register>
