Nsing-Community/Nsing-Pack/Nations_Device_PACK_Add_To_IAR_Tool/Nations Device PACK/debugger/Nsing/N32G41x/N32G41x.svd
        </registers>
    </peripheral>
    <peripheral>
        <name>PWR</name>
        <description>Power Control</description>
        <groupName>PWR</groupName>
        <baseAddress>0x40007000</baseAddress>
        <addressBlock>
            <offset>0x0</offset>
            <size>0x400</size>
            <usage>registers</usage>
        </addressBlock>
        <interrupt>
            <name>PVD</name>
            <description>PVD interrupt through EXTI line 16</description>
            <value>1</value>
        </interrupt>
        <registers>
            <register>
                <name>PWR_CTRL</name>
                <displayName>PWR_CTRL</displayName>
                <description>PWR Control Register</description>
                <addressOffset>0x00</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x03F85000</resetValue>
                <fields>
                    <field>
                        <name>NRSTCNT</name>
                        <description>NRST pin filter width</description>
                        <bitOffset>19</bitOffset>
                        <bitWidth>7</bitWidth>
                    </field>
                    <field>
                        <name>PVDCNT</name>
                        <description>PVD filter width</description>
                        <bitOffset>14</bitOffset>
                        <bitWidth>5</bitWidth>
                    </field>
                    <field>
                        <name>IWDGRSTEN</name>
                        <description>IWDG reset enable control</description>
                        <bitOffset>12</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>PLS</name>
                        <description>PVD alarm voltage level selection</description>
                        <bitOffset>5</bitOffset>
                        <bitWidth>4</bitWidth>
                    </field>
                    <field>
                        <name>PVDEN</name>
                        <description>PVD enable control</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>PWR_CTRLSTS</name>
                <displayName>PWR_CTRLSTS</displayName>
                <description>PWR Control/Status Register</description>
                <addressOffset>0x04</addressOffset>
                <size>0x20</size>
                <access>read-only</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>PVDO</name>
                        <description>PVD module detection output</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>PWR_CTRL2</name>
                <displayName>PWR_CTRL2</displayName>
                <description>PWR Control Register 2</description>
                <addressOffset>0x08</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00000481</resetValue>
                <fields>
                    <field>
                        <name>MRLPDLY</name>
                        <description>MR LP control delay</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>12</bitWidth>
                    </field>
                    <field>
                        <name>MRLPEN</name>
                        <description>MR LOWPOWER mode control</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                </fields>
            </register>
        </registers>
    </peripheral>
    <peripheral>
        <name>FLASH</name>
        <description>FLASH Memory Controller</description>
        <groupName>FLASH</groupName>
        <baseAddress>0x40022000</baseAddress>
        <addressBlock>
            <offset>0x0</offset>
            <size>0x400</size>
            <usage>registers</usage>
        </addressBlock>
        <interrupt>
            <name>FLASH</name>
            <description>FLASH global interrupt</description>
            <value>4</value>
        </interrupt>
        <registers>
            <register>
                <name>FLASH_AC</name>
                <displayName>FLASH_AC</displayName>
                <description>FLASH Access Control Register</description>
                <addressOffset>0x00</addressOffset>
                <size>0x20</size>
                <resetValue>0x00000030</resetValue>
                <fields>
                    <field>
                        <name>ICAHEN</name>
                        <description>Icache enable</description>
                        <bitOffset>7</bitOffset>
                        <bitWidth>1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>ICAHRST</name>
                        <description>Icache reset</description>
                        <bitOffset>6</bitOffset>
                        <bitWidth>1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>PRFTBFS</name>
                        <description>Prefetch buffer status</description>
                        <bitOffset>5</bitOffset>
                        <bitWidth>1</bitWidth>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>PRFTBFE</name>
                        <description>Prefetch buffer enable</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>LATENCY</name>
                        <description>Latency</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>3</bitWidth>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>FLASH_KEY</name>
                <displayName>FLASH_KEY</displayName>
                <description>FLASH Key Register</description>
                <addressOffset>0x04</addressOffset>
                <size>0x20</size>
                <access>write-only</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>FKEY</name>
                        <description>Flash unlock key</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>32</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>FLASH_OPTKEY</name>
                <displayName>FLASH_OPTKEY</displayName>
                <description>FLASH Option Key Register</description>
                <addressOffset>0x08</addressOffset>
                <size>0x20</size>
                <access>write-only</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>OPTKEY</name>
                        <description>Option byte unlock key</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>32</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>FLASH_STS</name>
                <displayName>FLASH_STS</displayName>
                <description>FLASH Status Register</description>
                <addressOffset>0x0C</addressOffset>
                <size>0x20</size>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>FKEYF</name>
                        <description>FLASH unlock KEY1 flag</description>
                        <bitOffset>31</bitOffset>
                        <bitWidth>1</bitWidth>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>OPTKEYF</name>
                        <description>Option byte unlock KEY1 flag</description>
                        <bitOffset>30</bitOffset>
                        <bitWidth>1</bitWidth>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>EOP</name>
                        <description>End of operation</description>
                        <bitOffset>5</bitOffset>
                        <bitWidth>1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>WRPERR</name>
                        <description>Write protection error</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>PGERR</name>
                        <description>Programming error</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>BUSY</name>
                        <description>Busy</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>FLASH_CTRL</name>
                <displayName>FLASH_CTRL</displayName>
                <description>FLASH Control Register</description>
                <addressOffset>0x10</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00000080</resetValue>
                <fields>
                    <field>
                        <name>EOPITE</name>
                        <description>End of operation interrupt enable</description>
                        <bitOffset>12</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>ERRITE</name>
                        <description>Error interrupt enable</description>
                        <bitOffset>10</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>OPTWE</name>
                        <description>Option byte write enable</description>
                        <bitOffset>9</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>LOCK</name>
                        <description>Lock</description>
                        <bitOffset>7</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>START</name>
                        <description>Start erase</description>
                        <bitOffset>6</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>OPTER</name>
                        <description>Option byte erase</description>
                        <bitOffset>5</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>OPTPG</name>
                        <description>Option byte programming</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>MER</name>
                        <description>Mass erase</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>PER</name>
                        <description>Page erase</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>PG</name>
                        <description>Programming</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>FLASH_ADD</name>
                <displayName>FLASH_ADD</displayName>
                <description>FLASH Address Register</description>
                <addressOffset>0x14</addressOffset>
                <size>0x20</size>
                <access>write-only</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>FADD</name>
                        <description>Flash address</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>32</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>FLASH_OB2</name>
                <displayName>FLASH_OB2</displayName>
                <description>FLASH Option Byte Register 2</description>
                <addressOffset>0x18</addressOffset>
                <size>0x20</size>
                <access>read-only</access>
                <resetValue>0xFFFFFFFF</resetValue>
                <fields>
                    <field>
                        <name>Data1</name>
                        <description>Data1</description>
                        <bitOffset>24</bitOffset>
                        <bitWidth>8</bitWidth>
                    </field>
                    <field>
                        <name>Data0</name>
                        <description>Data0</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>8</bitWidth>
                    </field>
                    <field>
                        <name>BOOT_SEL_CAN</name>
                        <description>BOOT CAN pin selection</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>8</bitWidth>
                    </field>
                    <field>
                        <name>BOOT_SEL_I2C</name>
                        <description>BOOT I2C pin selection</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>8</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>FLASH_OB</name>
                <displayName>FLASH_OB</displayName>
                <description>FLASH Option Byte Register</description>
                <addressOffset>0x1C</addressOffset>
                <size>0x20</size>
                <access>read-only</access>
                <resetValue>0x1FFFFFFC</resetValue>
                <fields>
                    <field>
                        <name>RDPRT2</name>
                        <description>Read protection L2 level</description>
                        <bitOffset>31</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>BOOT_WRP</name>
                        <description>BOOT write protection</description>
                        <bitOffset>28</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>BOOT_SEL_UART</name>
                        <description>BOOT UART pin selection</description>
                        <bitOffset>20</bitOffset>
                        <bitWidth>8</bitWidth>
                    </field>
                    <field>
                        <name>IWDGSTOPFRZ</name>
                        <description>IWDG stop mode freeze enable</description>
                        <bitOffset>17</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>IWDGSLEEPFRZ</name>
                        <description>IWDG sleep mode freeze enable</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>BOOT0_CFG</name>
                        <description>BOOT0 default state</description>
                        <bitOffset>15</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>nSWBOOT0</name>
                        <description>nSWBOOT0 configuration</description>
                        <bitOffset>14</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>nBOOT1</name>
                        <description>nBOOT1 configuration</description>
                        <bitOffset>13</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>nBOOT0</name>
                        <description>nBOOT0 configuration</description>
                        <bitOffset>12</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>POR_DELAY</name>
                        <description>POR CPU reset delay time</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>8</bitWidth>
                    </field>
                    <field>
                        <name>NRST_PD7</name>
                        <description>PD7 pin configuration</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>IWDG_SW</name>
                        <description>Watchdog configuration</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>RDPRT1</name>
                        <description>Read protection L1 level</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>OBERR</name>
                        <description>Option byte error</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>FLASH_WRP</name>
                <displayName>FLASH_WRP</displayName>
                <description>FLASH Write Protection Register</description>
                <addressOffset>0x20</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0xFFFFFFFF</resetValue>
                <fields>
                    <field>
                        <name>WRPT</name>
                        <description>Write protection</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>32</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>FLASH_CAHR</name>
                <displayName>FLASH_CAHR</displayName>
                <description>FLASH Cache Register</description>
                <addressOffset>0x30</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>LOCKSTOP</name>
                        <description>iCache lock stop</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>4</bitWidth>
                    </field>
                    <field>
                        <name>LOCKSTRT</name>
                        <description>iCache lock start</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>4</bitWidth>
                    </field>
                </fields>
            </register>
