Nsing-Community/Nsing-Pack/Nations_Device_PACK_Add_To_IAR_Tool/Nations Device PACK/debugger/Nsing/N32G41x/N32G41x.svd
        </registers>
    </peripheral>
    <peripheral>
        <name>DBG</name>
        <description>Debug Support</description>
        <groupName>DBG</groupName>
        <baseAddress>0xE0042000</baseAddress>
        <addressBlock>
            <offset>0x0</offset>
            <size>0x400</size>
            <usage>registers</usage>
        </addressBlock>
        <registers>
            <register>
                <name>DBG_ID</name>
                <displayName>DBG_ID</displayName>
                <description>DBG ID Register</description>
                <addressOffset>0x00</addressOffset>
                <size>0x20</size>
                <access>read-only</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>SRAM</name>
                        <description>SRAM capacity</description>
                        <bitOffset>28</bitOffset>
                        <bitWidth>4</bitWidth>
                    </field>
                    <field>
                        <name>DEV_NUM_L</name>
                        <description>Device number low 4 bits</description>
                        <bitOffset>20</bitOffset>
                        <bitWidth>4</bitWidth>
                    </field>
                    <field>
                        <name>FLASH</name>
                        <description>FLASH capacity</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>4</bitWidth>
                    </field>
                    <field>
                        <name>DEV_NUM_H</name>
                        <description>Device number high 4 bits</description>
                        <bitOffset>12</bitOffset>
                        <bitWidth>4</bitWidth>
                    </field>
                    <field>
                        <name>DEV_NUM_M</name>
                        <description>Device number middle 4 bits</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>4</bitWidth>
                    </field>
                    <field>
                        <name>REV_NUM_H</name>
                        <description>Revision number high 4 bits</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>4</bitWidth>
                    </field>
                    <field>
                        <name>REV_NUM_L</name>
                        <description>Revision number low 4 bits</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>4</bitWidth>
                    </field>
                </fields>
            </register>
            <register>
                <name>DBG_CTRL</name>
                <displayName>DBG_CTRL</displayName>
                <description>DBG Control Register</description>
                <addressOffset>0x04</addressOffset>
                <size>0x20</size>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>BTIMx_STOP</name>
                        <description>BTIMx debug stop</description>
                        <bitOffset>19</bitOffset>
                        <bitWidth>2</bitWidth>
                    </field>
                    <field>
                        <name>GTIM4_STOP</name>
                        <description>GTIM4 debug stop</description>
                        <bitOffset>18</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>ATIM2_STOP</name>
                        <description>ATIM2 debug stop</description>
                        <bitOffset>17</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>I2CxSMBUS_TIMEOUT</name>
                        <description>I2Cx SMBUS timeout stop</description>
                        <bitOffset>15</bitOffset>
                        <bitWidth>2</bitWidth>
                    </field>
                    <field>
                        <name>CAN_STOP</name>
                        <description>CAN debug stop</description>
                        <bitOffset>14</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>GTIMx_STOP</name>
                        <description>GTIMx debug stop (x=3,2,1)</description>
                        <bitOffset>11</bitOffset>
                        <bitWidth>3</bitWidth>
                    </field>
                    <field>
                        <name>ATIM1_STOP</name>
                        <description>ATIM1 debug stop</description>
                        <bitOffset>10</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>WWDG_STOP</name>
                        <description>WWDG debug stop</description>
                        <bitOffset>9</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                    <field>
                        <name>IWDG_STOP</name>
                        <description>IWDG debug stop</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>1</bitWidth>
                    </field>
                </fields>
            </register>
        </registers>
    </peripheral>
</peripherals>
</device>